
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПутьМетаданных = РеквизитФормыВЗначение("Объект").Метаданные().ПолноеИмя();

	Элементы.ГруппаНастройки.Видимость = Ложь;
	
	РазмерПорции = 20;
	Нечеткость = 25;
	ПоказыватьОписания = Истина;
	ОграничитьОбъектыПоиска = Ложь;
	
	Если ПолнотекстовыйПоиск.ПолучитьРежимПолнотекстовогоПоиска() <> РежимПолнотекстовогоПоиска.Разрешить Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Использование полнотекстового поиска не разрешено. Вы можете включить его в диалоге ""Управление полнотекстовым поиском""'", "ru");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	ПоказаныРезультатыСПо = НСтр("ru = 'Введите строку поиска'", "ru");
	ТекущаяПозиция = 0;
	
	Элементы.Далее.Доступность = Ложь;
	Элементы.Назад.Доступность = Ложь;
	
	Массив = ХранилищеОбщихНастроек.Загрузить("ПолнотекстовыйПоискСтрокиПолнотекстовогоПоиска");
	
	Если Массив <> Неопределено Тогда
		Элементы.ПолеВводаПоиска.СписокВыбора.ЗагрузитьЗначения(Массив);
	КонецЕсли;
	
	ОбновитьДатуАктуальностиНаСервере();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура HTMLТекстПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	ЭлементHTML = ДанныеСобытия.Anchor;
	
	Если ЭлементHTML = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если (ЭлементHTML.id = "FullTextSearchListItem") Тогда
		
        ВыбранныйНомер = ЭлементHTML.getAttribute("sel_num");
        НомерВСписке = Число(ВыбранныйНомер);
		
		ВыбраннаяСтрока = РезультатыПоиска[НомерВСписке].Значение;
		ПоказатьЗначение(, ВыбраннаяСтрока);
		
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьМетаданные(Команда)
	
	ПараметрыФормы = Новый Структура("СписокМетаданных", СписокМетаданных);
	
	Оповещение = Новый ОписаниеОповещения(
             "ВыбратьМетаданныеЗавершение",
             ЭтаФорма);
			 
	ОткрытьФорму(
		ПутьМетаданных + ".Форма.ФормаВыбораМетаданных", 
		ПараметрыФормы,,,,,Оповещение);
	
КонецПроцедуры

// Обработчик команды Назад
&НаКлиенте
Процедура НазадВыполнить()
	
	Искать(-1);
	
КонецПроцедуры

// Обработчик команды Далее
&НаКлиенте
Процедура ДалееВыполнить()
	
	Искать(1);
	
КонецПроцедуры

// Обработка команды Найти
&НаКлиенте
Процедура ИскатьВыполнить()
	
	Искать(0);
	
КонецПроцедуры

&НаКлиенте
Процедура Настройка(Команда)
	
	Элементы.ГруппаНастройки.Видимость = Не Элементы.ГруппаНастройки.Видимость;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИндекс(Команда)
	
	ПоказатьОповещениеПользователя(НСтр("ru = 'Обновление индекса'"), , НСтр("ru = 'Обновление индекса полнотекстового поиска'"), БиблиотекаКартинок.Обновить);
	
	ОбновитьИндексНаСервере(ЭтотОбъект.УникальныйИдентификатор);
	
	ЭтотОбъект.ПодключитьОбработчикОжидания("ОбработчикОжиданияВыполненияЗадания", 3);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура выполняет полнотекстовый поиск
&НаСервере
Процедура ИскатьВыполнитьСервер(Направление) Экспорт
	
	СписокПоиска = ПолнотекстовыйПоиск.СоздатьСписок(СтрокаПоиска, РазмерПорции);
	
	СписокПоиска.ПолучатьОписание = ПоказыватьОписания;
	СписокПоиска.РазмерПорции = РазмерПорции;
	
	Если ПрименитьНечеткийПоиск = Истина Тогда
		СписокПоиска.ПорогНечеткости = Нечеткость;
	Иначе	
		СписокПоиска.ПорогНечеткости = 0;
	КонецЕсли;
	
	Если ОграничитьОбъектыПоиска = Истина Тогда
		
		МассивМД = Новый Массив();
		Для Каждого МД Из СписокМетаданных Цикл
			Метаданное = Метаданные.НайтиПоПолномуИмени(МД.Значение);
			МассивМД.Добавить(Метаданное);
		КонецЦикла;	
		
		СписокПоиска.ОбластьПоиска = МассивМД;
		
	Иначе	
		
		МассивМД = Новый Массив();
		СписокПоиска.ОбластьПоиска = МассивМД;
		
	КонецЕсли;
	
	Если Направление = 0 Тогда
		СписокПоиска.ПерваяЧасть();      
	ИначеЕсли Направление = -1 Тогда
		СписокПоиска.ПредыдущаяЧасть(ТекущаяПозиция);      
	ИначеЕсли Направление = 1 Тогда
		СписокПоиска.СледующаяЧасть(ТекущаяПозиция);      
	КонецЕсли;        	
	
	РезультатыПоиска.Очистить();
	Для каждого Результат Из СписокПоиска Цикл
		РезультатыПоиска.Добавить(Результат.Значение);
	КонецЦикла; 	
	
	HTMLТекст = СписокПоиска.ПолучитьОтображение(ВидОтображенияПолнотекстовогоПоиска.HTMLТекст);
	
	HTMLТекст = СтрЗаменить(HTMLТекст, "<td>", "<td><font face=""Arial"" size=""2"">");
	HTMLТекст = СтрЗаменить(HTMLТекст, "<td valign=top width=1>", "<td valign=top width=1><font face=""Arial"" size=""1"">");
	HTMLТекст = СтрЗаменить(HTMLТекст, "<body>", "<body topmargin=0 leftmargin=0>");
	HTMLТекст = СтрЗаменить(HTMLТекст, "</td>", "</font></td>");
	HTMLТекст = СтрЗаменить(HTMLТекст, "<b>", "");
	HTMLТекст = СтрЗаменить(HTMLТекст, "</b>", "");
	
	ТекущаяПозиция = СписокПоиска.НачальнаяПозиция();
	ПолноеКоличество = СписокПоиска.ПолноеКоличество();       	
	
	Если РезультатыПоиска.Количество() <> 0 Тогда
		ПоказаныРезультатыСПо = 
			НСтр("ru ='Показаны '", "ru") + 
			Строка(ТекущаяПозиция + 1) + " - " +  
			Строка(ТекущаяПозиция + РезультатыПоиска.Количество()) + 
			НСтр("ru =' из '", "ru") + Строка(ПолноеКоличество);
			
		Элементы.Далее.Доступность = (ПолноеКоличество - ТекущаяПозиция) > РезультатыПоиска.Количество();
		Элементы.Назад.Доступность = (ТекущаяПозиция > 0);
	Иначе
		ПоказаныРезультатыСПо = НСтр("ru = 'Не найдено'", "ru");
		Элементы.Далее.Доступность = Ложь;
		Элементы.Назад.Доступность = Ложь;
	КонецЕсли;
	
	СохраненнаяСтрока = Элементы.ПолеВводаПоиска.СписокВыбора.НайтиПоЗначению(СтрокаПоиска);
	Если СохраненнаяСтрока <> Неопределено Тогда
		Элементы.ПолеВводаПоиска.СписокВыбора.Удалить(СохраненнаяСтрока);
	КонецЕсли;
		
	Элементы.ПолеВводаПоиска.СписокВыбора.Вставить(0, СтрокаПоиска);
	Строки = Элементы.ПолеВводаПоиска.СписокВыбора.ВыгрузитьЗначения();
		
	ХранилищеОбщихНастроек.Сохранить("ПолнотекстовыйПоискСтрокиПолнотекстовогоПоиска", , Строки);
	
КонецПроцедуры
        
// Процедура поиска, получение и отображение результата
&НаКлиенте
Процедура Искать(Направление)
	
	Если ПустаяСтрока(СтрокаПоиска) Тогда
		ПоказатьПредупреждение( , НСтр("ru = 'Не задана строка поиска.'", "ru"), 60);
		Возврат;
	КонецЕсли;
	
	ИскатьВыполнитьСервер(Направление);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьМетаданныеЗавершение(СписокМетаданныхВозврат, Параметры) Экспорт
	
	Если СписокМетаданныхВозврат <> Неопределено Тогда
		СписокМетаданных = СписокМетаданныхВозврат;
		ОграничитьОбъектыПоиска = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьИндексНаСервере(УникальныйИдентификатор)

	ФоновыеЗадания.Выполнить("ОбщийМодульСервер.ОбновитьИндекс", , УникальныйИдентификатор, НСтр("ru = 'Обновление индекса полнотекстового поиска'"));

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОжиданияВыполненияЗадания()

	Если ЗаданиеВыполненоНаСервере(ЭтотОбъект.УникальныйИдентификатор) Тогда
		ОтключитьОбработчикОжидания("ОбработчикОжиданияВыполненияЗадания");
		ПоказатьОповещениеПользователя(НСтр("ru = 'Индекс обновлен'"), , НСтр("ru = 'Индекс полнотекстового поиска обновлен'"), БиблиотекаКартинок.УстановитьФлажки);
		ОбновитьДатуАктуальностиНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбновитьДатуАктуальностиНаСервере()

	ДатаАктуальности = Формат(ПолнотекстовыйПоиск.ДатаАктуальности(), "ДФ='dd.MM.yyyy HH:mm:ss'; ДП='Нет даты'");
	Если ПолнотекстовыйПоиск.ИндексАктуален() Тогда
		Элементы.ДатаАктуальности.ЦветТекста = WebЦвета.Зеленый;
	Иначе
		Элементы.ДатаАктуальности.ЦветТекста = WebЦвета.Красный;
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаданиеВыполненоНаСервере(ИдентификаторЗадания)

	Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);

	Если Задание <> Неопределено И Задание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;

КонецФункции

#КонецОбласти
