
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	СтандартнаяОбработка     = Ложь;
	ТаблицаЖурналРегистрации = Новый ТаблицаЗначений;
	НастройкиКомпоновщика    = КомпоновщикНастроек.ПолучитьНастройки();
	ТекущийПериод            = НастройкиКомпоновщика.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период")).Значение;
	
	Если НастройкиКомпоновщика.ДополнительныеСвойства.Свойство("Период") Тогда
		ТекущийПериод = НастройкиКомпоновщика.ДополнительныеСвойства.Период;
		НастройкиКомпоновщика.ПараметрыДанных.УстановитьЗначениеПараметра("Период", ТекущийПериод);
	КонецЕсли;		
	
	ЖурналИсторииДанных = Новый ТаблицаЗначений;
	ЖурналИсторииДанных.Колонки.Добавить("Фильм", Новый ОписаниеТипов("СправочникСсылка.Фильмы"));
	ЖурналИсторииДанных.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ЖурналИсторииДанных.Колонки.Добавить("ДатаПоиска", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ЖурналИсторииДанных.Колонки.Добавить("Комментарий", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(100, ДопустимаяДлина.Переменная)));
	ЖурналИсторииДанных.Колонки.Добавить("НомерВерсии", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(3, 0, ДопустимыйЗнак.Любой)));
	
	Отбор           = Новый Структура("Метаданные, ДатаНачала, ДатаОкончания", Метаданные.Справочники.Фильмы, ТекущийПериод.ДатаНачала, ТекущийПериод.ДатаОкончания);
	ПараметрыОтбора = Новый Структура("Фильм, Комментарий, ДатаПоиска");
	
	ВыгрузитьЖурналРегистрации(ТаблицаЖурналРегистрации, Отбор, "Данные");
	ТаблицаЖурналРегистрации.Свернуть("Данные");
	Отбор = Новый Структура("Данные");
		
	Для каждого СтрокаЖурнала Из ТаблицаЖурналРегистрации Цикл
		
		Если ЗначениеЗаполнено(СтрокаЖурнала.Данные)
			И СтрокаЖурнала.Данные.ПолучитьОбъект() = Неопределено
		Тогда
			Продолжить;
		КонецЕсли;

		Отбор.Данные  = СтрокаЖурнала.Данные;
		ЗаписиИстории = ИсторияДанных.ВыбратьВерсии(Отбор);
		
		Для каждого ЗаписьИстории Из ЗаписиИстории Цикл
		
			ДанныеВерсии = ИсторияДанных.ПолучитьДанныеВерсии(Отбор.Данные, ЗаписьИстории.НомерВерсии);
			Если ДанныеВерсии = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если НЕ ПустаяСтрока(ДанныеВерсии.Комментарий) Тогда
				
				ПараметрыОтбора.Фильм       = Отбор.Данные;
				ПараметрыОтбора.Комментарий = ДанныеВерсии.Комментарий;
				ПараметрыОтбора.ДатаПоиска  = ЗаписьИстории.Дата;
				ИскомыеСтроки = ЖурналИсторииДанных.НайтиСтроки(ПараметрыОтбора);
				
				Если ИскомыеСтроки.Количество() = 0 Тогда
					НоваяСтрокаИстории             = ЖурналИсторииДанных.Добавить();
					НоваяСтрокаИстории.Фильм       = Отбор.Данные;
					НоваяСтрокаИстории.Дата        = ЗаписьИстории.Дата;
					НоваяСтрокаИстории.ДатаПоиска  = ЗаписьИстории.Дата;
					НоваяСтрокаИстории.Комментарий = ДанныеВерсии.Комментарий;
					НоваяСтрокаИстории.НомерВерсии = ЗаписьИстории.НомерВерсии;
				Иначе
					ИскомаяСтрока = ИскомыеСтроки.Получить(0);
					Если ИскомаяСтрока.Дата > ЗаписьИстории.Дата Тогда
						ИскомаяСтрока.Дата = ЗаписьИстории.Дата;
						ИскомаяСтрока.ДатаПоиска = ЗаписьИстории.ДатаПоиска;
						ИскомаяСтрока.НомерВерсии = ЗаписьИстории.НомерВерсии;
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
		
		КонецЦикла;
	
	КонецЦикла;
	
	ВнешниеНаборыДанных = Новый Структура("ЖурналИсторииДанных", ЖурналИсторииДанных);
	КомпоновщикМакета   = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки     = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновщика, ДанныеРасшифровки);

	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры
