#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЕстьВФильмотеке Тогда
		ИмяФайла = "";
	КонецЕсли;
	
	Если ПустаяСтрока(ОригинальноеНазвание) ИЛИ НЕ ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Фильмы.Код КАК Код,
		|	Фильмы.Ссылка КАК Ссылка,
		|	Фильмы.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Фильмы КАК Фильмы
		|ГДЕ
		|	НЕ Фильмы.ПометкаУдаления
		|	И Фильмы.ОригинальноеНазвание = &ОригинальноеНазвание
		|	И Фильмы.Родитель = &Родитель
		|
		|УПОРЯДОЧИТЬ ПО
		|	Фильмы.ДатаВыхода");
	Запрос.УстановитьПараметр("ОригинальноеНазвание", ОригинальноеНазвание);
	Запрос.УстановитьПараметр("Родитель", Родитель);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "С оригинальным наименованием """ + ОригинальноеНазвание + """ уже есть такой фильм: " + "(" + Выборка.Код + ") " + Выборка.Наименование;
		Сообщение.Поле = "ОригинальноеНазвание";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоГруппа Тогда
		Если ЕстьВФильмотеке Тогда
			НаборЗаписей = РегистрыСведений.ДатыСкачиванияФильмов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Фильм.Установить(Ссылка);
			НаборЗаписей.Прочитать();
			Если НаборЗаписей.Количество() = 0 Тогда
				Запись = НаборЗаписей.Добавить();
				Запись.Фильм = Ссылка;
				Запись.ДатаСкачивания = ОбщийМодульВызовСервера.ДатаСеанса();
			КонецЕсли;
			Попытка
			    НаборЗаписей.Записать();
			Исключение
				Отказ = Истина;
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Ошибка записи фильма; по причине: " + ОписаниеОшибки();
				Сообщение.Сообщить();
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
