
Процедура ПриНачалеРаботыСистемы()

	#Если НЕ ВебКлиент Тогда
		
		Экраны = ПолучитьИнформациюЭкрановКлиента();
		
		Настройки = Новый НастройкиКлиентскогоПриложения;
		
		Если Экраны[0].Высота > 1000 Тогда
			Настройки.ВариантМасштабаФормКлиентскогоПриложения = ВариантМасштабаФормКлиентскогоПриложения.Обычный;
		Иначе
			Настройки.ВариантМасштабаФормКлиентскогоПриложения = ВариантМасштабаФормКлиентскогоПриложения.Компактный;
		КонецЕсли;
		
		ОбновитьИнтерфейс();
		
		ПодключитьОбработчикОжидания("ПроверитьАвтоЗавершениеСеансов", 600);
		
	#КонецЕсли
	
	ОбщийМодульКлиент.ОбработатьПараметрыЗапуска(ПараметрЗапуска);
	
КонецПроцедуры

Процедура ПередНачаломРаботыСистемы(Отказ)

	#Если ВебКлиент Тогда
		КлиентскоеПриложение.УстановитьРежимОсновногоОкна(РежимОсновногоОкнаКлиентскогоПриложения.РабочееМесто);
	#КонецЕсли
	
КонецПроцедуры

Процедура ПроверитьАвтоЗавершениеСеансов() Экспорт

	АвтоЗавершениеСеансов = ОбщийМодульВызовСервера.ЗначениеКонстанты("АвтоЗавершениеСеансов");
	
	Если АвтоЗавершениеСеансов Тогда
		
		ВремяЗавершения  = ОбщийМодульВызовСервера.ЗначениеКонстанты("ВремяАвтоЗавершенияСеансов");
		мТекущаяДата     = ТекущаяДата();
		мТекущееВремя    = мТекущаяДата - НачалоДня(мТекущаяДата);
		КоличествоСекунд = мТекущееВремя - (ВремяЗавершения - '00010101');
		ЗавершитьРаботу  = Ложь;
		
		Если КоличествоСекунд > 0 Тогда
			Если КоличествоСекунд <= 600 Тогда
				ЗавершитьРаботу = Истина;
			КонецЕсли;
		Иначе
			Если КоличествоСекунд + 600 >= 0 Тогда
				ЗавершитьРаботу = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗавершитьРаботу Тогда
			ПоказатьОповещениеПользователя("Завершение работы системы", , "Время завершения: " + мТекущаяДата, БиблиотекаКартинок.УдалитьНепосредственно);
			ЗавершитьРаботуСистемы(Ложь);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры