#Область ОбработчикиСобытий

Процедура ПриНачалеРаботыСистемы()

		
#Если ТолстыйКлиентУправляемоеПриложение Тогда
	
	Экраны = ПолучитьИнформациюЭкрановКлиента();
	
	Настройки = Новый НастройкиКлиентскогоПриложения;
	
	Если Экраны[0].Высота > 1000 Тогда
		Настройки.ВариантМасштабаФормКлиентскогоПриложения = ВариантМасштабаФормКлиентскогоПриложения.Обычный;
	Иначе
		Настройки.ВариантМасштабаФормКлиентскогоПриложения = ВариантМасштабаФормКлиентскогоПриложения.Компактный;
	КонецЕсли;
	
	ОбновитьИнтерфейс();

#КонецЕсли
		
#Если НЕ ВебКлиент Тогда
	ПодключитьОбработчикОжидания("ПроверитьАвтоЗавершениеСеансов", 600);
#КонецЕсли
	
	ОбщийМодульКлиент.ОбработатьПараметрыЗапуска(ПараметрЗапуска);
	
КонецПроцедуры

Процедура ПередНачаломРаботыСистемы(Отказ)

#Если ВебКлиент Тогда
	КлиентскоеПриложение.УстановитьРежимОсновногоОкна(РежимОсновногоОкнаКлиентскогоПриложения.РабочееМесто);
#КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьАвтоЗавершениеСеансов() Экспорт

	АвтоЗавершениеСеансов = ОбщийМодульВызовСервера.ЗначениеКонстанты("АвтоЗавершениеСеансов");
	
	Если АвтоЗавершениеСеансов Тогда
		
		ВремяЗавершения  = ОбщийМодульВызовСервера.ЗначениеКонстанты("ВремяАвтоЗавершенияСеансов");
		ТекТекущаяДата   = ОбщийМодульКлиент.ДатаСеанса();
		ТекТекущееВремя  = ТекТекущаяДата - НачалоДня(ТекТекущаяДата);
		КоличествоСекунд = ТекТекущееВремя - (ВремяЗавершения - '00010101');
		ЗавершитьРаботу  = Ложь;
		
		Если КоличествоСекунд > 0 Тогда
			Если КоличествоСекунд <= 600 Тогда
				ЗавершитьРаботу = Истина;
			КонецЕсли;
		Иначе
			Если КоличествоСекунд + 600 >= 0 Тогда
				ЗавершитьРаботу = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗавершитьРаботу Тогда
			ПоказатьОповещениеПользователя("Завершение работы системы", , "Время завершения: " + ТекТекущаяДата, БиблиотекаКартинок.УдалитьНепосредственно);
			ЗавершитьРаботуСистемы(Ложь);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
