#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УстановитьЗначениеПараметраТолькоФормат3D();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТолькоФормат3DПриИзменении(Элемент)
	
	УстановитьЗначениеПараметраТолькоФормат3D();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьЗначениеПараметраТолькоФормат3D()

	Список.Параметры.УстановитьЗначениеПараметра("ТолькоФормат3D", ТолькоФормат3D);

КонецПроцедуры // УстановитьЗначениеПараметраТолькоФормат3D()

#КонецОбласти
