
Процедура ПроверкаПовторяющихсяНаименованийПередЗаписью(Источник, Отказ) Экспорт

	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Источник.ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;
	
	ОписанияМетаданных = Источник.Метаданные();
	
	Если ОписанияМетаданных.ДлинаНаименования = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый ("Запрос");
	
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Ссылка
		|ИЗ
		|	Справочник." + ОписанияМетаданных.Имя + "
		|ГДЕ
		|	Наименование = &Наименование
		|	И НЕ ПометкаУдаления";
		
	Запрос.УстановитьПараметр("Наименование", Источник.Наименование);
	
	Если ОписанияМетаданных.Иерархический Тогда
		Запрос.УстановитьПараметр("Родитель", Источник.Родитель);
		ТекстЗапроса = ТекстЗапроса +
			" И Родитель = &Родитель";
	КонецЕсли;
		
	Запрос.Текст = ТекстЗапроса;	
	
	Результат = Запрос.Выполнить();
	
	Отказ = НЕ Результат.Пустой();	

	Если Отказ Тогда
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Элемент с таким наименованием уже записан в ИБ!";
		Сообщение.Поле = "Наименование";
		Сообщение.УстановитьДанные(Источник);
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СинхронизироватьТаблицуФильмов(ТаблицаИменФайлов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Т.Фильм КАК Фильм,
		|	Т.ИмяФайла КАК ИмяФайла,
		|	Т.ПолноеИмя КАК ПолноеИмя,
		|	Т.Размер КАК Размер,
		|	Т.Найден КАК Найден
		|ПОМЕСТИТЬ ВрФильмы
		|ИЗ
		|	&ТаблицаИменФайлов КАК Т
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВрФильмы.Фильм КАК Фильм,
		|	ВрФильмы.Фильм.РазмерФайла КАК РазмерФайла,
		|	ВрФильмы.Размер КАК Размер
		|ИЗ
		|	ВрФильмы КАК ВрФильмы
		|ГДЕ
		|	ВрФильмы.Найден = ИСТИНА
		|	И (ВрФильмы.Фильм.РазмерФайла <> ВрФильмы.Размер
		|		ИЛИ ВрФильмы.Фильм.ЕстьВФильмотеке = ЛОЖЬ)
		|УПОРЯДОЧИТЬ ПО
		|	Фильм.Наименование";
	Запрос.УстановитьПараметр("ТаблицаИменФайлов", ТаблицаИменФайлов);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл

		СпрОбъект = Выборка.Фильм.ПолучитьОбъект();
		СпрОбъект.ОбменДанными.Загрузка = Истина;
		
		Если СпрОбъект.РазмерФайла <> Выборка.Размер Тогда
		    СпрОбъект.РазмерФайла = Выборка.Размер;
		КонецЕсли; 
		
		Если НЕ СпрОбъект.ЕстьВФильмотеке Тогда
		    СпрОбъект.ЕстьВФильмотеке = Истина;
		КонецЕсли; 
		
		Если СпрОбъект.Модифицированность() Тогда
			Попытка
			    СпрОбъект.Записать();
			Исключение
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Обновление реквизитов фильма'"), УровеньЖурналаРегистрации.Ошибка, , Выборка.Фильм, ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СохранитьНастройкуВХранилище(КлючОбъекта, КлючНастроек, Настройки, ОписаниеНастроек = Неопределено, ИмяПользователя = Неопределено) Экспорт
	
	ХранилищеОбщихНастроек.Сохранить(КлючОбъекта, КлючНастроек, Настройки);
	
КонецПроцедуры

Функция ЗагрузитьНастройкуИзХранилища(КлючОбъекта, КлючНастроек, ОписаниеНастроек = Неопределено, ИмяПользователя = Неопределено) Экспорт
	
	Настройка = ХранилищеОбщихНастроек.Загрузить(КлючОбъекта, КлючНастроек, ОписаниеНастроек, ИмяПользователя);
	
	Возврат Настройка;
	
КонецФункции

Процедура КонтрольКорректностиЗаполнения() Экспорт
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 5
		|	Фильмы.Ссылка КАК Фильм,
		|	Фильмы.ДатаВыхода КАК ДатаВыхода,
		|	СОКРЛП(Фильмы.Наименование) КАК Наименование,
		|	МинимальныйРазмерИзображения.Значение КАК МинимальныйРазмерИзображения
		|ПОМЕСТИТЬ ВТ_Фильмы
		|ИЗ
		|	Справочник.Фильмы КАК Фильмы
		|		ПОЛНОЕ СОЕДИНЕНИЕ Константа.МинимальныйРазмерИзображения КАК МинимальныйРазмерИзображения
		|		ПО (ИСТИНА)
		|ГДЕ
		|	НЕ Фильмы.ЗаполненКорректно
		|	И НЕ Фильмы.ЭтоГруппа
		|	И НЕ Фильмы.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Фильмы.Фильм КАК Фильм,
		|	Фильмы.ДатаВыхода КАК ДатаВыхода,
		|	Фильмы.Наименование КАК Наименование,
		|	МАКСИМУМ(ЕСТЬNULL(Аннотации.Ссылка, НЕОПРЕДЕЛЕНО)) КАК Аннотация,
		|	МАКСИМУМ(ЕСТЬNULL(ЖанрыФильмов.Жанр, НЕОПРЕДЕЛЕНО)) КАК Жанр,
		|	МАКСИМУМ(ЕСТЬNULL(СтраныПроизводители.Страна, НЕОПРЕДЕЛЕНО)) КАК Страна,
		|	Фильмы.МинимальныйРазмерИзображения КАК МинимальныйРазмерИзображения
		|ПОМЕСТИТЬ ВТ_ИтоговыеДанные
		|ИЗ
		|	ВТ_Фильмы КАК Фильмы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Аннотации КАК Аннотации
		|		ПО Фильмы.Фильм = Аннотации.Владелец
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖанрыФильмов КАК ЖанрыФильмов
		|		ПО Фильмы.Фильм = ЖанрыФильмов.Фильм
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтраныПроизводители КАК СтраныПроизводители
		|		ПО Фильмы.Фильм = СтраныПроизводители.Фильм
		|
		|СГРУППИРОВАТЬ ПО
		|	Фильмы.Фильм,
		|	Фильмы.ДатаВыхода,
		|	Фильмы.Наименование,
		|	Фильмы.МинимальныйРазмерИзображения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИтоговыеДанные.Фильм КАК Фильм,
		|	ИтоговыеДанные.Фильм.Афиша КАК Афиша,
		|	ИтоговыеДанные.МинимальныйРазмерИзображения КАК МинимальныйРазмерИзображения
		|ИЗ
		|	ВТ_ИтоговыеДанные КАК ИтоговыеДанные
		|ГДЕ
		|	ИтоговыеДанные.Аннотация <> НЕОПРЕДЕЛЕНО
		|	И ИтоговыеДанные.Жанр <> НЕОПРЕДЕЛЕНО
		|	И ИтоговыеДанные.Страна <> НЕОПРЕДЕЛЕНО
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИтоговыеДанные.ДатаВыхода,
		|	ИтоговыеДанные.Наименование";
	
	Схема  = Новый СхемаЗапроса;
	Схема.УстановитьТекстЗапроса(ТекстЗапроса);

	Схема  = Новый СхемаЗапроса;
	Схема.УстановитьТекстЗапроса(ТекстЗапроса);
	
	мТекущаяДата   = ТекущаяДатаСеанса();
	НачальноеЧисло = Час(мТекущаяДата) * 3600 + Минута(мТекущаяДата) * 60 + Секунда(мТекущаяДата);
	ГенСлЧисел     = Новый ГенераторСлучайныхЧисел(НачальноеЧисло);
	КолЗаписей     = ГенСлЧисел.СлучайноеЧисло(1, 30);
	Нечетное       = ?(Окр(КолЗаписей / 2) = КолЗаписей / 2, Ложь, Истина);
	Обновлять      = Ложь;
	
	Для каждого ТекПакетЗапросов Из Схема.ПакетЗапросов Цикл
		
		Для каждого ТекОператор Из ТекПакетЗапросов.Операторы Цикл
			Если ТекОператор.КоличествоПолучаемыхЗаписей <> Неопределено Тогда
				ТекОператор.КоличествоПолучаемыхЗаписей = КолЗаписей;
			КонецЕсли;
		КонецЦикла;
		
		Для каждого ТекПорядок Из ТекПакетЗапросов.Порядок Цикл
			Если Нечетное Тогда
		    	ТекПорядок.Направление = НаправлениеПорядкаСхемыЗапроса.ПоВозрастанию;
			Иначе
		    	ТекПорядок.Направление = НаправлениеПорядкаСхемыЗапроса.ПоУбыванию;
			КонецЕсли;
			Нечетное = НЕ Нечетное;
		КонецЦикла;
	
	КонецЦикла;

	Запрос = Новый Запрос(Схема.ПолучитьТекстЗапроса());

	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ЗначениеВХранилище = Выборка.Афиша.Получить();
		Если ТипЗнч(ЗначениеВХранилище) <> Тип("Картинка") Тогда
			Продолжить;
		Иначе
			Если ЗначениеВХранилище.Вид = ВидКартинки.Пустая Тогда
				Продолжить;
			КонецЕсли;
			ДвчДанные = ЗначениеВХранилище.ПолучитьДвоичныеДанные();
			Если ТипЗнч(ДвчДанные) = Тип("ДвоичныеДанные") Тогда
				РазмерДанных = ДвчДанные.Размер();
				Если Выборка.МинимальныйРазмерИзображения > РазмерДанных Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		СпрОбъект = Выборка.Фильм.ПолучитьОбъект();
		СпрОбъект.ОбменДанными.Загрузка = Истина;
		СпрОбъект.ЗаполненКорректно = Истина;
		
		Попытка
		    СпрОбъект.Записать();
			Обновлять = Истина;
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
	Если Обновлять Тогда
		ОбновитьИсториюДанных();
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьСтруктуруПараметровЭлПочты() Экспорт

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("АдресСервераSMTP",	Константы.АдресСервераSMTP.Получить());
	СтруктураПараметров.Вставить("Пароль",				Константы.Пароль.Получить());
	СтруктураПараметров.Вставить("Пользователь",		Константы.Пользователь.Получить());
	СтруктураПараметров.Вставить("ПортSMTP",			Константы.ПортSMTP.Получить());
	СтруктураПараметров.Вставить("АдресОтправителя",	Константы.АдресОтправителя.Получить());
	
	Возврат СтруктураПараметров;

КонецФункции

Процедура ОбновитьИсториюДанных() Экспорт
	
	ИсторияДанных.ОбновитьИсторию();

КонецПроцедуры

Процедура ОбновитьИндекс() Экспорт

	ПолнотекстовыйПоиск.ОбновитьИндекс(Истина, Истина);

КонецПроцедуры

Процедура Пауза(Секунд) Экспорт
	
	ТекущийСеансИнформационнойБазы = ПолучитьТекущийСеансИнформационнойБазы();
	ФоновоеЗадание = ТекущийСеансИнформационнойБазы.ПолучитьФоновоеЗадание();
	
	Если ФоновоеЗадание = Неопределено Тогда
		Параметры = Новый Массив;
		Параметры.Добавить(Секунд);
		ФоновоеЗадание = ФоновыеЗадания.Выполнить("ОбщийМодульСервер.Пауза", Параметры);
	КонецЕсли;
		
	Попытка
		ФоновоеЗадание.ОжидатьЗавершения(Секунд);
	Исключение
		Возврат;
	КонецПопытки;
	
КонецПроцедуры

Процедура УменьшениеРазмеровИзображений() Экспорт
	
	Перем КодВозврата;
	
	УтилитаСжатияИзображений = Константы.УтилитаСжатияИзображений.Получить(); //"C:\Program Files\XnView\nconvert.exe";
	Если ПустаяСтрока(УтилитаСжатияИзображений) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыУтилитыСжатия = Константы.ПараметрыУтилитыСжатия.Получить(); //"-resize 90% 90% -overwrite -no_auto_ext";
	ФайлУтилитаСжатия      = Новый Файл(УтилитаСжатияИзображений);
	
	Если НЕ ФайлУтилитаСжатия.Существует() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 10
		|	ЕСТЬNULL(Фильмы.Ссылка, ЗНАЧЕНИЕ(Справочник.Фильмы.ПустаяСсылка)) КАК Фильм,
		|	ЕСТЬNULL(Фильмы.РазмерИзображения, 0) КАК СтарыйРазмер
		|ИЗ
		|	Константы КАК Константы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Фильмы КАК Фильмы
		|		ПО (Фильмы.РазмерИзображения > Константы.МаксимальныйРазмерИзображения)
		|
		|УПОРЯДОЧИТЬ ПО
		|	СтарыйРазмер УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.Фильм) ИЛИ Выборка.СтарыйРазмер = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Афиша = Выборка.Фильм.Афиша.Получить();
		
		Если ТипЗнч(Афиша) <> Тип("Картинка") Тогда
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Уменьшение размеров изображений'"), УровеньЖурналаРегистрации.Ошибка, ,
										Выборка.Фильм, НСтр("ru = 'Реквизит ""Афиша"" не является типом ""Картинка"".'"));
			Продолжить;
		КонецЕсли;
		
		РасширениеФайла = "." + НРег(Строка(Афиша.Формат()));
		БинарныеДанные  = Афиша.ПолучитьДвоичныеДанные();
		ИмяВременного   = ПолучитьИмяВременногоФайла(РасширениеФайла);
		
		Попытка
			БинарныеДанные.Записать(ИмяВременного);
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Уменьшение размеров изображений'"), УровеньЖурналаРегистрации.Ошибка, ,
										Выборка.Фильм, СтрШаблон(НСтр("ru = 'Ошибка сохранения файла %1; по причине: %2'"), ИмяВременного, ОписаниеОшибки()));
			Возврат;
		КонецПопытки;
		
		СтрокаКоманды = СтрШаблон("%1 %2 %3", УтилитаСжатияИзображений, ПараметрыУтилитыСжатия, ИмяВременного);
		ЗапуститьПриложение(СтрокаКоманды, , Истина, КодВозврата);
		
		НоваяКартинка     = Новый Картинка(ИмяВременного);
		БинарныеДанные    = НоваяКартинка.ПолучитьДвоичныеДанные();
		РазмерИзображения = БинарныеДанные.Размер();
		
		Если Выборка.СтарыйРазмер > РазмерИзображения Тогда
			
			СпрОбъект = Выборка.Фильм.ПолучитьОбъект();
			СпрОбъект.ОбменДанными.Загрузка = Истина;
			СпрОбъект.Афиша = Новый ХранилищеЗначения(НоваяКартинка);
			СпрОбъект.РазмерИзображения = БинарныеДанные.Размер();
			СпрОбъект.ВысотаИзображения = НоваяКартинка.Высота();
			СпрОбъект.ШиринаИзображения = НоваяКартинка.Ширина();
		
			Попытка
				СпрОбъект.Записать();
			Исключение
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Уменьшение размеров изображений'"), УровеньЖурналаРегистрации.Ошибка, ,
											Выборка.Фильм, СтрШаблон(НСтр("ru = 'Ошибка записи фильма %1; по причине: %2'"), Выборка.Фильм, ОписаниеОшибки()));
				Возврат;
			КонецПопытки;
			
		КонецЕсли;
		
		УдалитьФайлы(ИмяВременного);
		
	КонецЦикла;
		
КонецПроцедуры

Процедура ПогодаВВолхове() Экспорт

	ТекстСообщения = Обработки.ПогодаВВолхове.ПолучитьИОтправитьПогодуНаСервере();
	ЗаписьЖурналаРегистрации("ПогодаВВолхове", , , , ТекстСообщения);

КонецПроцедуры

Процедура УдалитьФайлыНаСервере(ТекПуть, Маска) Экспорт

	//УдалитьФайлы(ТекПуть, Маска);

КонецПроцедуры

Функция ЗначениеРеквизитаОбъекта(СсылкаНаОбъект, ИмяРеквизита) Экспорт

	Возврат СсылкаНаОбъект[ИмяРеквизита];

КонецФункции

Процедура ОбновлениеИндексаПолнотекстовогоПоиска() Экспорт

	Если ПолнотекстовыйПоиск.ИндексАктуален() Тогда
		Возврат;
	КонецЕсли;

	ПолнотекстовыйПоиск.ОбновитьИндекс(Истина, Истина);
	
КонецПроцедуры
