
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПутьКФлагу = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Флаг");
	Элементы.ПутьКФлагу.РазмерКартинки = РазмерКартинки.АвтоРазмер;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЭтоАдресВременногоХранилища(ПутьКФлагу) Тогда
		ТекущийОбъект.Флаг = Новый ХранилищеЗначения(Новый Картинка(ПолучитьИзВременногоХранилища(ПутьКФлагу)));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

//#Область ОбработчикиСобытийЭлементовФормы
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПутьКФлагуНажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = ОбщийМодульКлиентСервер.ПолучитьФильтрИзображений();
	Диалог.Показать(Новый ОписаниеОповещения("ПослеЗакрытияДиалогаВыбора", ЭтотОбъект));

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеЗакрытияДиалогаВыбора(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт

	Если ТипЗнч(ВыбранныеФайлы) = Тип("Массив") И ВыбранныеФайлы.Количество() > 0 Тогда
		
		ВыбранныйФайл = ВыбранныеФайлы.Получить(0);
		Оповещение    = Новый ОписаниеОповещения("ОбработатьВыборФайла", ЭтотОбъект);
		
//		НачатьПомещениеФайла(Оповещение, , ВыбранныйФайл, Ложь, УникальныйИдентификатор);
		НачатьПомещениеФайлаНаСервер(Оповещение, , , , ВыбранныйФайл, УникальныйИдентификатор);
		
	КонецЕсли;

КонецПроцедуры // ПослеЗакрытияДиалогаВыбора()

&НаКлиенте
Процедура ОбработатьВыборФайла(ОписаниеПомещенногоФайла, ДопПараметры) Экспорт
	
	Если ОписаниеПомещенногоФайла = Неопределено Тогда
		Возврат;
	ИначеЕсли ОписаниеПомещенногоФайла.ПомещениеФайлаОтменено Тогда
		Возврат;
	КонецЕсли;

	ПутьКФлагу = ОписаниеПомещенногоФайла.Адрес;
	
//	ЭтотОбъект.Модифицированность = Истина;
	Модифицированность = Истина;

КонецПроцедуры // ОбработатьВыборФайла()

#КонецОбласти

