
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПутьКФлагу = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Флаг");
	Элементы.ПутьКФлагу.РазмерКартинки = РазмерКартинки.АвтоРазмер;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЭтоАдресВременногоХранилища(ПутьКФлагу) Тогда
		ТекущийОбъект.Флаг = Новый ХранилищеЗначения(Новый Картинка(ПолучитьИзВременногоХранилища(ПутьКФлагу)));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПутьКФлагуНажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Оповещение           = Новый ОписаниеОповещения("ОбработатьВыборФайла", ЭтотОбъект);
	ПараметрыДиалога     = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.Фильтр = ОбщийМодульКлиентСервер.ПолучитьФильтрИзображений();
	
	НачатьПомещениеФайлаНаСервер(Оповещение, , , , ПараметрыДиалога, УникальныйИдентификатор);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьВыборФайла(ОписаниеПомещенногоФайла, ДопПараметры) Экспорт
	
	Если ОписаниеПомещенногоФайла = Неопределено Тогда
		Возврат;
	ИначеЕсли ОписаниеПомещенногоФайла.ПомещениеФайлаОтменено Тогда
		Возврат;
	КонецЕсли;

	ПутьКФлагу = ОписаниеПомещенногоФайла.Адрес;
	
	Модифицированность = Истина;

КонецПроцедуры // ОбработатьВыборФайла()

#КонецОбласти

