
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПогодаВВолхове(Команда)

	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = ПолучитьИОтправитьПогодуНаСервере();
	ПоказатьОповещениеПользователя(ТекстСообщения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция ПолучитьИОтправитьПогодуНаСервере()

	Возврат Обработки.ПогодаВВолхове.ПолучитьИОтправитьПогодуНаСервере(АдресОповещения);

КонецФункции

#КонецОбласти
