
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	Для каждого ЭлНастр Из КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы Цикл
		Если ЭлНастр.Использование Тогда
			Для каждого ЭлПользНастр Из КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
				Если ТипЗнч(ЭлПользНастр) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
					ЭлПользНастр.Использование = Ложь;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
