
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СисИнфо = Новый СистемнаяИнформация;
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, СисИнфо);
	
	ИмяПользователя	= ИмяПользователя();
	
	#Если ВебКлиент Тогда
		Элементы.ИмяКомпьютера.Видимость = Ложь;
		Элементы.КаталогПрограммы.Видимость = Ложь;
	#Иначе
		ИмяКомпьютера		= ИмяКомпьютера();
		КаталогПрограммы	= КаталогПрограммы();
		Элементы.ИнформацияПрограммыПросмотра.Видимость = Ложь;
	#КонецЕсли
	
	Попытка
	    ФСО = Новый COMОбъект("Scripting.FileSystemObject");
	Исключение
		Возврат;
	КонецПопытки;
	
	РазмерВсего = 0;
	Для каждого ТекущийДиск Из ФСО.Drives Цикл
		Если ТекущийДиск.DriveType = 2 Тогда
			РазмерВсего = РазмерВсего + ТекущийДиск.TotalSize;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.ОбщийРазмерЖесткихДисков.Видимость = Истина;
	ОбщийРазмерЖесткихДисков = "" + РазмерВсего + " байт (" + Окр(РазмерВсего / 1073741824, 3) + " Гбайт)";

	Попытка
	
		ScrptCtrl			= Новый COMОбъект("MSScriptControl.ScriptControl");
		ScrptCtrl.Language	= "vbs";
		
		ScrptCtrl.AddCode("
			|Function GetResolution()
			|Dim document, info
			|set document = CreateObject(""htmlfile"")
			|With document.parentWindow.screen
			|    GetResolution = """" & .width & "" x "" & .height
			|End With			
			|End Function
			|");
			
		Разрешение = ScrptCtrl.Eval("GetResolution()");
		
		НадписьРазрешение = Разрешение;
	
	Исключение
		
		Элементы.НадписьРазрешение.Видимость = Ложь;
	
	КонецПопытки;

	
КонецПроцедуры
