
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимость(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АвтоЗавершениеСеансовПриИзменении(Элемент)
	
	Если НЕ НаборКонстант.АвтоЗавершениеСеансов Тогда
		НаборКонстант.ВремяАвтоЗавершенияСеансов = '00010101000000';
	КонецЕсли;
	
	УстановитьВидимость(ЭтотОбъект);
		
КонецПроцедуры

&НаКлиенте
Процедура УтилитаКонвертацииИзображенийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Показать(Новый ОписаниеОповещения("ПослеЗакрытияДиалогаВыбора", ЭтотОбъект, "УтилитаКонвертацииИзображений"));
	
КонецПроцедуры

&НаКлиенте
Процедура УтилитаСжатияИзображенийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Показать(Новый ОписаниеОповещения("ПослеЗакрытияДиалогаВыбора", ЭтотОбъект, "УтилитаСжатияИзображений"));

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимость(Форма)

	Форма.Элементы.ВремяАвтоЗавершенияСеансов.Доступность = Форма.НаборКонстант.АвтоЗавершениеСеансов;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияДиалогаВыбора(ВыбранныеФайлы, ИмяУтилиты) Экспорт
	
	Если ТипЗнч(ВыбранныеФайлы) = Тип("Массив") И ВыбранныеФайлы.Количество() > 0 Тогда
		НаборКонстант[ИмяУтилиты] = ВыбранныеФайлы.Получить(0);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

