
&НаСервере
Процедура ИзменитьНастройкиКлиентскогоПриложенияНаСервере()
	
	НастройкиКлиентскогоПриложения = ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиКлиентскогоПриложения");
	
	Если Не ТипЗнч(НастройкиКлиентскогоПриложения) = Тип("НастройкиКлиентскогоПриложения") Тогда
		НастройкиКлиентскогоПриложения = Новый НастройкиКлиентскогоПриложения();
	КонецЕсли;
	
	НастройкиКлиентскогоПриложения.ВариантМасштабаФормКлиентскогоПриложения = ВариантМасштабаФормКлиентскогоПриложения[ВариантМасштаба];
	ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиКлиентскогоПриложения",,НастройкиКлиентскогоПриложения);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьНастройкиКлиентскогоПриложения(Команда)
	
	ИзменитьНастройкиКлиентскогоПриложенияНаСервере();
	
	ЗавершитьРаботуСистемы(Ложь, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	НастройкиКлиентскогоПриложения = ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиКлиентскогоПриложения");
	
	Если ТипЗнч(НастройкиКлиентскогоПриложения) = Тип("НастройкиКлиентскогоПриложения") Тогда
		ВариантМасштаба = Строка(НастройкиКлиентскогоПриложения.ВариантМасштабаФормКлиентскогоПриложения);
	КонецЕсли;
	
КонецПроцедуры
