
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	СкомпоноватьРезультатНаСервере("НаЭтойНеделеВКино");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДокументРезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)

    СтандартнаяОбработка = Ложь;
 
    ИсточникДоступныхНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных);
    ОбработкаРасшифровки      = Новый ОбработкаРасшифровкиКомпоновкиДанных(АдресДанныеРасшифровки, ИсточникДоступныхНастроек);
	
    ДоступныеДействия = Новый Массив();
    ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение);
    
    Оповещение = Новый ОписаниеОповещения("ПослеВыбораДействияПользователем", ЭтотОбъект, Расшифровка);
    ОбработкаРасшифровки.ПоказатьВыборДействия(Оповещение, Расшифровка, ДоступныеДействия, , Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НаЭтойНеделеВКино(Команда)
	
	СкомпоноватьРезультатНаСервере(Команда.Имя);

КонецПроцедуры

&НаКлиенте
Процедура НекорректноЗаполненныеФильмы(Команда)
	
	СкомпоноватьРезультатНаСервере(Команда.Имя);

КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоДатамСкачиванияФильмов(Команда)
	
	СистемнаяДата = ОбщийМодульКлиент.ДатаСеанса();
	ПериодОтчета  = Новый СтандартныйПериод(НачалоМесяца(ДобавитьМесяц(СистемнаяДата, -3)), КонецДня(СистемнаяДата));
	
	СкомпоноватьРезультатНаСервере(Команда.Имя, Новый Структура("Период", ПериодОтчета));

КонецПроцедуры

&НаКлиенте
Процедура НужноСкачать(Команда)
	
	СкомпоноватьРезультатНаСервере(Команда.Имя);

КонецПроцедуры

&НаКлиенте
Процедура Фильмотека(Команда)

	СкомпоноватьРезультатНаСервере(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура Статистика(Команда)

	СкомпоноватьРезультатНаСервере(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикЦифровыхРелизов(Команда)

	СкомпоноватьРезультатНаСервере(Команда.Имя);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СкомпоноватьРезультатНаСервере(ИмяОтчета, СтруктураПараметров = Неопределено)

	ДокументРезультат.Очистить();
	
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	ЭкземплярОтчета   = Отчеты[ИмяОтчета].Создать();
	
	Если СтруктураПараметров <> Неопределено Тогда
		ПользовательскиеНастройки = ПолучитьПользовательскиеНастройки(ЭкземплярОтчета.СхемаКомпоновкиДанных, СтруктураПараметров);
		ЭкземплярОтчета.КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(ПользовательскиеНастройки);
	КонецЕсли;
	
	ЗначениеПараметраНастроекКД = ЭкземплярОтчета.КомпоновщикНастроек.Настройки.ПараметрыВывода.Элементы.Найти("ВыводитьОтбор");
	Если ЗначениеПараметраНастроекКД <> Неопределено Тогда
		ЗначениеПараметраНастроекКД.Значение = ТипВыводаТекстаКомпоновкиДанных.НеВыводить;
		ЗначениеПараметраНастроекКД.Использование = Истина;
	КонецЕсли;
	
	ЗначениеПараметраНастроекКД = ЭкземплярОтчета.КомпоновщикНастроек.Настройки.ПараметрыВывода.Элементы.Найти("ВыводитьПараметрыДанных");
	Если ЗначениеПараметраНастроекКД <> Неопределено Тогда
		ЗначениеПараметраНастроекКД.Значение = ТипВыводаТекстаКомпоновкиДанных.НеВыводить;
		ЗначениеПараметраНастроекКД.Использование = Истина;
	КонецЕсли;
	
	ЭкземплярОтчета.СкомпоноватьРезультат(ДокументРезультат, ДанныеРасшифровки);
	
	АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(ЭкземплярОтчета.СхемаКомпоновкиДанных, УникальныйИдентификатор);
	АдресДанныеРасшифровки = ПоместитьВоВременноеХранилище(ДанныеРасшифровки, УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораДействияПользователем(ВыбранноеДействие, ПараметрВыбранногоДействия, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Нет Тогда
	ИначеЕсли ВыбранноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение Тогда
		ПоказатьЗначение( , ПараметрВыбранногоДействия);
	Иначе
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПользовательскиеНастройки(СхемаКомпоновкиДанных, СтруктураПараметров)

	КомпоновщикНастроекКомпоновкиДанных = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроекКомпоновкиДанных.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	
	Для каждого КлючИЗначение Из СтруктураПараметров Цикл
		ИмяПараметра      = КлючИЗначение.Ключ;
		ЗначПараметра     = КлючИЗначение.Значение;
		ЗначениеПараметра = КомпоновщикНастроекКомпоновкиДанных.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(ИмяПараметра));
		Если ЗначениеПараметра <> Неопределено Тогда
			ЗначениеПараметра.Значение = ЗначПараметра;
			ЗначениеПараметра.Использование = Истина;
			ЗначениеПараметра = КомпоновщикНастроекКомпоновкиДанных.ПользовательскиеНастройки.Элементы.Найти(ЗначениеПараметра.ИдентификаторПользовательскойНастройки);
			Если ЗначениеПараметра <> Неопределено Тогда
				ЗначениеПараметра.Значение = ЗначПараметра;
				ЗначениеПараметра.Использование = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

    Возврат КомпоновщикНастроекКомпоновкиДанных.ПользовательскиеНастройки;
 
КонецФункции

#КонецОбласти
