
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ОбщийМодульВызовСервера.ЗначениеРеквизитаОбъекта(ПараметрКоманды, "ЭтоГруппа") Тогда
		Возврат;
	КонецЕсли;
	
	НаименованиеФильма = ТРег(ОбщийМодульВызовСервера.ЗначениеРеквизитаОбъекта(ПараметрКоманды, "Наименование"));
	
	СформироватьНаименованиеФильмаВТранслитерации(НаименованиеФильма);

КонецПроцедуры

&НаКлиенте
Процедура СформироватьНаименованиеФильмаВТранслитерации(ТекущееНаименованиеФильма)
	
	НаименованиеФильма      = СтрЗаменить(СтрЗаменить(ТекущееНаименованиеФильма, " - ", "-"), " ", ".");
	КоллекцияТранслитерации = ОбщийМодульКлиентСерверПовтИсп.ПолучитьКоллекциюТранслитерации();
	НовоеНаименованиеФильма = "";
	
	Для Индекс = 1 По СтрДлина(НаименованиеФильма) Цикл
		
		ТекСимвол   = Сред(НаименованиеФильма, Индекс, 1);
		НовыйСимвол = КоллекцияТранслитерации.Получить(ВРег(ТекСимвол));
		
		Если НовыйСимвол <> Неопределено Тогда
			Если ВРег(ТекСимвол) = ТекСимвол Тогда
				НовоеНаименованиеФильма = НовоеНаименованиеФильма + НовыйСимвол;
			Иначе
				НовоеНаименованиеФильма = НовоеНаименованиеФильма + НРег(НовыйСимвол);
			КонецЕсли;
		Иначе
			НовоеНаименованиеФильма = НовоеНаименованиеФильма + ТекСимвол;
		КонецЕсли;

	КонецЦикла;
	
	НовоеНаименованиеФильма = ОбщийМодульКлиентСервер.ЗаменитьНедопустимыеСимволы(НовоеНаименованиеФильма);
	Описание_Оповещения     = Новый ОписаниеОповещения("ПослеЗакрытияОкнаВводаЗначения", ЭтотОбъект);
	
	ПоказатьВводЗначения(Описание_Оповещения, НовоеНаименованиеФильма, НСтр("ru = 'Транслитерация наименования'"),
							  Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(100, ДопустимаяДлина.Переменная)));
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияОкнаВводаЗначения(Значение, ДопПараметры) Экспорт

	Если Значение <> Неопределено Тогда
		СформироватьНаименованиеФильмаВТранслитерации(Значение);
	КонецЕсли;

КонецПроцедуры
