
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("Идентификатор", мУникальныйИдентификатор) Тогда
		ИскомоеРегламентноеЗадание = НайтиРегламентноеЗаданиеПоУникальномуИдентификатору(мУникальныйИдентификатор);
		Если ИскомоеРегламентноеЗадание <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ИскомоеРегламентноеЗадание);
			Если ПустаяСтрока(Наименование) Тогда
				ЭтотОбъект.Заголовок = НСтр("ru = 'Регламентное задание'");
			Иначе
				ЭтотОбъект.Заголовок = СтрШаблон(НСтр("ru = 'Регламентное задание: <%1>'"), Наименование);
			КонецЕсли;
		Иначе
			Расписание = Новый РасписаниеРегламентногоЗадания;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)

	Если ЭтотОбъект.Модифицированность Тогда
		ЗаписатьРегламентноеЗаданиеНаСервере();
	КонецЕсли;

	Оповестить("ОбновитьРегламентныеЗаданияНаСервере", , ЭтотОбъект);
	
	ЭтотОбъект.Закрыть(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиЭлементовФормы

&НаКлиенте
Процедура ИспользованиеПриИзменении(Элемент)

	ЭтотОбъект.Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)

	ЭтотОбъект.Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура РасписаниеНажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ДиалогРасписания     = Новый ДиалогРасписанияРегламентногоЗадания(Расписание);
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ПослеЗакрытияДиалогаРасписания", ЭтотОбъект);
	ДиалогРасписания.Показать(ОписаниеОповещенияОЗакрытии);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервереБезКонтекста
Функция НайтиРегламентноеЗаданиеПоУникальномуИдентификатору(мУникальныйИдентификатор)

	Возврат РегламентныеЗадания.НайтиПоУникальномуИдентификатору(мУникальныйИдентификатор);

КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияДиалогаРасписания(ТекРасписание, ДополнительныеПараметры) Экспорт

	Если ТекРасписание <> Неопределено Тогда
		Расписание = ТекРасписание;
		ЭтотОбъект.Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаписатьРегламентноеЗаданиеНаСервере()
	
	ИскомоеРегламентноеЗадание = НайтиРегламентноеЗаданиеПоУникальномуИдентификатору(мУникальныйИдентификатор);
	Если ИскомоеРегламентноеЗадание <> Неопределено Тогда
		
		ИскомоеРегламентноеЗадание.Использование = Использование;
		ИскомоеРегламентноеЗадание.Наименование = Наименование;
		ИскомоеРегламентноеЗадание.Расписание = Расписание;
		
		Попытка
		    ИскомоеРегламентноеЗадание.Записать();
		Исключение
			Описание_Ошибки = ОписаниеОшибки();
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон(НСтр("ru = 'Ошибка записи задания <%1>; по причине: %2.'"), Наименование, Описание_Ошибки);
			Сообщение.Поле = "Наименование";
			Сообщение.Сообщить();
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
