Процедура ПередЗавершениемРаботыСистемы(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		ДопПараметры = Ложь;
    КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьПараметрыЗапуска(ПараметрЗапуска) Экспорт
	
	МассивПараметровЗапуска = СтрРазделить(ПараметрЗапуска, ";", Ложь);
	
	Если МассивПараметровЗапуска.Найти("CreateListOfMovies") <> Неопределено Тогда
		СформироватьСписокФильмов(МассивПараметровЗапуска);
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьСписокФильмов(МассивПараметровЗапуска)

	Если МассивПараметровЗапуска.Количество() <> 3 Тогда
		Возврат;
	КонецЕсли;
	
	ПутьПоиска   = МассивПараметровЗапуска.Получить(1);
	ПутьВыгрузки = МассивПараметровЗапуска.Получить(2);
	Параметры    = Новый Структура("ПутьПоиска, ПутьВыгрузки", ПутьПоиска, ПутьВыгрузки);
	
	Если НЕ ПустаяСтрока(ПутьВыгрузки) Тогда
		ТекПуть = ПутьВыгрузки + ?(СтрЗаканчиваетсяНа(ПутьВыгрузки, "\"), "", "\");
		ОбщийМодульВызовСервера.УдалитьФайлыНаСервере(ТекПуть, "*.html");
	КонецЕсли;
	
	ОткрытьФорму("Справочник.Фильмы.Форма.ФормаПечати", Параметры);	

КонецПроцедуры

Функция ДатаСеанса() Экспорт
	
	Возврат ОбщийМодульВызовСервера.ДатаСеанса();
	
КонецФункции
