
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ТекОбъектМетаданных = РеквизитФормыВЗначение("Объект").Метаданные();
	ТекПолноеИмя = ТекОбъектМетаданных.ПолноеИмя();
	СписокКоманд = Новый СписокЗначений;
	
	Для каждого ОбъектМетаданных Из Метаданные.Подсистемы.ПрочиеОбъекты.Состав Цикл
		
		ПолноеИмя = ОбъектМетаданных.ПолноеИмя();
		
		Если ПолноеИмя = ТекПолноеИмя Тогда
			Продолжить;
		КонецЕсли;
		
		СписокКоманд.Добавить(СтрЗаменить(ПолноеИмя, ".", "_"), ОбъектМетаданных.Синоним);
		
	КонецЦикла;
	
	СписокКоманд.СортироватьПоПредставлению();
	
	Для каждого ТекЭлемент Из СписокКоманд Цикл
		
		НоваяКоманда = Команды.Добавить("Команда" + ТекЭлемент.Значение);
		НоваяКоманда.Действие = "КомандаНажатиеНаКнопку";
		НоваяКоманда.Заголовок = ТекЭлемент.Представление;
		НоваяКоманда.Подсказка = ТекЭлемент.Представление;
		
		Вхождение = СтрНайти(ТекЭлемент.Значение, "_");
		Если Вхождение > 0 Тогда
			ИмяТипа = Лев(ТекЭлемент.Значение, Вхождение - 1);
			НоваяКоманда.Картинка = БиблиотекаКартинок[ИмяТипа];
			НоваяКоманда.Отображение = ОтображениеКнопки.КартинкаИТекст;
		КонецЕсли;
		
		НоваяКнопка = Элементы.Добавить("Кнопка" + ТекЭлемент.Значение, Тип("КнопкаФормы"));
		НоваяКнопка.ИмяКоманды = НоваяКоманда.Имя;
		НоваяКнопка.Вид = ВидКнопкиФормы.Гиперссылка;

	
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаНажатиеНаКнопку(Команда)

	ИмяОбъекта = СтрЗаменить(Команда.Имя, "Команда", "");
	ИмяОбъекта = СтрЗаменить(ИмяОбъекта, "_", ".");
	
	ОткрытьФорму(ИмяОбъекта + ".Форма");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиЭлементовФормы

#КонецОбласти

#Область СлужебныеПроцедурыФункции


#КонецОбласти

