
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление(ЭтотОбъект);
	
	ОбновитьРегламентныеЗаданияНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ОбновитьРегламентныеЗаданияНаСервере" Тогда
		ОбновитьРегламентныеЗаданияНаСервере();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьРегламентныеЗадания(Команда)
	
	ОбновитьРегламентныеЗаданияНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьРегламентноеЗадание(Команда)

	мТекущиеДанные = Элементы.ТаблицаРегламентныхЗаданий.ТекущиеДанные;
	
	Если мТекущиеДанные <> Неопределено Тогда
		ВыполнитьРегламентноеЗаданиеНаСервере(мТекущиеДанные.УникальныйИдентификатор);
	КонецЕсли;
	
	ОбновитьРегламентныеЗадания(Команда);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиЭлементовФормы

&НаКлиенте
Процедура ТаблицаРегламентныхЗаданийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	мТекущиеДанные = Элементы.ТаблицаРегламентныхЗаданий.ТекущиеДанные;
	Если мТекущиеДанные <> Неопределено Тогда
		ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ПослеЗакрытияФормыРегламентногоЗадания", ЭтотОбъект);
		ДополнительныеПараметры     = Новый Структура("Идентификатор", мТекущиеДанные.УникальныйИдентификатор);
		ОткрытьФорму("Обработка.КонсольЗаданий.Форма.ФормаРегламентногоЗадания", ДополнительныеПараметры,
					  ЭтотОбъект, ЭтотОбъект.УникальныйИдентификатор, , , ОписаниеОповещенияОЗакрытии,
					  РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура ОбновитьРегламентныеЗаданияНаСервере()

	ТаблицаРегламентныхЗаданий.Очистить();
	ТаблицаФоновыхЗаданий.Очистить();
	ВчерашнийДень = ТекущаяДатаСеанса()-86400;
	
	МассивРегламентныхЗаданий = РегламентныеЗадания.ПолучитьРегламентныеЗадания();
	
	Для каждого РегламентноеЗадание Из МассивРегламентныхЗаданий Цикл
		НоваяСтрока = ТаблицаРегламентныхЗаданий.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, РегламентноеЗадание);
		Если РегламентноеЗадание.ПоследнееЗадание <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(НоваяСтрока, РегламентноеЗадание.ПоследнееЗадание, "Начало, Конец");
		КонецЕсли;
		Если РегламентноеЗадание.Использование
			И РегламентноеЗадание.Расписание.ПериодПовтораВТечениеДня > 0
		Тогда
			Если ЗначениеЗаполнено(НоваяСтрока.Конец) Тогда
				НоваяСтрока.СледующийЗапуск = НоваяСтрока.Конец
								+ РегламентноеЗадание.Расписание.ПериодПовтораВТечениеДня;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	МассивФоновыхЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(Новый Структура("Начало", ВчерашнийДень));
	Для каждого ФоновоеЗадание Из МассивФоновыхЗаданий Цикл
		НоваяСтрока = ТаблицаФоновыхЗаданий.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ФоновоеЗадание);
		Если ФоновоеЗадание.ИнформацияОбОшибке <> Неопределено Тогда
			Если ФоновоеЗадание.ИнформацияОбОшибке.Причина <> Неопределено Тогда
				ИнформацияОбОшибке = ФоновоеЗадание.ИнформацияОбОшибке.Причина.Описание;
			Иначе
				ИнформацияОбОшибке = ФоновоеЗадание.ИнформацияОбОшибке.Описание;
			КонецЕсли;
			НоваяСтрока.ИнформацияОбОшибке = ИнформацияОбОшибке;
		КонецЕсли;
		Если ФоновоеЗадание.Состояние = ПредопределенноеЗначение("СостояниеФоновогоЗадания.Активно") Тогда
			НоваяСтрока.СостояниеЧислом = 1;
		ИначеЕсли ФоновоеЗадание.Состояние = ПредопределенноеЗначение("СостояниеФоновогоЗадания.ЗавершеноАварийно") Тогда
			НоваяСтрока.СостояниеЧислом = 2;
		ИначеЕсли ФоновоеЗадание.Состояние = ПредопределенноеЗначение("СостояниеФоновогоЗадания.Отменено") Тогда
			НоваяСтрока.СостояниеЧислом = 3;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыРегламентногоЗадания(РезультатЗакрытия, ДополнительныеПараметры) Экспорт

	ОбновитьРегламентныеЗаданияНаСервере();

КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьУсловноеОформление(Форма)
	
	Форма.УсловноеОформление.Элементы.Очистить();

	НовыйЭлементУО = Форма.УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = НовыйЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ТаблицаФоновыхЗаданийНаименование");
	
	ОтборЭлементаУО = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлементаУО.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаФоновыхЗаданий.СостояниеЧислом");
	ОтборЭлементаУО.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлементаУО.ПравоеЗначение = 1; // Активно
	
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт( , , Истина));
	
	НовыйЭлементУО = Форма.УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = НовыйЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ТаблицаФоновыхЗаданийНаименование");
	
	ОтборЭлементаУО = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлементаУО.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаФоновыхЗаданий.СостояниеЧислом");
	ОтборЭлементаУО.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлементаУО.ПравоеЗначение = 2; // Завершено аварийно
	
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОсобогоТекста);

	НовыйЭлементУО = Форма.УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = НовыйЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ТаблицаФоновыхЗаданийНаименование");
	
	ОтборЭлементаУО = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлементаУО.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаФоновыхЗаданий.СостояниеЧислом");
	ОтборЭлементаУО.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлементаУО.ПравоеЗначение = 3; // Отменено
	
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(128, 128, 128));

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыполнитьРегламентноеЗаданиеНаСервере(Идентификатор)

	ИскомоеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Идентификатор);
	
	Если ИскомоеЗадание <> Неопределено Тогда
		
		ФоновоеЗадание = ИскомоеЗадание.ПоследнееЗадание;
		
		ФоновыеЗадания.Выполнить(ФоновоеЗадание.ИмяМетода, ИскомоеЗадание.Параметры, ИскомоеЗадание.Ключ, ИскомоеЗадание.Наименование);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

