
#Область ОбработчикиСобытийФормы
	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	НоваяКоманда = Команды.Добавить("КомандаЗакодироватьBase64");
	НоваяКоманда.Действие = "ЗакодироватьBase64";
	НоваяКнопка = Элементы.Добавить("КнопкаЗакодироватьBase64", Тип("КнопкаФормы"));
	НоваяКнопка.ИмяКоманды = НоваяКоманда.Имя;
	НоваяКнопка.Заголовок = НСтр("ru = 'Закодировать Base 64'");

	НоваяКоманда = Команды.Добавить("КомандаРаскодироватьBase64");
	НоваяКоманда.Действие = "РаскодироватьBase64";
	НоваяКнопка = Элементы.Добавить("КнопкаРаскодироватьBase64", Тип("КнопкаФормы"));
	НоваяКнопка.ИмяКоманды = НоваяКоманда.Имя;
	НоваяКнопка.Заголовок = НСтр("ru = 'Раскодировать Base 64'");
	
	Добавляемые = Новый Массив;
	Добавляемые.Добавить(Новый РеквизитФормы("ТаблицаСимволов", Новый ОписаниеТипов("ТаблицаЗначений")));
	Добавляемые.Добавить(Новый РеквизитФормы("Eng", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(1, ДопустимаяДлина.Фиксированная)), "ТаблицаСимволов"));
	Добавляемые.Добавить(Новый РеквизитФормы("Рус", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(1, ДопустимаяДлина.Фиксированная)), "ТаблицаСимволов"));
	ИзменитьРеквизиты(Добавляемые);

	Для КодТекСимвола = 65 По 90 Цикл // 65 = "A"; 90 = "Z"
		ПерваяСтрока = ЭтотОбъект.ТаблицаСимволов.Добавить();
		ПерваяСтрока.Eng = Символ(КодТекСимвола);
		ПерваяСтрока.Рус = Символ(975 + КодТекСимвола);
		ВтораяСтрока = ЭтотОбъект.ТаблицаСимволов.Добавить();
		ВтораяСтрока.Eng = НРег(ПерваяСтрока.Eng);
		ВтораяСтрока.Рус = НРег(ПерваяСтрока.Рус);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиЭлементовФормы

&НаКлиенте
Процедура ЗакодироватьBase64(Команда)

	ВыбратьИОбработатьФайл(РежимДиалогаВыбораФайла.Открытие, "Все файлы (*.*)|*.*", Истина);

КонецПроцедуры

&НаКлиенте
Процедура РаскодироватьBase64(Команда)

	ВыбратьИОбработатьФайл(РежимДиалогаВыбораФайла.Открытие, "Файлы UUE (*.uue)|*.uue", Ложь);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаКлиенте
Функция ПолучитьОписание(ДополнительныеПараметры = Неопределено)

	Возврат Новый ОписаниеОповещения("ПослеЗавершенияПроцессаМетода", ЭтотОбъект, ДополнительныеПараметры, "ВСлучаеОшибкиРаботыМетода", ЭтотОбъект);

КонецФункции

&НаКлиенте
Процедура ВыбратьИОбработатьФайл(РежимДиалога, Фильтр, Закодировать)

	Диалог = Новый ДиалогВыбораФайла(РежимДиалога);
	Диалог.Фильтр = Фильтр;
	Диалог.ПроверятьСуществованиеФайла = Истина;
	ДопПараметры = Новый Структура("Закодировать", Закодировать);
	
	Диалог.Показать(ПолучитьОписание(ДопПараметры));

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗавершенияПроцессаМетода(Результат, ДопПараметры) Экспорт

	Закодировать = Ложь;
	
	Если ТипЗнч(Результат) = Тип("ФайловыйПоток") Тогда
		ЧтениеДанных = Новый ЧтениеДанных(Результат);
		ДопПараметры.Вставить("ЧтениеДанных", ЧтениеДанных);
		ЧтениеДанных.НачатьЧтение(ПолучитьОписание(ДопПараметры));
	ИначеЕсли ТипЗнч(Результат) = Тип("РезультатЧтенияДанных") Тогда
		ДопПараметры.Вставить("Результат", Результат);
		Результат.НачатьПолучениеДвоичныхДанных(ПолучитьОписание(ДопПараметры));
		ДопПараметры.ЧтениеДанных.НачатьЗакрытие(Новый ОписаниеОповещения("ПослеЗавершенияПроцесса", ЭтотОбъект));
	ИначеЕсли ТипЗнч(Результат) = Тип("ДвоичныеДанные") Тогда
		ТекстДок = Новый ТекстовыйДокумент;
		СтрокаТекст = ДопПараметры.ИмяФайла + Символы.ПС + Base64Строка(Результат);
		Для каждого СтрТаблица Из ЭтотОбъект.ТаблицаСимволов Цикл
			СтрокаТекст = СтрЗаменить(СтрокаТекст, СтрТаблица.Eng, СтрТаблица.Рус);
		КонецЦикла;
		ТекстДок.УстановитьТекст(СтрокаТекст);
		ДопПараметры.Вставить("ИмяФайла", ДопПараметры.ИмяБезРасширения + ".uue");
		ТекстДок.НачатьЗапись(ПолучитьОписание(ДопПараметры), ДопПараметры.ПутьФайла + ДопПараметры.ИмяФайла);
	ИначеЕсли ДопПараметры.Свойство("Закодировать", Закодировать) Тогда
		Если ТипЗнч(Результат) = Тип("Массив") И Результат.Количество() > 0 Тогда
			Файл = Новый Файл(Результат.Получить(0));
			ДопПараметры = Новый Структура("ИмяФайла, ПутьФайла, ИмяБезРасширения", Файл.Имя, Файл.Путь, Файл.ИмяБезРасширения);
			Если Закодировать Тогда
				ФайловыеПотоки.НачатьОткрытиеДляЧтения(ПолучитьОписание(ДопПараметры), Файл.ПолноеИмя);
			Иначе
				ТекстДок = Новый ТекстовыйДокумент;
				ДопПараметры.Вставить("ТекстДок", ТекстДок);
				ТекстДок.НачатьЧтение(Новый ОписаниеОповещения("ПослеЗавершенияПроцесса", ЭтотОбъект, ДопПараметры, "ВСлучаеОшибкиРаботыМетода", ЭтотОбъект), Файл.ПолноеИмя);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВСлучаеОшибкиРаботыМетода(ИнфоОбОшибке, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт

	СтандартнаяОбработка = Ложь;

	Причина = ?(ИнфоОбОшибке.Причина = Неопределено, ИнфоОбОшибке.Описание, ИнфоОбОшибке.Причина.Описание);

	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = СтрШаблон(НСтр("ru = 'Ошибка открытия файла %1; по причине: %2.'"), ДополнительныеПараметры.ИмяФайла, Причина);
	Сообщение.Сообщить();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗавершенияПроцесса(ДопПараметры) Экспорт
	
	Если ТипЗнч(ДопПараметры) = Тип("Структура") Тогда
		
		Если ДопПараметры.Свойство("ТекстДок") Тогда
		
			СтрокаТекст = ДопПараметры.ТекстДок.ПолучитьТекст();
			Для каждого СтрТаблица Из ЭтотОбъект.ТаблицаСимволов Цикл
				СтрокаТекст = СтрЗаменить(СтрокаТекст, СтрТаблица.Рус, СтрТаблица.Eng);
			КонецЦикла;
			
			ПерваяСтрока = СтрПолучитьСтроку(СтрокаТекст, 1);
			ДвДанные     = Base64Значение(СтрЗаменить(СтрокаТекст, ПерваяСтрока, ""));
			
			Если ДвДанные.Размер() > 0 Тогда
				ДопПараметры.Удалить("ТекстДок");
				Если НЕ ПустаяСтрока(ПерваяСтрока) Тогда
					ДопПараметры.Вставить("ИмяФайла", ПерваяСтрока);
				КонецЕсли;
				ДвДанные.НачатьЗапись(Новый ОписаниеОповещения("ПослеЗавершенияПроцесса", ЭтотОбъект, ДопПараметры, "ВСлучаеОшибкиРаботыМетода", ЭтотОбъект), ДопПараметры.ПутьФайла + ДопПараметры.ИмяФайла);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#Если Сервер Тогда
	Если ПустаяСтрока(ЭтотОбъект.ПолучитьДействие("ПриСозданииНаСервере")) Тогда
		ЭтотОбъект.УстановитьДействие("ПриСозданииНаСервере", "ПриСозданииНаСервере");
		ЭтотОбъект.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиФормы.Нет;
	КонецЕсли;
#КонецЕсли
