#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "FB2 (*.fb2)|*.fb2";
	Диалог.ПроверятьСуществованиеФайла = Истина;
	Диалог.Показать(Новый ОписаниеОповещения("ПослеЗакрытияДиалогаВыбора", ЭтотОбъект));

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроверкаФайла(Команда)

	Если ПроверитьЗаполнение() Тогда
		ПроверитьФайл();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеЗакрытияДиалогаВыбора(ВыбранныеФайлы, ДопПараметры) Экспорт

	Если ТипЗнч(ВыбранныеФайлы) = Тип("Массив") И ВыбранныеФайлы.Количество() > 0 Тогда
		ИмяФайла = ВыбранныеФайлы.Получить(0);
		ТекФайл  = Новый Файл(ИмяФайла);
		ТекФайл.НачатьПолучениеРазмера(Новый ОписаниеОповещения("ПослеЗавершенияПолученияРазмера", ЭтотОбъект));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗавершенияПолученияРазмера(РазмерФайла, ДопПараметры) Экспорт

	РазмерБуфераВБайтах = РазмерФайла;

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьФайл()

	ТекущийФайл  = Новый Файл(ИмяФайла);
	ДокТекст     = Новый ТекстовыйДокумент;
	ДопПараметры = Новый Структура("ТекущийФайл, ИмяФайла, ДокТекст", ТекущийФайл, ТекущийФайл.Имя, ДокТекст);
	Описание     = Новый ОписаниеОповещения("ПослеЗавершенияЧтенияФайла", ЭтотОбъект, ДопПараметры, "ПриВозникновенииОшибкиФайла", ЭтотОбъект);
	ДокТекст.НачатьЧтение(Описание, ТекущийФайл.ПолноеИмя, КодировкаТекста.UTF8);

КонецПроцедуры

&НаКлиенте
Процедура ПриВозникновенииОшибкиФайла(ИнфоОбОшибке, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Причина = ?(ИнфоОбОшибке.Причина <> Неопределено, ИнфоОбОшибке.Причина.Описание, ИнфоОбОшибке.Описание);
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = СтрШаблон(НСтр("ru = 'Ошибка при работе с файлом <%1>; по причине: <%2>.'"), ДополнительныеПараметры.ИмяФайла, Причина);;
	Сообщение.Сообщить();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗавершенияЧтенияФайла(ДополнительныеПараметры) Экспорт
	
	ДокТекст    = ДополнительныеПараметры.ДокТекст;
	ВсегоСтрок  = ДокТекст.КоличествоСтрок();
	ТэгОткрытие = "<";
	ТэгЗакрытие = ">";
	КосаяЧерта  = "/";
	
	ОператорыОткрытия = Новый Массив;
	ОператорыЗакрытия = Новый Массив;
	
	Для ИндексСтроки = 1 По ВсегоСтрок Цикл
		
		Прогресс    = Окр(ИндексСтроки / ВсегоСтрок * 100);
		ТекСтрока   = ДокТекст.ПолучитьСтроку(ИндексСтроки);
		КолСимволов = СтрДлина(ТекСтрока);
		ТекущийТэг  = "";
		
		Состояние(ДополнительныеПараметры.ИмяФайла, Прогресс, НСтр("ru = 'Чтение файла...'"), БиблиотекаКартинок.Записать);
		
		Для ИндексСимвола = 1 По КолСимволов Цикл
		
			ТекСимвол = Сред(ТекСтрока, ИндексСимвола, 1);
			
			Если ТекСимвол = ТэгОткрытие Тогда
				ЭтоТэг = Истина;
			КонецЕсли;
			
			Если ЭтоТэг Тогда
				ТекущийТэг = ТекущийТэг + ТекСимвол;
			КонецЕсли;
			
			Если ТекСимвол = ТэгЗакрытие Тогда
				
				ЭтоТэг = Ложь;
				Если СтрНачинаетсяС(ТекущийТэг, "<?xml version")
					ИЛИ СтрЗаканчиваетсяНа(ТекущийТэг, "/>")
				Тогда
					ТекущийТэг = "";
					Продолжить;
				КонецЕсли;
				
				Если СтрНачинаетсяС(ТекущийТэг, ТэгОткрытие + КосаяЧерта) Тогда
					ОператорыЗакрытия.Добавить(ТекущийТэг);
				Иначе
					ОператорыОткрытия.Добавить(ТекущийТэг);
				КонецЕсли;
				
				ТекущийТэг = "";
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ТекИндекс = ОператорыОткрытия.ВГраница();
	
	Пока ТекИндекс >=0 Цикл
		ТекОператорОткрытия = ОператорыОткрытия.Получить(ТекИндекс);
		ТекОператорЗакрытия = ПолучитьОператорЗакрытия(ТекОператорОткрытия, ТэгОткрытие, ТэгЗакрытие);
		ИндексЭлемента = ОператорыЗакрытия.Найти(ТекОператорЗакрытия);
		Если ИндексЭлемента <> Неопределено Тогда
			ОператорыЗакрытия.Удалить(ИндексЭлемента);
			ОператорыОткрытия.Удалить(ТекИндекс);
		КонецЕсли;
		ТекИндекс = ТекИндекс - 1;
	КонецЦикла;
	
	Если ОператорыОткрытия.Количество() = 0 И ОператорыЗакрытия.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон(НСтр("ru = 'Ошибок в файле %1 нет.'"), ДополнительныеПараметры.ИмяФайла);
		Сообщение.Сообщить();
	ИначеЕсли ОператорыОткрытия.Количество() = 0 И ОператорыЗакрытия.Количество() > 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Операторов закрытия больше, чем операторов открытия!
                                |Оставшиеся операторы закрытия:'");
		Сообщение.Сообщить();
		Для каждого ТекОператор Из ОператорыЗакрытия Цикл
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекОператор;
			Сообщение.Сообщить();
		КонецЦикла;
	ИначеЕсли ОператорыОткрытия.Количество() > 0 И ОператорыЗакрытия.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Операторов открытия больше, чем операторов закрытия!
                                |Оставшиеся операторы открытия:'");
		Сообщение.Сообщить();
		Для каждого ТекОператор Из ОператорыОткрытия Цикл
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекОператор;
			Сообщение.Сообщить();
		КонецЦикла;
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Количество операторов открытия и закрытия не совпадает!
                                |Оставшиеся операторы открытия:'");
		Сообщение.Сообщить();
		Для каждого ТекОператор Из ОператорыОткрытия Цикл
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекОператор;
			Сообщение.Сообщить();
		КонецЦикла;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Оставшиеся операторы закрытия:'");
		Сообщение.Сообщить();
		Для каждого ТекОператор Из ОператорыЗакрытия Цикл
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекОператор;
			Сообщение.Сообщить();
		КонецЦикла;
	КонецЕсли;
			
КонецПроцедуры			

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьОператорЗакрытия(ТекОператорОткрытия, ТэгОткрытие, ТэгЗакрытие)

	ТекОператорЗакрытия = "";
	
	Если СтрНачинаетсяС(ТекОператорОткрытия, ТэгОткрытие) Тогда

		мТекОператорОткрытия = Сред(ТекОператорОткрытия, 2);
		НачПробелВхождение   = СтрНайти(мТекОператорОткрытия, " ", НаправлениеПоиска.СНачала);
		
		Если НачПробелВхождение > 0 Тогда
			ТекОператорЗакрытия = ТэгОткрытие + "/" + Лев(мТекОператорОткрытия, НачПробелВхождение-1) + ТэгЗакрытие;
		Иначе
			ТекОператорЗакрытия = ТэгОткрытие + "/" + мТекОператорОткрытия;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТекОператорЗакрытия;

КонецФункции

#КонецОбласти
