
#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)

	Ссылка			= Элементы.Список.ТекущаяСтрока;
	АдресКартинки	= ПолучитьНавигационнуюСсылку(Ссылка, "Флаг");
	Комментарий		= ПолучитьКомментарийНаСервереБезКонтекста(Ссылка);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьКомментарийНаСервереБезКонтекста(Ссылка)

	Возврат Ссылка.Комментарий;

КонецФункции

#КонецОбласти
