
#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы


&НаКлиенте
Процедура ПутьКСпискуФайловНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	НачалоВыбораПути(Элемент, Ложь, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайламНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	НачалоВыбораПути(Элемент, Истина, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СравнитьФайлыСоСписком(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		СравнитьФайлыСоСпискомНаКлиенте();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НачалоВыбораПути(Элемент, ВыборКаталога, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РежимДиалога = ?(ВыборКаталога, РежимДиалогаВыбораФайла.ВыборКаталога, РежимДиалогаВыбораФайла.Открытие);
	Диалог = Новый ДиалогВыбораФайла(РежимДиалога);
	
	Диалог.Показать(Новый ОписаниеОповещения("ПослеЗакрытияДиалогаВыбора", ЭтотОбъект, Элемент.Имя));

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияДиалогаВыбора(ВыбранныеФайлы, ИмяРеквизита) Экспорт

	Если ТипЗнч(ВыбранныеФайлы) = Тип("Массив") И ВыбранныеФайлы.Количество() > 0 Тогда
		ЭтотОбъект[ИмяРеквизита] = ВыбранныеФайлы.Получить(0);
		ПриИзмененииПутиКФайлам();
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура СравнитьФайлыСоСпискомНаКлиенте()

	ТекущийФайл  = Новый Файл(ПутьКСпискуФайлов);
	ДокТекст     = Новый ТекстовыйДокумент;
	ДопПараметры = Новый Структура("ТекущийФайл, ИмяФайла, ДокТекст", ТекущийФайл, ТекущийФайл.Имя, ДокТекст);
	Описание     = Новый ОписаниеОповещения("ПослеЗавершенияЧтенияФайла", ЭтотОбъект, ДопПараметры, "ПриВозникновенииОшибкиФайла", ЭтотОбъект);
	ДокТекст.НачатьЧтение(Описание, ТекущийФайл.ПолноеИмя, КодировкаТекста.UTF8);

КонецПроцедуры

&НаКлиенте
Процедура ПриВозникновенииОшибкиФайла(ИнфоОбОшибке, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Причина = ?(ИнфоОбОшибке.Причина <> Неопределено, ИнфоОбОшибке.Причина.Описание, ИнфоОбОшибке.Описание);
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = СтрШаблон(НСтр("ru = 'Ошибка при работе с файлом <%1>; по причине: <%2>.'"), ДополнительныеПараметры.ИмяФайла, Причина);;
	Сообщение.Сообщить();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗавершенияЧтенияФайла(ДополнительныеПараметры) Экспорт
	
	ДокТекст   = ДополнительныеПараметры.ДокТекст;
	КолСтрок   = ДокТекст.КоличествоСтрок();
	МассивИмен = Новый Массив;
	
	Для Счетчик = 1 По КолСтрок Цикл
		МассивИмен.Добавить(ДокТекст.ПолучитьСтроку(Счетчик));
	КонецЦикла;
	
	НачатьПоискФайлов(Новый ОписаниеОповещения("ПослеЗавершенияПоискаФайлов", ЭтотОбъект, МассивИмен), ПутьКФайлам, "*.*");

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗавершенияПоискаФайлов(НайденныеФайлы, МассивИмен) Экспорт

	НаибольшийИндекс = НайденныеФайлы.ВГраница();
	
	Пока НаибольшийИндекс >= 0 Цикл
		НайденныйФайл = НайденныеФайлы.Получить(НаибольшийИндекс);
		ДопПараметры  = Новый Структура("НайденныеФайлы, НаибольшийИндекс, МассивИмен", НайденныеФайлы, НаибольшийИндекс, МассивИмен);
		НайденныйФайл.НачатьПроверкуЭтоКаталог(Новый ОписаниеОповещения("ПослеЗавершенияПроверкиЭтоКаталог", ЭтотОбъект, ДопПараметры));
		НаибольшийИндекс = НаибольшийИндекс - 1;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗавершенияПроверкиЭтоКаталог(ЭтоКаталог, ДопПараметры) Экспорт

	Если ЭтоКаталог Тогда
		ДопПараметры.НайденныеФайлы.Удалить(ДопПараметры.НаибольшийИндекс);
	КонецЕсли;
	
	Если ДопПараметры.НаибольшийИндекс <= 0 Тогда
		ПослеОкончанияПроверкиЭтоКаталог(ДопПараметры);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеОкончанияПроверкиЭтоКаталог(ДопПараметры) Экспорт

	ДобавленныеФайлы = Новый Массив;
	УдаленныеФайлы   = Новый Массив;
	ИмеющиесяФайлы   = Новый Массив;
	РазделительПути  = ПолучитьРазделительПутиКлиента();
	ТекПутьКФайлам   = ПутьКФайлам + ?(СтрЗаканчиваетсяНа(ПутьКФайлам, РазделительПути), "", РазделительПути);
	ПутьДляУдаленных = ТекПутьКФайлам + "Del";
	ПутьДляНовых     = ТекПутьКФайлам + "New";

	Для каждого НайденныйФайл Из ДопПараметры.НайденныеФайлы Цикл
		ИмяФайла = НайденныйФайл.Имя;
		Если ДопПараметры.МассивИмен.Найти(ИмяФайла) = Неопределено Тогда
			УдаленныеФайлы.Добавить(ИмяФайла);
		КонецЕсли;
		ИмеющиесяФайлы.Добавить(ИмяФайла);
	КонецЦикла;
	
	Для каждого ТекИмяФайла Из ДопПараметры.МассивИмен Цикл
		Если ИмеющиесяФайлы.Найти(ТекИмяФайла) = Неопределено Тогда
			ДобавленныеФайлы.Добавить(ТекИмяФайла);
		КонецЕсли;
	КонецЦикла;
	
	НаибольшийИндекс = УдаленныеФайлы.ВГраница();
	
	Если НаибольшийИндекс < 0 Тогда
		
		СоздатьДобавленныеФайлы(ДобавленныеФайлы, ПутьДляНовых, РазделительПути);
		
	Иначе
	
		Пока НаибольшийИндекс >= 0 Цикл
			
			УдаленныйФайл     = УдаленныеФайлы.Получить(НаибольшийИндекс);
			ИмяФайлаИсточника = ТекПутьКФайлам + УдаленныйФайл;
			ИмяФайлаПриемника = ПутьДляУдаленных + РазделительПути + УдаленныйФайл;
			ДопПараметры      = Новый Структура("УдаленныеФайлы, ДобавленныеФайлы, ТекущийФайл, ТекущееДействие, НаибольшийИндекс, ПутьДляНовых, РазделительПути", УдаленныеФайлы, ДобавленныеФайлы, УдаленныйФайл, НСтр("ru = 'перемещения файла'"), НаибольшийИндекс, ПутьДляНовых, РазделительПути);
			
			НачатьПеремещениеФайла(Новый ОписаниеОповещения("ПослеПеремещенияФайла", ЭтотОбъект, ДопПараметры, "ПриВозникновенииОшибкиСФайловойСистемой", ЭтотОбъект), ИмяФайлаИсточника, ИмяФайлаПриемника);
			НаибольшийИндекс  = НаибольшийИндекс - 1;
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриВозникновенииОшибкиСФайловойСистемой(ИнфоОбОшибке, СтандартнаяОбработка, ДопПараметры) Экспорт
	
	ОписаниеПричины = ?(ИнфоОбОшибке.Причина <> Неопределено, ИнфоОбОшибке.Причина.Описание, ИнфоОбОшибке.Описание);
	ТекстСообщения  = СтрШаблон(НСтр("ru = 'Ошибка %1 %2; по причине: %3.'"), ДопПараметры.ТекущееДействие, ДопПараметры.ТекущийФайл, ОписаниеПричины);
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщения;
	Сообщение.Сообщить();
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПеремещенияФайла(ПеремещаемыйФайл, ДопПараметры) Экспорт
	
	Если ДопПараметры.НаибольшийИндекс <= 0 Тогда
		СоздатьДобавленныеФайлы(ДопПараметры.ДобавленныеФайлы, ДопПараметры.ПутьДляНовых, ДопПараметры.РазделительПути);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеСозданиеКаталогаДляУдаленных(ИмяКаталога, ДопПараметры) Экспорт
	
	Если НЕ ДопПараметры.Свойство("ПутьДляУдаленных") Тогда
		ПутьДляНовых = Неопределено;
		Если ДопПараметры.Свойство("ПутьДляНовых", ПутьДляНовых) Тогда
			ТекФайл = Новый Файл(ПутьДляНовых);
			ТекФайл.НачатьПроверкуСуществования(Новый ОписаниеОповещения("ПослеЗавершенияПроверкиСуществования", ЭтотОбъект, ДопПараметры, "ПриВозникновенииОшибкиСФайловойСистемой", ЭтотОбъект));
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗавершенияПроверкиСуществования(Существует, ДопПараметры) Экспорт
	
	ПутьККаталогу = Неопределено;
	
	Если НЕ Существует Тогда
		
		Если ДопПараметры.Свойство("ПутьДляУдаленных", ПутьККаталогу) Тогда
			ДопПараметры.Удалить("ПутьДляУдаленных");
		Иначе
			ДопПараметры.Свойство("ПутьДляНовых", ПутьККаталогу);
		КонецЕсли;
			
	Иначе
		
		ДопПараметры.Свойство("ПутьДляНовых", ПутьККаталогу);
		
	КонецЕсли;
	
	Если ПутьККаталогу <> Неопределено Тогда
		ДопПараметры.Вставить("ТекущийФайл", ПутьККаталогу);
		НачатьСозданиеКаталога(Новый ОписаниеОповещения("ПослеСозданиеКаталогаДляУдаленных", ЭтотОбъект, ДопПараметры, "ПриВозникновенииОшибкиСФайловойСистемой", ЭтотОбъект), ПутьККаталогу);
	КонецЕсли;
	
КонецПроцедуры
	
&НаКлиенте
Процедура ПриИзмененииПутиКФайлам()

	Если ПустаяСтрока(ПутьКФайлам) Тогда
		Возврат;
	КонецЕсли;
	
	РазделительПути  = ПолучитьРазделительПутиКлиента();
	ТекПутьКФайлам   = ПутьКФайлам + ?(СтрЗаканчиваетсяНа(ПутьКФайлам, РазделительПути), "", РазделительПути);
	ПутьДляУдаленных = ТекПутьКФайлам + "Del";
	ПутьДляНовых     = ТекПутьКФайлам + "New";
	ДопПараметры     = Новый Структура("ПутьДляУдаленных, ПутьДляНовых, ТекущийФайл, ТекущееДействие", ПутьДляУдаленных, ПутьДляНовых, ПутьДляУдаленных, НСтр("ru = 'проверки каталога'"));
	ТекФайл          = Новый Файл(ПутьДляУдаленных);
	
	ТекФайл.НачатьПроверкуСуществования(Новый ОписаниеОповещения("ПослеЗавершенияПроверкиСуществования", ЭтотОбъект, ДопПараметры, "ПриВозникновенииОшибкиСФайловойСистемой", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДобавленныеФайлы(ДобавленныеФайлы, ПутьДляНовых, РазделительПути)

	Для каждого ДобавленныйФайл Из ДобавленныеФайлы Цикл
		ТекстДок = Новый ТекстовыйДокумент;
		ДопПараметры = Новый Структура("ТекущийФайл, ТекущееДействие", ДобавленныйФайл, НСтр("ru = 'записи файла'"));
		ИмяФайла = ПутьДляНовых + РазделительПути + ДобавленныйФайл;
		ТекстДок.НачатьЗапись(Новый ОписаниеОповещения("ПослеЗавершенияЗаписиФайла", ЭтотОбъект, ДопПараметры, "ПриВозникновенииОшибкиСФайловойСистемой", ЭтотОбъект), ИмяФайла);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗавершенияЗаписиФайла(Результат, ДопПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Неизвестно - был ли файл записан или нет'");
		Сообщение.Сообщить();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
