&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДобавляемыеРеквизиты = Новый Массив();
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ТаблицаДанных", Новый ОписаниеТипов("ТаблицаЗначений")));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Колонка1", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(2, 0)), "ТаблицаДанных"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Колонка2", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(2, 0)), "ТаблицаДанных"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Колонка3", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(2, 0)), "ТаблицаДанных"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Колонка4", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(2, 0)), "ТаблицаДанных"));
	
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("КоличествоХодов", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 0))));
	
	ЭтотОбъект.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	СегенерироватьИЗаполнитьТаблицуДанныхНаСервере();
	СоздатьКнопкиПоТаблицеДанныхНаСервере();
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
Функция ПолучитьСлучайноеЧислоНаСервере(ГСЧ, МассивЧисел)


	ТекущееЧисло = -1;
	
	Пока МассивЧисел.Найти(ТекущееЧисло) <> Неопределено Цикл
		ТекущееЧисло = ГСЧ.СлучайноеЧисло(0, 15);
	КонецЦикла;
	
	МассивЧисел.Добавить(ТекущееЧисло);
	
	Возврат ТекущееЧисло;


КонецФункции

&НаСервере
Процедура СегенерироватьИЗаполнитьТаблицуДанныхНаСервере()


	ЭтотОбъект.ТаблицаДанных.Очистить();
	МассивЧисел = Новый Массив;
	МассивЧисел.Добавить(-1);
	
	ГСЧ = Новый ГенераторСлучайныхЧисел(Секунда(ТекущаяДата()));
	
	Для ТекИндексСтрок = 1 По 4 Цикл
		
		НоваяСтрока = ЭтотОбъект.ТаблицаДанных.Добавить();
		
		Для ТекИндексКолонок = 1 По 4 Цикл
		
			НоваяСтрока["Колонка" + ТекИндексКолонок] = ПолучитьСлучайноеЧислоНаСервере(ГСЧ, МассивЧисел);
		
		КонецЦикла;		
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьКнопкиПоТаблицеДанныхНаСервере()


	Для ТекИндексСтрок = 0 По 3 Цикл
		
		НоваяГруппа = Элементы.Добавить("Группа" + ТекИндексСтрок, Тип("ГруппаФормы"));
		НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
		
		ТекСтрока = ЭтотОбъект.ТаблицаДанных.Получить(ТекИндексСтрок);
		
		Для ТекИндексКолонок = 1 По 4 Цикл
		
			ЗначениеЯчейки = ТекСтрока["Колонка" + ТекИндексКолонок];
			ИмяЭлемента = Формат(ТекИндексСтрок, "ЧЦ=2; ЧН=; ЧВН=") + Формат(ТекИндексКолонок, "ЧЦ=2; ЧН=; ЧВН=");
			
			НоваяКоманда = Команды.Добавить("Команда" + ИмяЭлемента);
			НоваяКоманда.Действие = "КнопкаНажатие";
			НоваяКоманда.Заголовок = Формат(ЗначениеЯчейки, "ЧЦ=2; ЧН=; ЧВН=");
			
			НоваяКнопка = Элементы.Добавить("Кнопка" + ЗначениеЯчейки, Тип("КнопкаФормы"), НоваяГруппа);
			НоваяКнопка.ИмяКоманды = НоваяКоманда.Имя;
			Если ЗначениеЯчейки = 0 Тогда
				НоваяКнопка.Доступность = Ложь;
				НоваяКнопка.ЦветТекста = ЦветаСтиля.ЦветФонаКнопки;
			КонецЕсли;
		
		КонецЦикла;		
		
	КонецЦикла;

КонецПроцедуры // СоздатьКнопкиПоТаблицеДанныхНаСервере()

&НаКлиенте
Процедура КнопкаНажатие(Команда)
	
	ЭтотОбъект.КоличествоХодов = ЭтотОбъект.КоличествоХодов + 1;
	
	ИмяКоманды = Команда.Имя;
	НачальныйНомер = СтрДлина(ИмяКоманды)-3;
	ИндексСтроки = Число(Сред(ИмяКоманды, НачальныйНомер, 2));
	ИндексКолонки = Число(Сред(ИмяКоманды, НачальныйНомер+2, 2));
	ВариантыНаправлений = Новый Структура("Вверх, Вниз, Вправо, Влево");
	
	СтруктураНаправленияХода = ВозможностьХодаНаСервере(ИндексСтроки, ИндексКолонки, ВариантыНаправлений);
	Если СтруктураНаправленияХода <> Неопределено Тогда
		ПоменятьЯчейкиМестамиНаСервере(ИндексКолонки, ИндексСтроки, СтруктураНаправленияХода);
		Если ЧислаРасставленыПравильноНаСервере() Тогда
			ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ПослеОтветаПользователя", ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещенияОЗавершении, НСтр("ru = 'Начать заново?'"), РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Нет, , КодВозвратаДиалога.Нет);
			ВывестиСообщениеОВыигрыше();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаПользователя(РезультатВопроса, ДополнительныеПараметры) Экспорт


	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ОчиститьЭлементыСФормыНаСервере();
		СегенерироватьИЗаполнитьТаблицуДанныхНаСервере();
		СоздатьКнопкиПоТаблицеДанныхНаСервере();
	КонецЕсли;

КонецПроцедуры // ПослеОтветаПользователя()

&НаКлиенте
Процедура ВывестиСообщениеОВыигрыше()

	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = СтрШаблон(НСтр("ru = 'Поздравляю! И всего лишь %1 ходов!'"), ЭтотОбъект.КоличествоХодов);
	Сообщение.Сообщить();
	
	ИзменитьОтображениеКнопокНаСервере();
	
КонецПроцедуры // ВывестиСообщениеОВыигрыше()

&НаСервере
Процедура ИзменитьОтображениеКнопокНаСервере()


	Для каждого ТекущийЭлемент Из Элементы Цикл
		Если ТипЗнч(ТекущийЭлемент) = Тип("КнопкаФормы") Тогда
			ТекущийЭлемент.Доступность = Ложь;
			ТекущийЭлемент.Картинка = БиблиотекаКартинок.СоздатьЭлементСписка;
			ТекущийЭлемент.Отображение = ОтображениеКнопки.Картинка;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры // ИзменитьОтображениеКнопокНаСервере()

&НаСервере
Функция ВозможностьХодаНаСервере(ИндексСтроки, ИндексКолонки, ВариантыНаправлений)

	Для каждого КлючИЗначение Из ВариантыНаправлений Цикл
	
		СтруктураНаправленияХода = ЕстьВозможностьХодаНаСервере(ИндексСтроки, ИндексКолонки, КлючИЗначение.Ключ);
		
		Если СтруктураНаправленияХода <> Неопределено Тогда
			Возврат СтруктураНаправленияХода;
		КонецЕсли;

	КонецЦикла;
	
	Возврат Неопределено;

КонецФункции // ВозможностьХода()

&НаСервере
Функция ЕстьВозможностьХодаНаСервере(ИндексСтроки, ИндексКолонки, НаправлениеХода)

	ПланируемаяСтрока = ИндексСтроки;
	ПланируемаяКолонка = ИндексКолонки;
	
	Если НаправлениеХода = "Вверх" Тогда
		ПланируемаяСтрока = ПланируемаяСтрока - 1;
	ИначеЕсли НаправлениеХода = "Вниз" Тогда
		ПланируемаяСтрока = ПланируемаяСтрока + 1;
	ИначеЕсли НаправлениеХода = "Вправо" Тогда
		ПланируемаяКолонка = ПланируемаяКолонка + 1;
	ИначеЕсли НаправлениеХода = "Влево" Тогда
		ПланируемаяКолонка = ПланируемаяКолонка - 1;
	КонецЕсли;
	
	// Пределы поля
	Если ПланируемаяСтрока > 3 ИЛИ ПланируемаяСтрока < 0 ИЛИ ПланируемаяКолонка > 4 ИЛИ ПланируемаяКолонка < 1 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТекСтрока = ЭтотОбъект.ТаблицаДанных.Получить(ПланируемаяСтрока);
	ЗначениеЯчейки = ТекСтрока["Колонка" + ПланируемаяКолонка];
	
	Если ЗначениеЯчейки = 0 Тогда
		Возврат Новый Структура("ИндексКолонки, ИндексСтроки, НаправлениеХода", ПланируемаяКолонка, ПланируемаяСтрока, НаправлениеХода);
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции // ЕстьВозможностьХода()

&НаСервере
Процедура ПоменятьЯчейкиМестамиНаСервере(ИндексКолонки, ИндексСтроки, НаправлениеХода)
	
	ТекСтрокаИсточник = ЭтотОбъект.ТаблицаДанных.Получить(ИндексСтроки);
	ЗначениеИсточник = ТекСтрокаИсточник["Колонка" + ИндексКолонки];
	
	ТекСтрокаПриемник = ЭтотОбъект.ТаблицаДанных.Получить(НаправлениеХода.ИндексСтроки);
	ЗначениеПриемник = ТекСтрокаПриемник["Колонка" + НаправлениеХода.ИндексКолонки];
	
	ТекСтрокаИсточник["Колонка" + ИндексКолонки] = ЗначениеПриемник;
	ТекСтрокаПриемник["Колонка" + НаправлениеХода.ИндексКолонки] = ЗначениеИсточник;
	
	ОчиститьЭлементыСФормыНаСервере();
	
	СоздатьКнопкиПоТаблицеДанныхНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьЭлементыСФормыНаСервере()
	
	Для ТекИндексСтрок = 0 По 3 Цикл
		ЭлементУправления = Элементы.Найти("Группа" + ТекИндексСтрок);
		Если ЭлементУправления <> Неопределено Тогда
			Элементы.Удалить(ЭлементУправления);
		КонецЕсли;
		Для ТекИндексКолонок = 1 По 4 Цикл
			ИмяКоманды = "Команда" + Формат(ТекИндексСтрок, "ЧЦ=2; ЧН=; ЧВН=") + Формат(ТекИндексКолонок, "ЧЦ=2; ЧН=; ЧВН=");
			УдаляемаяКоманда = Команды.Найти(ИмяКоманды);
			Если УдаляемаяКоманда <> Неопределено Тогда
				Команды.Удалить(УдаляемаяКоманда);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ЧислаРасставленыПравильноНаСервере()

	ТекСчетчик = 1;
	РасставленыПравильно = Истина;
	
	Для ИндексСтроки = 0 По 3 Цикл
		
		Для ИндексКолонки = 1 По 4 Цикл
		
			ТекСтрока = ЭтотОбъект.ТаблицаДанных.Получить(ИндексСтроки);
			ЗначениеЯчейки = ТекСтрока["Колонка" + ИндексКолонки];
			
			Если ТекСчетчик = 16 Тогда
				ТекСчетчик = 0;
			КонецЕсли;
		
			Если ТекСчетчик <> ЗначениеЯчейки Тогда
				РасставленыПравильно = Ложь;
			КонецЕсли;
			
			ТекСчетчик = ТекСчетчик + 1;
			
		КонецЦикла;		
	
	КонецЦикла;
	
	Возврат РасставленыПравильно;

КонецФункции // ЧислаРасставленыПравильно()


#Если Не Клиент Тогда
	ИмяОбработчика = ЭтотОбъект.ПолучитьДействие("ПриСозданииНаСервере");
	Если ПустаяСтрока(ИмяОбработчика) Тогда
		ЭтотОбъект.УстановитьДействие("ПриСозданииНаСервере", "ПриСозданииНаСервере")
	КонецЕсли;	
#КонецЕсли
