
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	СсылкаНаФильм = Неопределено;
	
	Если НЕ Параметры.Свойство("СсылкаНаФильм", СсылкаНаФильм) Тогда
		Отказ = Истина;
	КонецЕсли;
	
	ДокументРезультат.Очистить();
	
	Если СсылкаНаФильм.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект.АвтоЗаголовок = Ложь;
	ЭтотОбъект.Заголовок = СсылкаНаФильм.Наименование;
	
	СхемаКомпоновкиДанных	= ПолучитьОбщийМакет("ИнформацияОФильме");	
	НастройкиПоУмолчанию	= СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	КомпоновщикНастроек		= Новый КомпоновщикНастроекКомпоновкиДанных();
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиПоУмолчанию);

	Параметр = Новый ПараметрКомпоновкиДанных("Ссылка");
 	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(Параметр, СсылкаНаФильм);
 	Настройки = КомпоновщикНастроек.Настройки;

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки);
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	ОбластьЯчеек = ДокументРезультат.НайтиТекст("@ИЗОБРАЖЕНИЕ@");
	Изображение	 = СсылкаНаФильм.Афиша.Получить();
	Если НЕ ОбластьЯчеек = Неопределено И ТипЗнч(Изображение) = Тип("Картинка") Тогда
		
		ОбластьЯчеек.Текст			= "";
		ОбластьЯчеек.ВысотаСтроки	= 230;
		
		НовыйРисунок = ДокументРезультат.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
		НовыйРисунок.РазмерКартинки = РазмерКартинки.АвтоРазмер;
		НовыйРисунок.ЦветЛинии = Новый Цвет(230, 230, 230);
		НовыйРисунок.Расположить(ОбластьЯчеек);
		НовыйРисунок.Картинка = Изображение;
		
	КонецЕсли;
	
	ДокументРезультат.ОтображатьЗаголовки	= Ложь;
	ДокументРезультат.ОтображатьСетку		= Ложь;
	ДокументРезультат.АвтоМасштаб			= Истина;
	ДокументРезультат.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	ДокументРезультат.Напечатать(РежимИспользованияДиалогаПечати.Использовать);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьКакPDF(Команда)

	СохранитьТабличныйДокументНаДиске(ТипФайлаТабличногоДокумента.PDF);

КонецПроцедуры

&НаКлиенте
Процедура СохранитьКакXLS(Команда)

	СохранитьТабличныйДокументНаДиске(ТипФайлаТабличногоДокумента.XLS);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьТабличныйДокументНаДиске(ТипФайла)

	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	
	Если ТипФайла = ТипФайлаТабличногоДокумента.PDF Тогда
		Диалог.Расширение = "pdf";
		Диалог.Фильтр = "Документ (*.pdf)|*.pdf";
	Иначе
		Диалог.Расширение = "xls";
		Диалог.Фильтр = "Документ (*.xls)|*.xls";
	КонецЕсли;
	
	ДополнительныеПараметры	= Новый Структура("ДокументРезультат, ТипФайла", ДокументРезультат, ТипФайла);
	Описание_Оповещения		= Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтотОбъект, ДополнительныеПараметры);
	
	Диалог.Показать(Описание_Оповещения);

КонецПроцедуры // СохранитьТабличныйДокументНаДиске()

&НаКлиенте
Процедура ПослеВыбораФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт

	Если НЕ ВыбранныеФайлы = Неопределено Тогда
		Если ТипЗнч(ВыбранныеФайлы) = Тип("Массив") И ВыбранныеФайлы.Количество() > 0 Тогда
			ДокРезультат = ДополнительныеПараметры.ДокументРезультат;
			Попытка
				ОпОповещения = Новый ОписаниеОповещения("ПослеЗавершенияЗаписиФайла", ЭтотОбъект, Новый Структура("ИмяФайла", ВыбранныеФайлы[0]));
				ДокРезультат.НачатьЗапись(ОпОповещения, ВыбранныеФайлы[0], ДополнительныеПараметры.ТипФайла);
			Исключение
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Ошибка записи файла; по причине: " + ОписаниеОшибки();
				Сообщение.Сообщить();
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ПослеВыбораФайла()

&НаКлиенте
Процедура ПослеЗавершенияЗаписиФайла(ЗаписьФайлаЗавершена, ДополнительныеПараметры) Экспорт

	Если ТипЗнч(ЗаписьФайлаЗавершена) = Тип("Булево") Тогда
		
		Если ЗаписьФайлаЗавершена Тогда
			
			ИмяФайла = ДополнительныеПараметры.ИмяФайла;
			ДействиеПриНажатии = Новый ОписаниеОповещения("ПослеНажатияНаОкноОповещения", ЭтотОбъект, Новый Структура("ИмяФайла", ИмяФайла));
			
			ПоказатьОповещениеПользователя(НСтр("ru = 'Файл успешно сохранен'"), ДействиеПриНажатии, ИмяФайла, БиблиотекаКартинок.Записать);
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // ПослеЗавершенияЗаписиФайла()

&НаКлиенте
Процедура ПослеНажатияНаОкноОповещения(ДополнительныеПараметры) Экспорт

	#Если Не ВебКлиент И НЕ МобильныйКлиент Тогда
		КомандаСистемы(ДополнительныеПараметры.ИмяФайла);
	#КонецЕсли

КонецПроцедуры // ПослеНажатияНаОкноОповещения()

&НаКлиенте
Процедура ОповеститьПоЭлектроннойПочте(Команда)
	
	#Если Не ВебКлиент И НЕ МобильныйКлиент Тогда
		ПоказатьОповещениеПользователя("Нельзя!", , "Недоступно в ""Веб-клиенте""!");
		Возврат;
	#КонецЕсли
	
	Оповещение	= Новый ОписаниеОповещения("ПослеВводаЗначения", ЭтотОбъект);
	ВыбЗначение	= Неопределено;
	
	ПоказатьВводЗначения(Оповещение, ВыбЗначение, , Новый ОписаниеТипов("СправочникСсылка.АдресаОповещения"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаЗначения(ВыбЗначение, ВыбПараметры) Экспорт

	Если НЕ ВыбЗначение = Неопределено Тогда
		ОтправитьПоЭлектроннойПочте(ВыбЗначение);
	КонецЕсли;

КонецПроцедуры // ПослеВводаЗначения()

&НаКлиенте
Процедура ОтправитьПоЭлектроннойПочте(Получатель)

	#Если Не ВебКлиент И НЕ МобильныйКлиент Тогда
		
	ИмяВременного	= ПолучитьИмяВременногоФайла("pdf");
	ТекФайл			= Новый Файл(ИмяВременного);
	ИмяФайла		= ТекФайл.Имя;
	ДопПараметры	= Новый Структура("Получатель, ИмяФайла, ИмяВременного", Получатель, ИмяФайла, ИмяВременного);
	ОпОповещения	= Новый ОписаниеОповещения("ПослеЗавершенияЗаписиВременногоФайла", ЭтотОбъект, ДопПараметры);
	
	Попытка
		ДокументРезультат.НачатьЗапись(ОпОповещения, ИмяВременного, ТипФайлаТабличногоДокумента.PDF);
	Исключение
		ПоказатьОповещениеПользователя("Ошибка записи файла", , ИмяВременного);
	КонецПопытки;
	
	#КонецЕсли
	
КонецПроцедуры // ОтправитьПоЭлектроннойПочте()

&НаКлиенте
Процедура ПослеЗавершенияЗаписиВременногоФайла(ЗаписьФайлаЗавершена, ДополнительныеПараметры) Экспорт

	#Если Не ВебКлиент И НЕ МобильныйКлиент Тогда
		
	ИмяФайла			= ДополнительныеПараметры.ИмяФайла;
	Получатель			= ДополнительныеПараметры.Получатель;
	ИмяВременного		= ДополнительныеПараметры.ИмяВременного;
	Профиль 			= Новый ИнтернетПочтовыйПрофиль;
	Почта				= Новый ИнтернетПочта;
	ПочтовоеСообщение	= Новый ИнтернетПочтовоеСообщение;
	СтруктураПараметров	= ПолучитьСтруктуруПараметров();
	
	Профиль.АдресСервераSMTP	= СтруктураПараметров.АдресСервераSMTP;
	Профиль.Пароль				= СтруктураПараметров.Пароль;
	Профиль.Пользователь		= СтруктураПараметров.Пользователь;
	Профиль.ПортSMTP			= СтруктураПараметров.ПортSMTP;
	Профиль.ИспользоватьSSLSMTP	= Истина;
	Профиль.АутентификацияSMTP	= СпособSMTPАутентификации.Login;
	Профиль.ПарольSMTP			= СтруктураПараметров.Пароль;
	Профиль.ПользовательSMTP	= СтруктураПараметров.Пользователь;
	
	Вложение = Новый ДвоичныеДанные(ИмяВременного);
	
	ПочтовоеСообщение.Получатели.Добавить(Получатель);
	ПочтовоеСообщение.Отправитель.Адрес	= СтруктураПараметров.АдресОтправителя;
	ПочтовоеСообщение.Тема = ЭтотОбъект.Заголовок;
	ПочтовоеСообщение.Вложения.Добавить(Вложение, ИмяФайла);
	
	Попытка
		Почта.Подключиться(Профиль);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка подключения к почтовому ящику; по причине: " + ОписаниеОшибки();
		Сообщение.Сообщить();
		УдалитьВложение(ИмяВременного);
		Возврат;
	КонецПопытки;
	
	Попытка
		Почта.Послать(ПочтовоеСообщение);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка отправки почтового сообщения; по причине: " + ОписаниеОшибки();
		Сообщение.Сообщить();
		УдалитьВложение(ИмяВременного);
		Возврат;
	КонецПопытки;
	
	Попытка
		Почта.Отключиться();
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка отключения от почтового ящика; по причине: " + ОписаниеОшибки();
		Сообщение.Сообщить();
	КонецПопытки;
	
	УдалитьВложение(ИмяВременного);

	#КонецЕсли
	
КонецПроцедуры // ПослеЗавершенияЗаписиВременногоФайла()

&НаКлиенте
Процедура УдалитьВложение(ИмяВременного)

	Попытка
	    НачатьУдалениеФайлов( , ИмяВременного);
	Исключение
	КонецПопытки;

КонецПроцедуры // УдалитьВложение()

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруПараметров()

	Возврат ОбщийМодульСервер.ПолучитьСтруктуруПараметровЭлПочты();

КонецФункции // ПолучитьСтруктуруПараметров()
