
#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьФильтрИзображений() Экспорт

	Возврат "Все картинки (*.bmp;*.dib;*.rle;*.jpg;*.jpeg;*.tif;*.gif;*.png;*.ico;*.wmf;*.emf)|*.bmp;*.dib;*.rle;*.jpg;*.jpeg;*.tif;*.gif;*.png;*.ico;*.wmf;*.emf|" 
	      + "Формат bmp (*.bmp;*.dib;*.rle)|*.bmp;*.dib;*.rle|"
	      + "Формат jpeg (*.jpg;*.jpeg)|*.jpg;*.jpeg|"
	      + "Формат tiff (*.tif)|*.tif|"
	      + "Формат gif (*.gif)|*.gif|"
	      + "Формат png (*.png)|*.png|"
	      + "Формат icon (*.ico)|*.ico|"
	      + "Формат метафайл (*.wmf;*.emf)|*.wmf;*.emf|";

КонецФункции // ПолучитьФильтрИзображений()

Функция ЗаменитьНедопустимыеСимволы(Знач СтрокаДляЗамены) Экспорт
	
	Если ПустаяСтрока(СтрокаДляЗамены) Тогда
		Возврат СтрокаДляЗамены;
	КонецЕсли;
	
	СтрокаДляЗамены = СтрЗаменить(СтрокаДляЗамены, "*", "");
	СтрокаДляЗамены = СтрЗаменить(СтрокаДляЗамены, "|", "");
	СтрокаДляЗамены = СтрЗаменить(СтрокаДляЗамены, "\", "");
	СтрокаДляЗамены = СтрЗаменить(СтрокаДляЗамены, ":", "");
	СтрокаДляЗамены = СтрЗаменить(СтрокаДляЗамены, """", "");
	СтрокаДляЗамены = СтрЗаменить(СтрокаДляЗамены, "<", "");
	СтрокаДляЗамены = СтрЗаменить(СтрокаДляЗамены, ">", "");
	СтрокаДляЗамены = СтрЗаменить(СтрокаДляЗамены, "?", "");
	СтрокаДляЗамены = СтрЗаменить(СтрокаДляЗамены, "/", "");
	
	Если ПустаяСтрока(СтрокаДляЗамены) Тогда
		СтрокаДляЗамены = Строка(Новый УникальныйИдентификатор);;
	КонецЕсли;

	Возврат СтрокаДляЗамены;
		
КонецФункции

Функция УдалитьПробелыМеждуРазделителями(ВхСтрока, Разделитель = ",", ВключатьПустые = Ложь) Экспорт

	СтрокаСРазделителем = "";
	МассивСоСтроками    = СтрРазделить(ВхСтрока, Разделитель, ВключатьПустые);
	
	Для каждого ЭлементМассива Из МассивСоСтроками Цикл
		СтрокаБезПробелов   = СокрЛП(ЭлементМассива);
		Если НЕ ПустаяСтрока(СтрокаБезПробелов) Тогда
			СтрокаСРазделителем = СтрокаСРазделителем + ?(ПустаяСтрока(СтрокаСРазделителем), "", Разделитель) + СтрокаБезПробелов;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтрокаСРазделителем;

КонецФункции // УдалитьПробелыМеждуРазделителями()

Функция ТолькоЦифрыВСтроке(ИсследуемаяСтрока) Экспорт
	
	Для ИндексСтроки = 1 По СтрДлина(ИсследуемаяСтрока) Цикл
		Если КодСимвола(ИсследуемаяСтрока, ИндексСтроки) < 48 ИЛИ КодСимвола(ИсследуемаяСтрока, ИндексСтроки) > 57 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;

КонецФункции // ТолькоЦифрыВСтроке()

#КонецОбласти
