
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьРасширенияВидеоНаСервере(ЭтотОбъект);
	
	СортироватьПо				= "Наименование";
	МассивОбъектов				= Неопределено;
	ПроверятьНахождениевПапке	= Истина;
	
	Параметры.Свойство("МассивОбъектов", МассивОбъектов);
	
	Если ТипЗнч(МассивОбъектов) = Тип("Массив") Тогда
		
		Для каждого ЭлементМассива Из МассивОбъектов Цикл
			Если НЕ ЭлементМассива.ЭтоГруппа Тогда
				НоваяСтрока = СписокФильмов.Добавить(ЭлементМассива);
			КонецЕсли;
		КонецЦикла;
		
		СформироватьПечатнуюФормуНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если НЕ ПустаяСтрока(Параметры.ПутьПоиска) Тогда
		Если НЕ ПустаяСтрока(Параметры.ПутьВыгрузки) Тогда
			ПодключитьОбработчикОжидания("ВывестиВHTMLвАвтоматическомРежиме", 0.1, Истина);
		КонецЕсли;
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаСписок;
		ВыбранныеФайлы = Новый Массив;
		ВыбранныеФайлы.Добавить(Параметры.ПутьПоиска);
		ПослеВыбораКаталога(ВыбранныеФайлы, Неопределено);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокФильмовПриАктивизацииСтроки(Элемент)

	ТекДанные = Элементы.СписокФильмов.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда
		
		ТекФильм = ТекДанные.Значение;
		
		Если ЗначениеЗаполнено(ТекФильм) Тогда
			
			ДанныеОФильме = ПолучитьДанныеОФильмеНаСервереБезКонтекста(ТекФильм);
			НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(ТекФильм);
			
			ПоказатьОповещениеПользователя(ДанныеОФильме.Наименование, НавигационнаяСсылка, ДанныеОФильме.Описание, ДанныеОФильме.Афиша);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПечатьСписка(Команда)

	Если ПустаяСтрока(СортироватьПо) Тогда
		ПоказатьОповещениеПользователя(НСтр("ru = 'Не заполнен реквизит!'"), , НСтр("ru = 'Не заполнено правило сортировки ""Сортировать по""!'"), БиблиотекаКартинок.УдалитьНепосредственно);
		Возврат;
	КонецЕсли;
	
	СформироватьПечатнуюФормуНаСервере();

	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаПечать;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСписок(Команда)

	СписокФильмов.Очистить();

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗапросом(Команда)

	Описание	= Новый ОписаниеОповещения("ПослеЗакрытияКонструктораЗапроса", ЭтотОбъект);
	Конструктор = Новый КонструкторЗапроса;
	Конструктор.Показать(Описание);

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПоискомПоФайлам(Команда)

	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Показать(Новый ОписаниеОповещения("ПослеВыбораКаталога", ЭтотОбъект));

КонецПроцедуры

&НаКлиенте
Процедура ВывестиВHTML(Команда)

	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Показать(Новый ОписаниеОповещения("ПослеВыбораКаталогаВыводаВHTML", ЭтотОбъект));
	
КонецПроцедуры // ВывестиВHTML()

&НаКлиенте
Процедура ВывестиСпискомВHTML(Команда)

	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Показать(Новый ОписаниеОповещения("ПослеВыбораКаталогаВыводаВHTML", ЭтотОбъект, Новый Структура("СпискомВHTML", Истина)));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеОФильмеНаСервереБезКонтекста(ТекФильм)
	
	Раздел		= Символы.ПС;
	Жанры		= "";
	Страны		= "";
	Аннотация	= "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЖанрыФильмов.Фильм КАК Фильм,
		|	ПРЕДСТАВЛЕНИЕ(ЖанрыФильмов.Жанр) КАК Жанр
		|ИЗ
		|	РегистрСведений.ЖанрыФильмов КАК ЖанрыФильмов
		|ГДЕ
		|	ЖанрыФильмов.Фильм = &Фильм
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтраныПроизводители.Фильм КАК Фильм,
		|	ПРЕДСТАВЛЕНИЕ(СтраныПроизводители.Страна) КАК Страна
		|ИЗ
		|	РегистрСведений.СтраныПроизводители КАК СтраныПроизводители
		|ГДЕ
		|	СтраныПроизводители.Фильм = &Фильм
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Аннотации.Владелец КАК Владелец,
		|	Аннотации.СодержаниеАннотации КАК СодержаниеАннотации
		|ИЗ
		|	Справочник.Аннотации КАК Аннотации
		|ГДЕ
		|	Аннотации.Владелец = &Фильм
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Фильмы.Ссылка КАК Ссылка,
		|	Фильмы.Наименование КАК Наименование,
		|	Фильмы.ДатаВыхода КАК ДатаВыхода
		|ИЗ
		|	Справочник.Фильмы КАК Фильмы
		|ГДЕ
		|	Фильмы.Ссылка = &Фильм";
	
	Запрос.УстановитьПараметр("Фильм", ТекФильм);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаЖанры	= РезультатыЗапроса[0].Выбрать();
	ВыборкаСтраны	= РезультатыЗапроса[1].Выбрать();
	ВыборкаАннотации= РезультатыЗапроса[2].Выбрать();
	Выборка			= РезультатыЗапроса[3].Выбрать();
	
	Пока ВыборкаЖанры.Следующий() Цикл
		Жанры = Жанры + ?(ПустаяСтрока(Жанры), "", ", ") + ВыборкаЖанры.Жанр;
	КонецЦикла;
	
	Пока ВыборкаСтраны.Следующий() Цикл
		Страны = Страны + ?(ПустаяСтрока(Страны), "", ", ") + ВыборкаСтраны.Страна;
	КонецЦикла;
	
	Пока ВыборкаАннотации.Следующий() Цикл
		Аннотация = Аннотация + ?(ПустаяСтрока(Аннотация), "", ", ") + ВыборкаАннотации.СодержаниеАннотации;
	КонецЦикла;
	
	Если ПустаяСтрока(Жанры) ИЛИ ПустаяСтрока(Страны) Тогда
		Раздел = "";
	КонецЕсли;
	
	Описание = Жанры + Раздел + Страны;
	Если ПустаяСтрока(Описание) Тогда
		Раздел = "";
	Иначе
		Раздел = Символы.ПС;
	КонецЕсли;
	
	Описание = Описание + Раздел + Лев(Аннотация, 111) + "...";
	
	Выборка.Следующий();
	
	ДанныеОФильме = Новый Структура;
	ДанныеОФильме.Вставить("Наименование", Выборка.Наименование);
	ДанныеОФильме.Вставить("Описание", Описание);
	ДанныеОФильме.Вставить("Афиша", Выборка.Ссылка.Афиша.Получить());
	
	Возврат ДанныеОФильме;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПакетРезультатовНаСервереБезКонтекста(МассивОбъектов)

	ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СпрФильмы.Ссылка КАК Фильм
		|ПОМЕСТИТЬ Фильмы
		|ИЗ
		|	Справочник.Фильмы КАК СпрФильмы
		|ГДЕ
		|	СпрФильмы.Ссылка В(&МассивОбъектов)
		|	И НЕ СпрФильмы.ЭтоГруппа
		|	И НЕ СпрФильмы.ПометкаУдаления
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Фильм
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеЖанрыФильмов.Фильм КАК Фильм,
		|	ПРЕДСТАВЛЕНИЕ(ДанныеЖанрыФильмов.Жанр) КАК Жанр
		|ПОМЕСТИТЬ ЖанрыФильмов
		|ИЗ
		|	РегистрСведений.ЖанрыФильмов КАК ДанныеЖанрыФильмов
		|ГДЕ
		|	ДанныеЖанрыФильмов.Фильм В
		|			(ВЫБРАТЬ
		|				Фильмы.Фильм
		|			ИЗ
		|				Фильмы КАК Фильмы)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Фильм
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеСтраныПроизводители.Фильм КАК Фильм,
		|	ДанныеСтраныПроизводители.Страна КАК Страна
		|ПОМЕСТИТЬ СтраныПроизводители
		|ИЗ
		|	РегистрСведений.СтраныПроизводители КАК ДанныеСтраныПроизводители
		|ГДЕ
		|	ДанныеСтраныПроизводители.Фильм В
		|			(ВЫБРАТЬ
		|				Фильмы.Фильм
		|			ИЗ
		|				Фильмы КАК Фильмы)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Фильм
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеДатыСкачиванияФильмов.Фильм КАК Фильм,
		|	ДанныеДатыСкачиванияФильмов.ДатаСкачивания КАК ДатаСкачивания
		|ПОМЕСТИТЬ ДатыСкачиванияФильмов
		|ИЗ
		|	РегистрСведений.ДатыСкачиванияФильмов КАК ДанныеДатыСкачиванияФильмов
		|ГДЕ
		|	ДанныеДатыСкачиванияФильмов.Фильм В
		|			(ВЫБРАТЬ
		|				Фильмы.Фильм
		|			ИЗ
		|				Фильмы КАК Фильмы)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Фильм
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(ДатыСкачиванияФильмов.ДатаСкачивания, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаСкачивания,
		|	Фильмы.Фильм.Наименование + ВЫБОР
		|		КОГДА Фильмы.Фильм.ОригинальноеНазвание = """"
		|			ТОГДА """"
		|		ИНАЧЕ "" ("" + Фильмы.Фильм.ОригинальноеНазвание + "")""
		|	КОНЕЦ + ВЫБОР
		|		КОГДА Фильмы.Фильм.Формат3D
		|			ТОГДА "" 3D""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Наименование,
		|	Фильмы.Фильм.Наименование КАК КраткоеНаименование,
		|	Фильмы.Фильм КАК Фильм,
		|	Фильмы.Фильм.РазмерФайла КАК Размер,
		|	Фильмы.Фильм.ДатаВыхода КАК ДатаВыхода,
		|	Фильмы.Фильм.ЕстьВФильмотеке КАК ЕстьВФильмотеке,
		|	Фильмы.Фильм.РазмерИзображения КАК РазмерИзображения,
		|	Фильмы.Фильм.ЦифровойРелиз КАК ЦифровойРелиз,
		|	Фильмы.Фильм.ИмяФайла КАК ИмяФайла,
		|	Фильмы.Фильм.Комментарий КАК Комментарий
		|ИЗ
		|	Фильмы КАК Фильмы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДатыСкачиванияФильмов КАК ДатыСкачиванияФильмов
		|		ПО Фильмы.Фильм = ДатыСкачиванияФильмов.Фильм
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаСкачивания УБЫВ
		|ИТОГИ ПО
		|	Фильм
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Фильмы.Фильм КАК Фильм,
		|	""ЗD"" КАК Жанр,
		|	0 КАК Порядок
		|ИЗ
		|	Фильмы КАК Фильмы
		|ГДЕ
		|	Фильмы.Фильм.ИмяФайла ПОДОБНО ""%[\/]3D[\/]%""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЖанрыФильмов.Фильм,
		|	ЖанрыФильмов.Жанр,
		|	1
		|ИЗ
		|	ЖанрыФильмов КАК ЖанрыФильмов
		|
		|УПОРЯДОЧИТЬ ПО
		|	Фильм,
		|	Порядок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтраныПроизводители.Фильм КАК Фильм,
		|	СтраныПроизводители.Страна КАК Страна
		|ИЗ
		|	СтраныПроизводители КАК СтраныПроизводители
		|
		|УПОРЯДОЧИТЬ ПО
		|	Фильм,
		|	СтраныПроизводители.Страна.Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Аннотации.Владелец КАК Фильм,
		|	Аннотации.СодержаниеАннотации КАК СодержаниеАннотации
		|ИЗ
		|	Справочник.Аннотации КАК Аннотации
		|ГДЕ
		|	Аннотации.Владелец В
		|			(ВЫБРАТЬ
		|				Фильмы.Фильм
		|			ИЗ
		|				Фильмы КАК Фильмы)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Фильм";
		
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Результаты = Запрос.ВыполнитьПакет();
	
	Возврат Результаты;

КонецФункции

&НаСервере
Процедура СформироватьПечатнуюФормуНаСервере()
	
	ДлинаАннотации = Константы.ДлинаАннотации.Получить();
	
	Если ПустаяСтрока(АдресВХранилище) Тогда
		ЕстьРазмеры = Ложь;
	Иначе
		РазмерыФильмов = ПолучитьИзВременногоХранилища(АдресВХранилище);
		ЕстьРазмеры    = ТипЗнч(РазмерыФильмов) = Тип("Соответствие");
	КонецЕсли;

	ТабДокумент.Очистить();
	
	Результаты = ПолучитьПакетРезультатовНаСервереБезКонтекста(СписокФильмов.ВыгрузитьЗначения());
	
	ВыборкаФильм  = Результаты[4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаЖанры  = Результаты[5].Выбрать();
	ВыборкаСтраны = Результаты[6].Выбрать();
	ВыборкаАннотации = Результаты[7].Выбрать();
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("Фильм",	Новый ОписаниеТипов("СправочникСсылка.Фильмы"));
	ТаблицаДанных.Колонки.Добавить("Размер", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 0, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаДанных.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(250, ДопустимаяДлина.Переменная)));
	ТаблицаДанных.Колонки.Добавить("ДатаВыхода", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ТаблицаДанных.Колонки.Добавить("ДатаСкачивания", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ТаблицаДанных.Колонки.Добавить("ПараметрыЗаполнения");
	
	ПустаяДата = '00010101';
	
	Пока ВыборкаФильм.Следующий() Цикл
		
		СтруктураПоиска = Новый Структура("Фильм", ВыборкаФильм.Фильм);
		
		ПараметрыЗаполнения = Новый Структура;
		ПараметрыЗаполнения.Вставить("Наименование",	"");
		ПараметрыЗаполнения.Вставить("ДатаСкачивания",	"");
		ПараметрыЗаполнения.Вставить("ДатаВыхода",		"");
		ПараметрыЗаполнения.Вставить("ЖанрыФильмов",	"");
		ПараметрыЗаполнения.Вставить("Страны",			"");
		ПараметрыЗаполнения.Вставить("Аннотация",		"");
		
		ВыборкаСтраны.Сбросить();
		Пока ВыборкаСтраны.НайтиСледующий(СтруктураПоиска) Цикл
			
			Страна = ВыборкаСтраны.Страна;
			Если ЗначениеЗаполнено(Страна) Тогда
				ПараметрыЗаполнения.Страны = ПараметрыЗаполнения.Страны
										   + ?(ПустаяСтрока(ПараметрыЗаполнения.Страны), "", ", ")
										   + Строка(Страна);
			КонецЕсли;
			
		КонецЦикла;
		
		ВыборкаЖанры.Сбросить();
		Пока ВыборкаЖанры.НайтиСледующий(СтруктураПоиска) Цикл
			
			Жанр = ВыборкаЖанры.Жанр;
			Если ЗначениеЗаполнено(Жанр) Тогда
				ПараметрыЗаполнения.ЖанрыФильмов = ПараметрыЗаполнения.ЖанрыФильмов
												 + ?(ПустаяСтрока(ПараметрыЗаполнения.ЖанрыФильмов), "", ", ")
												 + Строка(Жанр);
			КонецЕсли;
			
		КонецЦикла;
		
		ВыборкаАннотации.Сбросить();
		Пока ВыборкаАннотации.НайтиСледующий(СтруктураПоиска) Цикл
			
			Аннотация = СокрЛП(ВыборкаАннотации.СодержаниеАннотации);
			Если НЕ ПустаяСтрока(Аннотация) Тогда
				ПараметрыЗаполнения.Аннотация = ПараметрыЗаполнения.Аннотация
												 + ?(ПустаяСтрока(ПараметрыЗаполнения.Аннотация), "", ", ")
												 + Строка(Аннотация);
			КонецЕсли;
			
		КонецЦикла;
		
		Если ДлинаАннотации > 0 И СтрДлина(ПараметрыЗаполнения.Аннотация) > ДлинаАннотации Тогда
			ПараметрыЗаполнения.Аннотация = Лев(ПараметрыЗаполнения.Аннотация, ДлинаАннотации) + "...";
		КонецЕсли;
		
		Выборка = ВыборкаФильм.Выбрать();
		
		Пока Выборка.НайтиСледующий(СтруктураПоиска) Цикл
			
			Если ПустаяСтрока(ПараметрыЗаполнения.Наименование) Тогда
				ПараметрыЗаполнения.Наименование = Выборка.Наименование;
			КонецЕсли;
			
			Если ПустаяСтрока(ПараметрыЗаполнения.ДатаСкачивания) И Выборка.ДатаСкачивания <> ПустаяДата Тогда
				ПараметрыЗаполнения.ДатаСкачивания = НСтр("ru = 'Скачан: '") + Выборка.ДатаСкачивания;
			КонецЕсли;
			
			Если ПустаяСтрока(ПараметрыЗаполнения.ДатаВыхода) Тогда
				Если ЗначениеЗаполнено(Выборка.ЦифровойРелиз) Тогда
					ПараметрыЗаполнения.ДатаВыхода = Формат(Выборка.ДатаВыхода, "ДФ=dd.MM.yyyy")
												   + " (" + Формат(Выборка.ЦифровойРелиз, "ДФ=dd.MM.yyyy") + ")";
				Иначе
					ПараметрыЗаполнения.ДатаВыхода = Формат(Выборка.ДатаВыхода, "ДФ=dd.MM.yyyy");
				КонецЕсли;
			КонецЕсли;
			
			Если НЕ ПустаяСтрока(Выборка.ИмяФайла) Тогда
				ПараметрыЗаполнения.Аннотация = ПараметрыЗаполнения.Аннотация + ?(ПустаяСтрока(ПараметрыЗаполнения.Аннотация), "", Символы.ВК + Символы.ВК)
									+ НСтр("ru = 'Имя файла: '") + Выборка.ИмяФайла;
			КонецЕсли;
			
			Если НЕ ПустаяСтрока(Выборка.Комментарий) Тогда
				ПараметрыЗаполнения.Аннотация = ПараметрыЗаполнения.Аннотация + ?(ПустаяСтрока(ПараметрыЗаполнения.Аннотация), "", Символы.ВК + Символы.ВК)
									+ НСтр("ru = 'Комментарий: '") + Выборка.Комментарий;
			КонецЕсли;
			
		КонецЦикла;
		
		НоваяСтрока = ТаблицаДанных.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.ПараметрыЗаполнения = ПараметрыЗаполнения;
		
		Если ЕстьРазмеры Тогда
			Размер = РазмерыФильмов.Получить(Выборка.Фильм);
			Если Размер <> Неопределено И Выборка.Размер <> Размер Тогда
				НоваяСтрока.Размер = Размер;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ТаблицаДанных.Сортировать(СортироватьПо + " " + ?(ПоУбыванию, "Убыв", "Возр") + ?(СортироватьПо = "Наименование", "", ", Наименование"));
	
	ПервыйЛист	= Истина;
	Макет		= Справочники.Фильмы.ПолучитьМакет("ПФ_MXL_Фильм");
	
	ВыводимыеОбласти	= Новый Массив;
	ОбластьРазделитель	= Макет.ПолучитьОбласть("ОбластьРазделитель");
	НачалоТекущейДаты	= НачалоДня(ТекущаяДатаСеанса());
	
	Для каждого СтрокаТаблицы Из ТаблицаДанных Цикл
		
		Если СтрокаТаблицы.Размер > 0 Тогда
			РазмерФайла = СтрЗаменить(НСтр("ru = 'Размер: %1 Гб'"), "%1", Формат(СтрокаТаблицы.Размер/1024/1024/1024, "ЧЦ=15; ЧДЦ=3"));
			СтрокаТаблицы.ПараметрыЗаполнения.Вставить("РазмерФайла", РазмерФайла);
		КонецЕсли;
		
		Если СтрокаТаблицы.ДатаВыхода > НачалоТекущейДаты Тогда
			СтрокаТаблицы.ПараметрыЗаполнения.Вставить("УжеВышел", НСтр("ru = 'Выходит: '"));
		Иначе
			СтрокаТаблицы.ПараметрыЗаполнения.Вставить("УжеВышел", НСтр("ru = 'Вышел: '"));
		КонецЕсли;
	
		ОбластьМакета = Макет.ПолучитьОбласть("ОбластьМакета");
		ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
		ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы.ПараметрыЗаполнения);
		
		Афиша = СтрокаТаблицы.Фильм.Афиша.Получить();
		Если ТипЗнч(Афиша) = Тип("Картинка") Тогда
			ОбластьМакета.Рисунки.Афиша.Картинка = Афиша;
			ОбластьМакета.Рисунки.Афиша.РазмерКартинки = РазмерКартинки.Пропорционально;
		КонецЕсли;
		
		ВыводимыеОбласти.Очистить();
		Если НЕ ПервыйЛист Тогда
			ВыводимыеОбласти.Добавить(ОбластьРазделитель);
		КонецЕсли;
		ВыводимыеОбласти.Добавить(ОбластьМакета);
		
		Если НЕ ТабДокумент.ПроверитьВывод(ВыводимыеОбласти) Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		Иначе
			Если НЕ ПервыйЛист Тогда
				ТабДокумент.Вывести(ОбластьРазделитель);
			КонецЕсли;
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		ПервыйЛист = Ложь;
	
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияКонструктораЗапроса(ТекстЗапроса, ДополнительныеПараметры) Экспорт

	Если ТекстЗапроса = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(ТекстЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьСписокФильмовПроизвольнымЗапросомНаСервере(ТекстЗапроса);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокФильмовПроизвольнымЗапросомНаСервере(ТекстЗапроса)
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Попытка
		Результат = Запрос.Выполнить();
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Ошибка выполнения запроса; по причине:'" + ОписаниеОшибки());
		Сообщение.Сообщить();
		Возврат;
	КонецПопытки;

	Если Результат.Колонки.Найти("Фильм") = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'В результате запроса отсутствует колонка <Фильм>.'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокФильмов.Добавить(Выборка.Фильм);
	КонецЦикла;

КонецПроцедуры // ЗаполнитьСписокФильмовПроизвольнымЗапросомНаСервере()

&НаКлиенте
Процедура ПослеВыбораКаталога(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт

	Каталог = "";
	
	Если ТипЗнч(ВыбранныеФайлы) = Тип("Массив") И ВыбранныеФайлы.Количество() > 0 Тогда
		Каталог = ВыбранныеФайлы.Получить(0);
	КонецЕсли;
	
	Если ПустаяСтрока(Каталог) Тогда
		Возврат;
	КонецЕсли;
	
	Если СписокФильмов.Количество() = 0 Тогда
		НайтиФайлыВКаталоге(Каталог);
	Иначе
		ДополнительныеПараметры = Новый Структура("Каталог", Каталог);
		ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, ДополнительныеПараметры);
		ТекстВопроса = НСтр("ru = 'Список не пустой! Очистить?'");
		ПоказатьВопрос(ОписаниеОповещенияОЗавершении, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Нет, , КодВозвратаДиалога.Нет);
	КонецЕсли;
	
КонецПроцедуры // ПослеВыбораКаталога()

&НаКлиенте
Процедура ПослеВыбораКаталогаВыводаВHTML(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт

	Каталог = "";
	
	Если ТипЗнч(ВыбранныеФайлы) = Тип("Массив") И ВыбранныеФайлы.Количество() > 0 Тогда
		Каталог = ВыбранныеФайлы.Получить(0);
	КонецЕсли;
	
	Если ПустаяСтрока(Каталог) Тогда
		Возврат;
	КонецЕсли;
	
	РазделительПути = ПолучитьРазделительПути();
	Если НЕ СтрЗаканчиваетсяНа(Каталог, РазделительПути) Тогда
		Каталог = Каталог + РазделительПути;
	КонецЕсли;
	
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") И ДополнительныеПараметры.Свойство("СпискомВHTML") Тогда
		
		ВывестиСпискомВHTMLНаКлиенте(Каталог, РазделительПути);
		
	Иначе
		
		АдресВХранилище = ПолучитьСформированныеФайлыНаСервере(РазделительПути);
		СоответствиеФайлов = ПолучитьИзВременногоХранилища(АдресВХранилище);
		
		Для каждого КлючИЗначение Из СоответствиеФайлов Цикл
			
			ИмяФайла	= КлючИЗначение.Ключ;
			ДанныеФайла = КлючИЗначение.Значение;
			
			Если СтрЗаканчиваетсяНа(ИмяФайла, ".html") Тогда
				ПолноеИмя     = Каталог + ИмяФайла;
				ДопПараметры  = Новый Структура("Каталог, ИмяФайла, ПолноеИмя", Каталог, ИмяФайла, ПолноеИмя);
				мПотокВПамяти = Новый ПотокВПамяти();
				ЗаписьВПамяти = Новый ЗаписьДанных(мПотокВПамяти, КодировкаТекста.UTF8, , , , Ложь); // Не записывать метку порядка байтов (BOM)
				ДопПараметры.Вставить("ЗаписьВПамяти", ЗаписьВПамяти);
				ДопПараметры.Вставить("мПотокВПамяти", мПотокВПамяти);
				ЗаписьВПамяти.НачатьЗаписьСтроки(Новый ОписаниеОповещения("ПослеЗавершенияЗаписиСтроки", ЭтотОбъект, ДопПараметры), ДанныеФайла);
			Иначе
				Описание = Новый ОписаниеОповещения( , , ИмяФайла, "ПриВозникновенииОшибкиЗаписиФайла", ЭтотОбъект);
				СохраняемыйФайл = Base64Значение(ДанныеФайла);
				СохраняемыйФайл.НачатьЗапись(Описание, Каталог + ИмяФайла);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	#Если Не ВебКлиент И НЕ МобильныйКлиент Тогда
		ПанельЗадачОС.Сигнализировать(3);
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ПриВозникновенииОшибкиЗаписиФайла(ИнфОбОшибке, СтандартнаяОбработка, ИмяФайла) Экспорт

	СтандартнаяОбработка = Ложь;
	ПричинаДаннойОшибки = ?(ПустаяСтрока(ИнфОбОшибке.Описание), ИнфОбОшибке.Причина.Описание, ИнфОбОшибке.Описание);
	
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = СтрШаблон(НСтр("ru = 'Ошибка записи файла %1; по причине: %2.'"), ИмяФайла, ПричинаДаннойОшибки);
	Сообщение.Сообщить();

КонецПроцедуры // ПриВозникновенииОшибкиЗаписиФайла()

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		СписокФильмов.Очистить();
	КонецЕсли;
	
	НайтиФайлыВКаталоге(ДополнительныеПараметры.Каталог);

КонецПроцедуры // ПослеЗакрытияВопроса()

&НаКлиенте
Процедура НайтиФайлыВКаталоге(Каталог)

	ОпОповещения = Новый ОписаниеОповещения("НайтиФайлыВКаталогеЗавершение", ЭтотОбъект);

	НачатьПоискФайлов(ОпОповещения, Каталог, "*.*", Истина);

КонецПроцедуры

&НаКлиенте
Процедура НайтиФайлыВКаталогеЗавершение(НайденныеФайлы, ДополнительныеПараметры) Экспорт
	
	УдалитьЛишниеЭлементыИзМассиваФайлов(НайденныеФайлы);
	
	ИменаФайлов		= Новый Соответствие;
	РазмерыФайлов	= Новый Соответствие;
	
	МаксИндекс	= НайденныеФайлы.ВГраница();
	Индекс		= 0;
	
	Пока МаксИндекс >= Индекс Цикл
		
		ТекущийФайл  = НайденныеФайлы.Получить(Индекс);
		ДопПараметры = Новый Структура("ТекущийФайл, ИмяФайла, ПолноеИмяФайла, ИменаФайлов, РазмерыФайлов, РасширениеФайла",
										ТекущийФайл, ТекущийФайл.Имя, ТекущийФайл.ПолноеИмя, ИменаФайлов, РазмерыФайлов, ТекущийФайл.Расширение);
		ОпОповещения = Новый ОписаниеОповещения("ПроверкаЭтоФайлПослеЗавершения", ЭтотОбъект, ДопПараметры);
		
		ТекущийФайл.НачатьПроверкуЭтоФайл(ОпОповещения);
		
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
КонецПроцедуры // НайтиФайлыВКаталоге()

&НаКлиенте
Процедура ПроверкаЭтоФайлПослеЗавершения(ЭтоФайл, ДополнительныеПараметры) Экспорт

	Если ЭтоФайл Тогда
		
		РасширениеФайла	= ВРег(ДополнительныеПараметры.РасширениеФайла);
		
		Если РасширенияФайловКатегорииВидео.НайтиПоЗначению(РасширениеФайла) <> Неопределено И СтрНайти(ДополнительныеПараметры.ПолноеИмяФайла, "\1C\") = 0 Тогда
		
			ДополнительныеПараметры.ИменаФайлов.Вставить(ДополнительныеПараметры.ИмяФайла, ДополнительныеПараметры.ПолноеИмяФайла);
			
			ТекущийФайл  = ДополнительныеПараметры.ТекущийФайл;
			ОпОповещения = Новый ОписаниеОповещения("ПолучениеРазмераПослеОкончания", ЭтотОбъект, ДополнительныеПараметры);
			ТекущийФайл.НачатьПолучениеРазмера(ОпОповещения);
			
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры // ПослеПроверкиФайловогоОбъекта()

&НаКлиенте
Процедура ПолучениеРазмераПослеОкончания(РазмерФайла, ДополнительныеПараметры) Экспорт

	ДополнительныеПараметры.РазмерыФайлов.Вставить(ДополнительныеПараметры.ИмяФайла, РазмерФайла);
	
	Если ДополнительныеПараметры.ИменаФайлов.Количество() = ДополнительныеПараметры.РазмерыФайлов.Количество() Тогда
		ЗаполнитьСписокФильмовНаСервере(ДополнительныеПараметры.ИменаФайлов, ДополнительныеПараметры.РазмерыФайлов);
	КонецЕсли;
	
	#Если Не ВебКлиент И НЕ МобильныйКлиент Тогда
		ПанельЗадачОС.Сигнализировать(3);
	#КонецЕсли

КонецПроцедуры // ПолучениеРазмераПослеОкончания()

&НаСервере
Процедура ЗаполнитьСписокФильмовНаСервере(ИменаФайлов, РазмерыФайлов)
	
	РазделительПути = ПолучитьРазделительПутиКлиента();
	РазмерыФильмов	= Новый Соответствие;
	
	ТаблицаИменФайлов = Новый ТаблицаЗначений;
	ТаблицаИменФайлов.Колонки.Добавить("Фильм", Новый ОписаниеТипов("СправочникСсылка.Фильмы"));
	ТаблицаИменФайлов.Колонки.Добавить("ИмяФайла", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(255, ДопустимаяДлина.Переменная)));
	ТаблицаИменФайлов.Колонки.Добавить("ПолноеИмя", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(255, ДопустимаяДлина.Переменная)));
	ТаблицаИменФайлов.Колонки.Добавить("Размер", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 0, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаИменФайлов.Колонки.Добавить("Найден", Новый ОписаниеТипов("Булево"));
	
	Для каждого КлючИЗначение Из ИменаФайлов Цикл
		НоваяСтрока = ТаблицаИменФайлов.Добавить();
		НоваяСтрока.ИмяФайла = КлючИЗначение.Ключ;
		НоваяСтрока.ПолноеИмя = КлючИЗначение.Значение;
		НоваяСтрока.Размер = РазмерыФайлов.Получить(КлючИЗначение.Ключ);
	КонецЦикла;
	
	ТаблицаИменФайлов.Сортировать("ИмяФайла");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Фильмы.Ссылка КАК Фильм,
		|	Фильмы.ИмяФайла КАК ИмяФайла
		|ИЗ
		|	Справочник.Фильмы КАК Фильмы
		|ГДЕ
		|	НЕ Фильмы.ЭтоГруппа";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ИмяФайла = Выборка.ИмяФайла;
		
		Если ПустаяСтрока(ИмяФайла) Тогда
			Продолжить;
		КонецЕсли;
		
		НомерВхождения = СтрНайти(ИмяФайла, РазделительПути, НаправлениеПоиска.СКонца);
		
		Если НомерВхождения > 0 Тогда
			ИмяФайла = Сред(ИмяФайла, НомерВхождения + 1);
		КонецЕсли;
		
		ИскомаяСтрока = ТаблицаИменФайлов.Найти(ИмяФайла, "ИмяФайла");
		
		Если ИскомаяСтрока <> Неопределено Тогда
			СписокФильмов.Добавить(Выборка.Фильм);
			ИскомаяСтрока.Найден = Истина;
			ИскомаяСтрока.Фильм  = Выборка.Фильм;
			РазмерыФильмов.Вставить(Выборка.Фильм, ИскомаяСтрока.Размер);
			Если ПроверятьНахождениевПапке Тогда
				Если СтрНайти(ИскомаяСтрока.ПолноеИмя, Выборка.ИмяФайла) = 0 Тогда
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = СтрШаблон(НСтр("ru = 'Фильм <%1> находится в папке <%2>, а в карточке указана папка <%3>. Не ошибка ли?..'"), Выборка.Фильм, ИскомаяСтрока.ПолноеИмя, Выборка.ИмяФайла);
					Сообщение.Сообщить();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(ТаблицаИменФайлов);
	ФоновыеЗадания.Выполнить("ОбщийМодульСервер.СинхронизироватьТаблицуФильмов", МассивПараметров, Новый УникальныйИдентификатор, НСтр("ru = 'Синхронизация размеров файлов'"));
	
	ИскомыеСтроки = ТаблицаИменФайлов.НайтиСтроки(Новый Структура("Найден", Ложь));
	Сообщение	  = Новый СообщениеПользователю;
	
	Для каждого ИскомаяСтрока Из ИскомыеСтроки Цикл
		Сообщение.Текст = "В фильмотеке не найден фильм: " + ИскомаяСтрока.ПолноеИмя + "; объемом: " + ИскомаяСтрока.Размер + " байт.";
		Сообщение.Сообщить();
	КонецЦикла;
	
	АдресВХранилище = ПоместитьВоВременноеХранилище(РазмерыФильмов, УникальныйИдентификатор);
	
КонецПроцедуры // ЗаполнитьСписокФильмовНаСервере()

&НаСервере
Функция ПолучитьСформированныеФайлыНаСервере(РазделительПути)

	Результаты = ПолучитьПакетРезультатовНаСервереБезКонтекста(СписокФильмов.ВыгрузитьЗначения());
	
	ВыборкаФильм  = Результаты[4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаЖанры  = Результаты[5].Выбрать();
	ВыборкаСтраны = Результаты[6].Выбрать();
	ВыборкаАннотации = Результаты[7].Выбрать();
	СтруктураПоиска	 = Новый Структура("Фильм");
	ДокументHTML	 = "";
	ТипКартинка		 = Тип("Картинка");
	РасширениеХТМЛ		= ".html";
	СоответствиеФайлов  = Новый Соответствие;
	КоличествоФильмов   = ВыборкаФильм.Количество();
	ИндивидуальныеПапки = Новый Массив;
	СоответствиеФлагов  = Новый Соответствие;
	
	ИндивидуальныеПапки.Добавить("Hataxo");
	ИндивидуальныеПапки.Добавить("HoBoe");
	ИндивидуальныеПапки.Добавить("CEPuALbI");
	//ИндивидуальныеПапки.Добавить("Import");
	
	ТаблицаПоЖанрам = Новый ТаблицаЗначений;
	ТаблицаПоЖанрам.Колонки.Добавить("Фильм", Новый ОписаниеТипов("СправочникСсылка.Фильмы"));
	ТаблицаПоЖанрам.Колонки.Добавить("ИмяФайла", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(500, ДопустимаяДлина.Переменная)));
	ТаблицаПоЖанрам.Колонки.Добавить("ДатаВыхода", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ТаблицаПоЖанрам.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(500, ДопустимаяДлина.Переменная)));
	ТаблицаПоЖанрам.Колонки.Добавить("СтраныФильма", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(500, ДопустимаяДлина.Переменная)));
	ТаблицаПоЖанрам.Колонки.Добавить("ДатаСкачивания", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	
	СоответствиеЖанров	= Новый Соответствие;
	ПустаяДата          = '00010101';
	
	Пока ВыборкаФильм.Следующий() Цикл
		
		СтруктураПоиска.Фильм = ВыборкаФильм.Фильм;
		ЖанрыФильма		= "";
		СтраныФильма	= "";
		АннотацииФильма	= "";
		ФлагиСтран		= "";
		
		ВыборкаЖанры.Сбросить();
		ВыборкаСтраны.Сбросить();
		ВыборкаАннотации.Сбросить();
		
		СтрокаФильм = Неопределено;
		
		Пока ВыборкаЖанры.НайтиСледующий(СтруктураПоиска) Цикл
			ТекущийЖанр = СокрЛП(ВыборкаЖанры.Жанр);
			ИмяСтраницыЖанра = СоответствиеЖанров.Получить(ТекущийЖанр);
			Если ИмяСтраницыЖанра = Неопределено Тогда
				ИмяСтраницыЖанра = ТранслироватьСтроку(ТекущийЖанр, ПустаяДата) + РасширениеХТМЛ;
				СоответствиеЖанров.Вставить(ТекущийЖанр, ИмяСтраницыЖанра);
			КонецЕсли;
			СтрокаФильм = ДобавитьФильмВТаблицуЖанров(ТаблицаПоЖанрам, ТекущийЖанр, ВыборкаЖанры.Фильм);
			ТекущийЖанрСсылка = ПолучитьHTMLСсылку(ИмяСтраницыЖанра, ТекущийЖанр);
			ЖанрыФильма = ЖанрыФильма + ?(ПустаяСтрока(ЖанрыФильма), "", ", ") + ТекущийЖанрСсылка;
			// Год выхода фильма
			ТекущийГод = "year" + Формат(ВыборкаФильм.ДатаВыхода, "ДФ=гггг");
			ИмяСтраницыЖанра = СоответствиеЖанров.Получить(ТекущийГод);
			Если ИмяСтраницыЖанра = Неопределено Тогда
				ИмяСтраницыЖанра = ТекущийГод + РасширениеХТМЛ;
				СоответствиеЖанров.Вставить(ТекущийГод, ИмяСтраницыЖанра);
			КонецЕсли;
			СтрокаФильм = ДобавитьФильмВТаблицуЖанров(ТаблицаПоЖанрам, ТекущийГод, ВыборкаЖанры.Фильм);
		КонецЦикла;
		
		Пока ВыборкаСтраны.НайтиСледующий(СтруктураПоиска) Цикл
			ТекущаяСтрана = СтрЗаменить(Строка(ВыборкаСтраны.Страна), " ", "_");
			ИмяСтраницыЖанра = СоответствиеЖанров.Получить(ТекущаяСтрана);
			Если ИмяСтраницыЖанра = Неопределено Тогда
				ИмяСтраницыЖанра = ТранслироватьСтроку(ТекущаяСтрана, ПустаяДата) + РасширениеХТМЛ;
				СоответствиеЖанров.Вставить(ТекущаяСтрана, ИмяСтраницыЖанра);
			КонецЕсли;
			СтрокаФильм = ДобавитьФильмВТаблицуЖанров(ТаблицаПоЖанрам, ТекущаяСтрана, ВыборкаСтраны.Фильм);
			ТекущаяСтрана = ПолучитьHTMLСсылку(ИмяСтраницыЖанра, ТекущаяСтрана);
			СтраныФильма = СтраныФильма + ?(ПустаяСтрока(СтраныФильма), "", ", ") + ТекущаяСтрана;
			ДобавитьФлагСтраны(ВыборкаСтраны.Страна, ФлагиСтран, ТипКартинка, СоответствиеФлагов);
		КонецЦикла;
		
		Пока ВыборкаАннотации.НайтиСледующий(СтруктураПоиска) Цикл
			АннотацииФильма = АннотацииФильма + ?(ПустаяСтрока(АннотацииФильма), "", ", ") + СокрЛП(ВыборкаАннотации.СодержаниеАннотации);
		КонецЦикла;
		
		Выборка = ВыборкаФильм.Выбрать();
		Выборка.Следующий();
		
		Для каждого ИндивидуальнаяПапка Из ИндивидуальныеПапки Цикл
			Если СтрНайти(НРег(Выборка.ИмяФайла), НРег(ИндивидуальнаяПапка)) > 0 Тогда
				Если СоответствиеЖанров.Получить(ИндивидуальнаяПапка) = Неопределено Тогда
					СоответствиеЖанров.Вставить(ИндивидуальнаяПапка, НРег(ИндивидуальнаяПапка) + РасширениеХТМЛ);
				КонецЕсли;
				ДобавитьФильмВТаблицуЖанров(ТаблицаПоЖанрам, ИндивидуальнаяПапка, Выборка.Фильм);
			КонецЕсли;
		КонецЦикла;
		
		СсылкаНаФайл = ДобавитьПодробноеОписаниеФильма(СоответствиеФайлов, Выборка, ЖанрыФильма, СтраныФильма, АннотацииФильма, ФлагиСтран, Ложь);
		СсылкаНаГод  = СтрШаблон("year%1%2", Формат(Выборка.ДатаВыхода, "ДФ=гггг"), ".html");
		
		ДокументHTML = ДокументHTML + "<tr>" + Символы.ПС;

		ДокументHTML = ДокументHTML + "<td>" + Формат(КоличествоФильмов, "ЧГ=0") + ".</td>";
		ДокументHTML = ДокументHTML + "<td>" + ПолучитьHTMLСсылку(СсылкаНаФайл, Выборка.Наименование) + "</td>";
		ДокументHTML = ДокументHTML + "<td>" + ПолучитьHTMLСсылку(СсылкаНаГод, Формат(Выборка.ДатаВыхода, "ДФ=dd.MM.yyyy")) + "</td>";
		ДокументHTML = ДокументHTML + "<td>" + ЖанрыФильма + "</td>";
		ДокументHTML = ДокументHTML + "<td>" + СтрЗаменить(СтраныФильма, "_", " ") + "</td>";
		ДокументHTML = ДокументHTML + "<td>" + Формат(Выборка.ДатаСкачивания, "ДФ='dd.MM.yyyy HH:mm:ss'") + "</td>";
		
		ДокументHTML = ДокументHTML + "</tr>" + Символы.ПС;
		
		Если СтрокаФильм <> Неопределено Тогда
			СтрокаФильм.Фильм           = ВыборкаФильм.Фильм;
			СтрокаФильм.ИмяФайла		= СсылкаНаФайл;
			СтрокаФильм.ДатаВыхода		= Выборка.ДатаВыхода;
			СтрокаФильм.Наименование	= Выборка.Наименование;
			СтрокаФильм.СтраныФильма	= СтраныФильма;
			СтрокаФильм.ДатаСкачивания	= Выборка.ДатаСкачивания;
		КонецЕсли;
		
		КоличествоФильмов = КоличествоФильмов - 1;
		
	КонецЦикла;
	
	ШапкаДокумента =
		"<!DOCTYPE html>
		|<head>
		|<meta http-equiv=""Content-Type"" content=""text/html; charset=utf-8"">
		|<style>
		| table {border-collapse: collapse;}
		| table, th, td {border: 1px solid black;}
		|</style>
		|<title>%PageTitle%</title>
		|</head>
		|<body>
		|<h1>%PageTitle% %Picture%</h1>
		|<!-- Статистика -->
		|<!-- Нужно скачать -->
		|<!-- Сейчас в кино -->
		|<!-- Рейтинг IMDb -->
		|<!-- Индивидуальные папки -->
		|<table>
		|<tr>
		|<td>Номер<br>П/П</td>
		|<td>Фильм</td>
		|<td>Дата выхода</td>
		|<td>Жанры</td>
		|<td>Страны</td>
		|<td>Скачан</td>
		|</tr>
		|";
	
	ПодвалДокумента =
		"</table>
		|<!-- На главную -->
		|</body>
		|</html>";
	
	ДобавитьФайлыПоЖанрам(ТаблицаПоЖанрам, СоответствиеФайлов, СоответствиеЖанров, ШапкаДокумента, ПодвалДокумента, ИндивидуальныеПапки);
	
	ШапкаДокумента = СтрЗаменить(ШапкаДокумента, "%Picture%", Символы.ПС + ПолучитьКодHTMLИзображения(БиблиотекаКартинок.Фильмотека48));
	ФильмыДляСкачивания = ЕстьФильмыДляСкачиванияНаСервере(СоответствиеФайлов, ШапкаДокумента, ПодвалДокумента, СоответствиеФлагов);
	СейчасВКино = ЗаполнитьСейчасВКиноНаСервере(СоответствиеФайлов, ШапкаДокумента, ПодвалДокумента, СоответствиеФлагов);
	
	ЗаполнитьСтатистикуНаСервере(РазделительПути, СоответствиеФайлов);
	
	Если ФильмыДляСкачивания Тогда
		ШапкаДокумента = СтрЗаменить(ШапкаДокумента, "<!-- Нужно скачать -->", ПолучитьHTMLСсылку("downloads.html", ПолучитьКодHTMLИзображения(БиблиотекаКартинок.СохранитьФайл) + " Планируется скачать..."));
	КонецЕсли;
	
	Если СейчасВКино Тогда
		ШапкаДокумента = СтрЗаменить(ШапкаДокумента, "<!-- Сейчас в кино -->", ПолучитьHTMLСсылку("currently.html", ПолучитьКодHTMLИзображения(БиблиотекаКартинок.ЖурналРегистрации) + " Сейчас в кино"));
	КонецЕсли;
	
	ШапкаДокумента = СтрЗаменить(ШапкаДокумента, "<!-- Статистика -->", ПолучитьHTMLСсылку("statistics.html", ПолучитьКодHTMLИзображения(БиблиотекаКартинок.Диаграмма) + " Статистика по фильмам"));
	ШапкаДокумента = СтрЗаменить(ШапкаДокумента, "%PageTitle%", НСтр("ru = 'Список фильмов по состоянию на '") + ТекущаяДата());
	
	ЗаполнитьРейтингIMDbНаСервере(ШапкаДокумента, СоответствиеФайлов);
	
	СсылкаНаПапки  = "";
	Для каждого ИндивидуальнаяПапка Из ИндивидуальныеПапки Цикл
		Если ТаблицаПоЖанрам.Колонки.Найти(ИндивидуальнаяПапка) <> Неопределено Тогда
			Если ТаблицаПоЖанрам.НайтиСтроки(Новый Структура(ИндивидуальнаяПапка, Истина)).Количество() > 0 Тогда
				ПредставлениеДокумента = СтрШаблон(НСтр("ru = '%1 Содержимое папки ''''%2''''. '"), ПолучитьКодHTMLИзображения(БиблиотекаКартинок.ОткрытьФайл), ИндивидуальнаяПапка);
				СсылкаНаПапки = СсылкаНаПапки + ПолучитьHTMLСсылку(СоответствиеЖанров.Получить(ИндивидуальнаяПапка), ПредставлениеДокумента);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ПустаяСтрока(СсылкаНаПапки) Тогда
		ШапкаДокумента = СтрЗаменить(ШапкаДокумента, "<!-- Индивидуальные папки -->", "<hr>" + СсылкаНаПапки + "<hr>");
	КонецЕсли;
	
	ДокументHTML = ШапкаДокумента + ДокументHTML + ПодвалДокумента;
	
	СоответствиеФайлов.Вставить("index.html", ДокументHTML);
	
	АдресВХранилище = ПоместитьВоВременноеХранилище(СоответствиеФайлов, ЭтотОбъект.УникальныйИдентификатор);
	
	Возврат АдресВХранилище;

КонецФункции // ПолучитьСформированныеФайлыНаСервере()

&НаСервереБезКонтекста
Функция ДобавитьФильмВТаблицуЖанров(ТаблицаПоЖанрам, ИмяСтраницыЖанра, ТекФильм)
	
	Если ТаблицаПоЖанрам.Колонки.Найти(ИмяСтраницыЖанра) = Неопределено Тогда
		ТаблицаПоЖанрам.Колонки.Добавить(ИмяСтраницыЖанра, Новый ОписаниеТипов("Булево"));
	КонецЕсли;
	
	ИскомаяСтрока = ТаблицаПоЖанрам.Найти(ТекФильм, "Фильм");
	Если ИскомаяСтрока = Неопределено Тогда
		ИскомаяСтрока = ТаблицаПоЖанрам.Добавить();
		ИскомаяСтрока.Фильм = ТекФильм;
	КонецЕсли;
	
	ИскомаяСтрока[ИмяСтраницыЖанра] = Истина;

	Возврат ИскомаяСтрока;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ДобавитьФайлыПоЖанрам(ТаблицаПоЖанрам, СоответствиеФайлов, СоответствиеЖанров, мШапкаДокумента, мПодвалДокумента, ИндивидуальныеПапки)
	
	ИндексНачальнойКолонки = 6;
	ИндексПоследнейКолонки = ТаблицаПоЖанрам.Колонки.Количество()-1;
	СтранаРоссия = Строка(Справочники.Страны.Россия);
	
	ПодвалДокумента = СтрЗаменить(мПодвалДокумента, "<!-- На главную -->", "<p>"
					+ ПолучитьHTMLСсылку("index.html", ПолучитьКодHTMLИзображения(БиблиотекаКартинок.СтандартнаяНастройкаКомпоновкиДанных) + НСтр("ru = ' На главную...'")) + "</p>");
	
	Для ИндексТекущейКолонки = ИндексНачальнойКолонки По ИндексПоследнейКолонки Цикл
		
		ТекущаяКолонка   = ТаблицаПоЖанрам.Колонки.Получить(ИндексТекущейКолонки);
		ИмяКолонки       = ТекущаяКолонка.Имя;
		ИмяСтраницыЖанра = СоответствиеЖанров.Получить(ИмяКолонки);
		
		Если ИндивидуальныеПапки.Найти(ИмяКолонки) <> Неопределено Тогда
			ЭтоИндивидуальнаяПапка = Истина;
		Иначе
			ЭтоИндивидуальнаяПапка = Ложь;
		КонецЕсли;
		
		СтранаСсылка   = Справочники.Страны.НайтиПоНаименованию(СтрЗаменить(ИмяКолонки, "_", " "));
		ШапкаДокумента = мШапкаДокумента;
		Если НЕ СтранаСсылка.Пустая() Тогда
			ШапкаДокумента = СтрЗаменить(ШапкаДокумента, "%Picture%", Символы.ПС + ПолучитьКодHTMLИзображения(СтранаСсылка.Флаг.Получить()));
			СтраницаЖанра  = СтрЗаменить(ШапкаДокумента, "%PageTitle%", НСтр("ru = 'Страна: '") + СтрЗаменить(ИмяКолонки, "_", " "));
		ИначеЕсли ЭтоИндивидуальнаяПапка Тогда
			ШапкаДокумента = СтрЗаменить(ШапкаДокумента, "%Picture%", Символы.ПС + ПолучитьКодHTMLИзображения(БиблиотекаКартинок.Фильмотека48));
			СтраницаЖанра  = СтрЗаменить(ШапкаДокумента, "%PageTitle%", СтрШаблон(НСтр("ru = 'Содержимое папки ''''%1''''. '"), ИмяКолонки));
		ИначеЕсли СтрНайти(ВРег(ИмяКолонки), "YEAR") > 0 Тогда
			ШапкаДокумента = СтрЗаменить(ШапкаДокумента, "%Picture%", Символы.ПС + ПолучитьКодHTMLИзображения(БиблиотекаКартинок.УчетВремени48));
			СтраницаЖанра  = СтрЗаменить(ШапкаДокумента, "%PageTitle%", СтрШаблон(НСтр("ru = 'Год: %1'"), СтрЗаменить(ИмяКолонки, "year", "")));
		Иначе
			ШапкаДокумента = СтрЗаменить(ШапкаДокумента, "%Picture%", Символы.ПС + ПолучитьКодHTMLИзображения(БиблиотекаКартинок.Фильмотека48));
			СтраницаЖанра  = СтрЗаменить(ШапкаДокумента, "%PageTitle%", НСтр("ru = 'Жанр: '") + ИмяКолонки);
		КонецЕсли;
		
		ИскомыеСтроки = ТаблицаПоЖанрам.НайтиСтроки(Новый Структура(ИмяКолонки, Истина));
		ЖанрДобавлен  = Ложь;
		
		КоличествоФильмов = ИскомыеСтроки.Количество();
		
		Для каждого НайденнаяСтрока Из ИскомыеСтроки Цикл
			
			ЖанрыФильма = "";
			
			НайденнаяСтрока = ТаблицаПоЖанрам.Найти(НайденнаяСтрока.Фильм, "Фильм");
			Для каждого КлючИЗначение Из СоответствиеЖанров Цикл
				
				Если СтрНайти(ВРег(КлючИЗначение.Ключ), "YEAR") > 0 Тогда
					Продолжить;
				КонецЕсли;
				
				Если НЕ Справочники.Страны.НайтиПоНаименованию(СтрЗаменить(КлючИЗначение.Ключ, "_", " ")).Пустая() Тогда
					Продолжить;
				КонецЕсли;
				
				Если ИндивидуальныеПапки.Найти(КлючИЗначение.Ключ) <> Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				Если НайденнаяСтрока[КлючИЗначение.Ключ] Тогда
					ЖанрыФильма = ЖанрыФильма + ?(ПустаяСтрока(ЖанрыФильма), "", ", ") + ПолучитьHTMLСсылку(КлючИЗначение.Значение, КлючИЗначение.Ключ);
				КонецЕсли;			
				
			КонецЦикла;
			
			СсылкаНаГод   = СтрШаблон("year%1%2", Формат(НайденнаяСтрока.ДатаВыхода, "ДФ=гггг"), ".html");
			СтраницаЖанра = СтраницаЖанра + "<tr><td>" + Формат(КоличествоФильмов, "ЧГ=0") + ".</td><td>"
						  + ПолучитьHTMLСсылку(НайденнаяСтрока.ИмяФайла, НайденнаяСтрока.Наименование)
						  + "</td><td>" + ПолучитьHTMLСсылку(СсылкаНаГод, Формат(НайденнаяСтрока.ДатаВыхода, "ДФ=dd.MM.yyyy"))
						  + "</td><td>" + ЖанрыФильма + "</td><td>" + СтрЗаменить(НайденнаяСтрока.СтраныФильма, "_", " ") + "</td>"
						  + "<td>" + Формат(НайденнаяСтрока.ДатаСкачивания, "ДФ='dd.MM.yyyy HH:mm:ss'") + "</td></tr>" + Символы.ПС;
			ЖанрДобавлен = Истина;
			
			КоличествоФильмов = КоличествоФильмов - 1;
			
		КонецЦикла;
		
		Если ЖанрДобавлен Тогда
			СоответствиеФайлов.Вставить(ИмяСтраницыЖанра, СтраницаЖанра + ПодвалДокумента);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьФильмыДляСкачиванияНаСервере(СоответствиеФайлов, ШапкаДокумента, ПодвалДокумента, СоответствиеФлагов)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Фильмы.Ссылка КАК Ссылка,
		|	Фильмы.ДатаВыхода КАК ДатаВыхода,
		|	Фильмы.Наименование КАК Наименование,
		|	Фильмы.ОригинальноеНазвание КАК ОригинальноеНазвание,
		|	Фильмы.Формат3D КАК Формат3D,
		|	Фильмы.Комментарий КАК Комментарий,
		|	Фильмы.ЦифровойРелиз КАК ЦифровойРелиз
		|ПОМЕСТИТЬ Фильмы
		|ИЗ
		|	Справочник.Фильмы КАК Фильмы
		|ГДЕ
		|	Фильмы.НужноСкачать = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЖанрыФильмов.Фильм КАК Фильм,
		|	ПРЕДСТАВЛЕНИЕ(ЖанрыФильмов.Жанр) КАК Жанр
		|ИЗ
		|	РегистрСведений.ЖанрыФильмов КАК ЖанрыФильмов
		|ГДЕ
		|	ЖанрыФильмов.Фильм В
		|			(ВЫБРАТЬ
		|				Фильмы.Ссылка КАК Фильм
		|			ИЗ
		|				Фильмы)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Фильм
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтраныПроизводители.Фильм КАК Фильм,
		|	СтраныПроизводители.Страна КАК Страна
		|ИЗ
		|	РегистрСведений.СтраныПроизводители КАК СтраныПроизводители
		|ГДЕ
		|	СтраныПроизводители.Фильм В
		|			(ВЫБРАТЬ
		|				Фильмы.Ссылка КАК Фильм
		|			ИЗ
		|				Фильмы)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Фильм
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Аннотации.Владелец КАК Фильм,
		|	Аннотации.СодержаниеАннотации КАК СодержаниеАннотации
		|ИЗ
		|	Справочник.Аннотации КАК Аннотации
		|ГДЕ
		|	Аннотации.Владелец В
		|			(ВЫБРАТЬ
		|				Фильмы.Ссылка КАК Фильм
		|			ИЗ
		|				Фильмы)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Фильм
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Фильмы.Наименование КАК КраткоеНаименование,
		|	Фильмы.Наименование + ВЫБОР
		|		КОГДА Фильмы.ОригинальноеНазвание = """"
		|			ТОГДА """"
		|		ИНАЧЕ "" ("" + Фильмы.ОригинальноеНазвание + "")""
		|	КОНЕЦ + ВЫБОР
		|		КОГДА Фильмы.Формат3D
		|			ТОГДА "" 3D""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Наименование,
		|	Фильмы.ДатаВыхода КАК ДатаВыхода,
		|	Фильмы.Ссылка КАК Фильм,
		|	Фильмы.Комментарий КАК Комментарий,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаСкачивания,
		|	Фильмы.ЦифровойРелиз КАК ЦифровойРелиз,
		|	0 КАК Размер,
		|	"""" КАК ИмяФайла
		|ИЗ
		|	Фильмы КАК Фильмы
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаВыхода,
		|	КраткоеНаименование";
	
	РезультатыЗапроса	= Запрос.ВыполнитьПакет();
	ИндексМаксимум		= РезультатыЗапроса.ВГраница();
	РезультатЗапроса	= РезультатыЗапроса.Получить(ИндексМаксимум);
	ВыборкаАннотации	= РезультатыЗапроса.Получить(ИндексМаксимум-1).Выбрать();
	ВыборкаСтраны		= РезультатыЗапроса.Получить(ИндексМаксимум-2).Выбрать();
	ВыборкаЖанры		= РезультатыЗапроса.Получить(ИндексМаксимум-3).Выбрать();
	СтруктураПоиска     = Новый Структура("Фильм");
	ДокументHTML		= СтрЗаменить(ШапкаДокумента, "%PageTitle%", НСтр("ru = 'Фильмы к скачиванию...'"));
	СоответствиеЖанров	= Новый Соответствие;
	ПустаяДата          = '00010101';
	ТипКартинка			= Тип("Картинка");

	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	КоличествоФильмов = Выборка.Количество();
	
	Пока Выборка.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, Выборка);
		
		ЖанрыФильма  = "";
		СтраныФильма = "";
		Аннотация    = "";
		ФлагиСтран   = "";
		
		ВыборкаЖанры.Сбросить();
		ВыборкаСтраны.Сбросить();
		ВыборкаАннотации.Сбросить();
		
		Пока ВыборкаЖанры.НайтиСледующий(СтруктураПоиска) Цикл
			ТекущийЖанр = СокрЛП(ВыборкаЖанры.Жанр);
			ИмяСтраницыЖанра = СоответствиеЖанров.Получить(ТекущийЖанр);
			Если ИмяСтраницыЖанра = Неопределено Тогда
				ИмяСтраницыЖанра = ТранслироватьСтроку(ТекущийЖанр, ПустаяДата) + ".html";
				СоответствиеЖанров.Вставить(ТекущийЖанр, ИмяСтраницыЖанра);
			КонецЕсли;
			ТекущийЖанрСсылка = ПолучитьHTMLСсылку(ИмяСтраницыЖанра, ТекущийЖанр);
			ЖанрыФильма = ЖанрыФильма + ?(ПустаяСтрока(ЖанрыФильма), "", ", ") + ТекущийЖанрСсылка;
		КонецЦикла;

		Пока ВыборкаСтраны.НайтиСледующий(СтруктураПоиска) Цикл
			СтраныФильма = СтраныФильма + ?(ПустаяСтрока(СтраныФильма), "", ", ") + ВыборкаСтраны.Страна;
			ДобавитьФлагСтраны(ВыборкаСтраны.Страна, ФлагиСтран, ТипКартинка, СоответствиеФлагов);
		КонецЦикла;
		
		Пока ВыборкаАннотации.НайтиСледующий(СтруктураПоиска) Цикл
			Аннотация = Аннотация + ?(ПустаяСтрока(Аннотация), "", ", ") + ВыборкаАннотации.СодержаниеАннотации;
		КонецЦикла;
		
		СсылкаНаФайл = ДобавитьПодробноеОписаниеФильма(СоответствиеФайлов, Выборка, ЖанрыФильма, СтраныФильма, Аннотация, ФлагиСтран, Ложь);
		СсылкаНаГод  = СтрШаблон("year%1%2", Формат(Выборка.ДатаВыхода, "ДФ=гггг"), ".html");
		
		ДокументHTML = ДокументHTML + "<tr><td>" + Формат(КоличествоФильмов, "ЧГ=0") + ".</td><td>"
					 + ПолучитьHTMLСсылку(СсылкаНаФайл, Выборка.Наименование) + "</td>" + "<td>"
					 + ПолучитьHTMLСсылку(СсылкаНаГод, Формат(Выборка.ДатаВыхода, "ДФ=dd.MM.yyyy")) + ?(ЗначениеЗаполнено(Выборка.ЦифровойРелиз), " / "
					 + Формат(Выборка.ЦифровойРелиз, "ДФ=dd.MM.yyyy"), "") + "</td>" + "<td>" + ЖанрыФильма + "</td>" + "<td>"
					 + СтраныФильма + "</td><td> - - - </td></tr>";
					 
		КоличествоФильмов = КоличествоФильмов - 1;
		
	КонецЦикла;

	ДокументHTML = ДокументHTML + СтрЗаменить(ПодвалДокумента, "<!-- На главную -->", "<p align=""center"">"
				 + ПолучитьHTMLСсылку("index.html", ПолучитьКодHTMLИзображения(БиблиотекаКартинок.СтандартнаяНастройкаКомпоновкиДанных) + НСтр("ru = ' На главную...'")) + "</p>");

	СоответствиеФайлов.Вставить("downloads.html", ДокументHTML);
	
	Возврат Истина;

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДиаграммуПоНастройкам(Результат, ТипДиаграммы, ТочкиТекст, ФорматнаяСтрока, СуммаИтог)

	мДиаграмма = Новый Диаграмма;
	мДиаграмма.ВидПодписей = ВидПодписейКДиаграмме.СерияЗначение;
	мДиаграмма.ТипДиаграммы = ТипДиаграммы;
	мДиаграмма.Обновление = Ложь; 
	мДиаграмма.КоличествоТочек = 1; 
	мДиаграмма.Точки[0].Текст = ТочкиТекст;
	
	Выборка = Результат.Выбрать(); 
	
	Пока Выборка.Следующий() Цикл 
		
		КоличествоСерий = мДиаграмма.Серии.Количество(); 
		мДиаграмма.КоличествоСерий = КоличествоСерий + 1;
		Если ПустаяСтрока(ФорматнаяСтрока) Тогда
			мДиаграмма.Серии[КоличествоСерий].Текст = Выборка.Серия;
		Иначе
			мДиаграмма.Серии[КоличествоСерий].Текст = Формат(Выборка.Серия, "ДФ=MMMM");
		КонецЕсли;
		
		мДиаграмма.УстановитьЗначение(0, КоличествоСерий, Выборка.Количество);
		
		СуммаИтог = СуммаИтог + ?(Выборка.Количество = Null, 0, Выборка.Количество);
		
	КонецЦикла; 
	
	мДиаграмма.Обновление = Истина;
	
	Возврат мДиаграмма;

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТаблицуНастроек()

	ТаблицаНастроек = Новый ТаблицаЗначений;
	ТаблицаНастроек.Колонки.Добавить("ТипДиаграммы");
	ТаблицаНастроек.Колонки.Добавить("ТочкиТекст", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(100, ДопустимаяДлина.Переменная)));
	ТаблицаНастроек.Колонки.Добавить("ИмяФайла", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(100, ДопустимаяДлина.Переменная)));
	ТаблицаНастроек.Колонки.Добавить("ФорматнаяСтрока", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(100, ДопустимаяДлина.Переменная)));
	
	// Скачивания за год
	НоваяСтрока = ТаблицаНастроек.Добавить();
	НоваяСтрока.ТипДиаграммы = ТипДиаграммы.ГистограммаОбъемная;
	НоваяСтрока.ТочкиТекст = НСтр("ru = 'Количество скачанных фильмов за последние три года'");
	НоваяСтрока.ИмяФайла = "download_chart.png";
	НоваяСтрока.ФорматнаяСтрока = "ДФ=MMMM";
	
	// Жанры
	НоваяСтрока = ТаблицаНастроек.Добавить();
	НоваяСтрока.ТипДиаграммы = ТипДиаграммы.КруговаяОбъемная;
	НоваяСтрока.ТочкиТекст = НСтр("ru = 'Жанры фильмов'");
	НоваяСтрока.ИмяФайла = "style_chart.png";
	
	// Страны
	НоваяСтрока = ТаблицаНастроек.Добавить();
	НоваяСтрока.ТипДиаграммы = ТипДиаграммы.КруговаяОбъемная;
	НоваяСтрока.ТочкиТекст = НСтр("ru = 'Страны фильмов'");
	НоваяСтрока.ИмяФайла = "country_chart.png";
	
	// Объемы (размеры)
	НоваяСтрока = ТаблицаНастроек.Добавить();
	НоваяСтрока.ТипДиаграммы = ТипДиаграммы.КруговаяОбъемная;
	НоваяСтрока.ТочкиТекст = НСтр("ru = 'Размеры фильмов по жанрам (Всего %1 Гб)'");
	НоваяСтрока.ИмяФайла = "filesize_chart.png";
	
	Возврат ТаблицаНастроек;

КонецФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьСтатистикуНаСервере(РазделительПути, СоответствиеФайлов)
	
	мТекущаяДата	= ТекущаяДата();
	ТаблицаНастроек	= ПолучитьТаблицуНастроек();
	HTMLДокумент    =
		"<!DOCTYPE html>
		|<head>
		|<meta http-equiv=""Content-Type"" content=""text/html; charset=utf-8"">
		|<title>Статистика по фильмам</title>
		|</head>
		|<body>
		|<!--0-->
		|<!--1-->
		|<!--2-->
		|<!--3-->
		|<!--4-->
		|<!--5-->
		|<p><a href=""index.html"">%Picture% На главную</a></p>
		|</body>
		|</html>";
	
	HTMLДокумент = СтрЗаменить(HTMLДокумент, "%Picture%", ПолучитьКодHTMLИзображения(БиблиотекаКартинок.СтандартнаяНастройкаКомпоновкиДанных));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Данные.ДатаСкачивания КАК Серия,
		|	СУММА(Данные.Количество) КАК Количество
		|ИЗ
		|	(ВЫБРАТЬ
		|		НАЧАЛОПЕРИОДА(ДатыСкачиванияФильмов.ДатаСкачивания, МЕСЯЦ) КАК ДатаСкачивания,
		|		ДатыСкачиванияФильмов.Фильм КАК Фильм,
		|		СУММА(1) КАК Количество
		|	ИЗ
		|		РегистрСведений.ДатыСкачиванияФильмов КАК ДатыСкачиванияФильмов
		|	ГДЕ
		|		ДатыСкачиванияФильмов.ДатаСкачивания МЕЖДУ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ТекущаяДата, МЕСЯЦ, -11), МЕСЯЦ) И КОНЕЦПЕРИОДА(&ТекущаяДата, МЕСЯЦ)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		НАЧАЛОПЕРИОДА(ДатыСкачиванияФильмов.ДатаСкачивания, МЕСЯЦ),
		|		ДатыСкачиванияФильмов.Фильм) КАК Данные
		|
		|СГРУППИРОВАТЬ ПО
		|	Данные.ДатаСкачивания
		|
		|УПОРЯДОЧИТЬ ПО
		|	Серия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПРЕДСТАВЛЕНИЕ(ЖанрыФильмов.Жанр) КАК Серия,
		|	СУММА(1) КАК Количество
		|ИЗ
		|	РегистрСведений.ЖанрыФильмов КАК ЖанрыФильмов
		|ГДЕ
		|	ЖанрыФильмов.Фильм.ЕстьВФильмотеке = ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	ПРЕДСТАВЛЕНИЕ(ЖанрыФильмов.Жанр)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""3D"",
		|	СУММА(1)
		|ИЗ
		|	Справочник.Фильмы КАК Фильмы
		|ГДЕ
		|	Фильмы.Формат3D = ИСТИНА
		|	И Фильмы.ЕстьВФильмотеке = ИСТИНА
		|	И Фильмы.ИмяФайла ПОДОБНО ""%[\/]3D[\/]%""
		|
		|УПОРЯДОЧИТЬ ПО
		|	Количество УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПРЕДСТАВЛЕНИЕ(СтраныПроизводители.Страна) КАК Серия,
		|	СУММА(1) КАК Количество
		|ИЗ
		|	РегистрСведений.СтраныПроизводители КАК СтраныПроизводители
		|ГДЕ
		|	СтраныПроизводители.Фильм.ЕстьВФильмотеке = ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	ПРЕДСТАВЛЕНИЕ(СтраныПроизводители.Страна)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Количество УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПРЕДСТАВЛЕНИЕ(РазмерыФайлов.Жанр) КАК Серия,
		|	СУММА(ВЫРАЗИТЬ(РазмерыФайлов.РазмерФайла / 1073741824 КАК ЧИСЛО(15, 3))) КАК Количество
		|ИЗ
		|	(ВЫБРАТЬ
		|		""3D"" КАК Жанр,
		|		Фильмы.РазмерФайла КАК РазмерФайла
		|	ИЗ
		|		Справочник.Фильмы КАК Фильмы
		|	ГДЕ
		|		Фильмы.ЕстьВФильмотеке = ИСТИНА
		|		И Фильмы.Формат3D = ИСТИНА
		|		И Фильмы.ИмяФайла ПОДОБНО ""%[\/]3D[\/]%""
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Жанры.Жанр,
		|		СУММА(Жанры.Фильм.РазмерФайла)
		|	ИЗ
		|		(ВЫБРАТЬ
		|			МАКСИМУМ(ЖанрыФильмов.Жанр) КАК Жанр,
		|			ЖанрыФильмов.Фильм КАК Фильм
		|		ИЗ
		|			РегистрСведений.ЖанрыФильмов КАК ЖанрыФильмов
		|		ГДЕ
		|			ЖанрыФильмов.Фильм.ЕстьВФильмотеке = ИСТИНА
		|			И НЕ ЖанрыФильмов.Фильм В
		|						(ВЫБРАТЬ
		|							Фильмы.Ссылка КАК Ссылка
		|						ИЗ
		|							Справочник.Фильмы КАК Фильмы
		|						ГДЕ
		|							Фильмы.ЕстьВФильмотеке = ИСТИНА
		|							И Фильмы.Формат3D = ИСТИНА
		|							И Фильмы.ИмяФайла ПОДОБНО ""%[\/]3D[\/]%"")
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ЖанрыФильмов.Фильм) КАК Жанры
		|	
		|	СГРУППИРОВАТЬ ПО
		|		Жанры.Жанр) КАК РазмерыФайлов
		|
		|СГРУППИРОВАТЬ ПО
		|	ПРЕДСТАВЛЕНИЕ(РазмерыФайлов.Жанр)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Количество УБЫВ";
	Запрос.УстановитьПараметр("ТекущаяДата", мТекущаяДата);
	
	Результаты = Запрос.ВыполнитьПакет();
	МаксИндекс = Результаты.ВГраница();
	
	Для ТекИндекс = 0 По МаксИндекс Цикл
		
		Результат = Результаты.Получить(ТекИндекс);
		
		Если НЕ Результат.Пустой() Тогда
			
			Настройка = ТаблицаНастроек.Получить(ТекИндекс);
			СуммаИтог = 0;
			
			Если ТекИндекс = 0 Тогда
				мКартинка = ПолучитьСтатистикуПоФильмамЗаТриГодаНаСервере();
			Иначе
				Диаграмма  = ПолучитьДиаграммуПоНастройкам(Результат, Настройка.ТипДиаграммы, Настройка.ТочкиТекст, Настройка.ФорматнаяСтрока, СуммаИтог);
				мКартинка  = Диаграмма.ПолучитьКартинку(800, 400, ФорматКартинки.PNG);
			КонецЕсли;
			
			Строка64   = Base64Строка(мКартинка.ПолучитьДвоичныеДанные());
			Расширение = НРег(мКартинка.Формат());
		
			ТекЗаголовок = ?(СтрНайти(Настройка.ТочкиТекст, "%1") > 0, СтрШаблон(Настройка.ТочкиТекст, СуммаИтог), Настройка.ТочкиТекст);
			СтрокаЗамены = "<h1>" + ТекЗаголовок + "</h1>" + Символы.ПС + СтрШаблон("<img src=""data:image/%1;base64,%2"" align=""center""/>", Расширение, Строка64);
			HTMLДокумент = СтрЗаменить(HTMLДокумент, "<!--" + ТекИндекс + "-->", СтрокаЗамены);
			
		КонецЕсли;
	
	КонецЦикла;
	
	СоответствиеФайлов.Вставить("statistics.html", HTMLДокумент);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДобавитьПодробноеОписаниеФильма(СоответствиеФайлов, Выборка, ЖанрыФильма, СтраныФильма, АннотацииФильма, ФлагиСтран, ДобавитьКнопкуОтправить)

	мНаименование = Выборка.Наименование;
	ШаблонИмениФайла = ТранслироватьСтроку(Выборка.КраткоеНаименование, Выборка.ДатаВыхода);
	ИмяФайла = ШаблонИмениФайла + ".html";
	
	ШаблонДокумента = СоответствиеФайлов.Получить(ИмяФайла);
	Если ШаблонДокумента <> Неопределено Тогда
		Возврат ИмяФайла; // уже есть
	КонецЕсли;
	
	ШаблонДокумента =
		"<!DOCTYPE html>
		|<head>
		|<meta http-equiv=""Content-Type"" content=""text/html; charset=utf-8"">
		|<title>%CinemaName%</title>
		|<style type=""text/css"">
		|table, th, td {
		|  border: 0px solid black;
		|}
		|</style>
		|</head>
		|<body>
		|<h1>%CinemaName%</h1>
		|<div>Страна: %Country% <!--CountryFlags--></div>
		|<div>Жанр: %Genre%</div>
		|<table>
		|<tr>
		|<td>%DatePremiere% %DateRelease%</td>
		|<td>%DataDownload%</td>
		|<td>%Size%</td>
		|</tr>
		|</table>
		|<table>
		|<tr>
		|<td><img src=""img/img.jpg"" width=""250"" height=""350"" alt=""Афиша""/></td>
		|<td><p>%Annotation%<p>%FileName%</td>
		|</tr>
		|</table>
		|<br>
		|<a href=""index.html"">%Picture% На главную</a>
		|<!-- Button -->
		|</body>
		|</html>";
	
	ШаблонДокумента = СтрЗаменить(ШаблонДокумента, "%Picture%", ПолучитьКодHTMLИзображения(БиблиотекаКартинок.СтандартнаяНастройкаКомпоновкиДанных));
	
	КнопкаОтправить = "
		|<form name=""input"" action=""/intranet/cgi-bin/request_for_download.pl"" method=""get"">
		|<input type=""hidden"" name=""Movie"" value=""%CinemaName% %DatePremiere% %Country%"">
		|<input type=""submit"" value=""Отправить заявку на скачивание"">
		|</form>
		|";
	
	Если ДобавитьКнопкуОтправить Тогда
		ШаблонДокумента = СтрЗаменить(ШаблонДокумента, "<!-- Button -->", КнопкаОтправить);
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(Выборка.Комментарий) Тогда
		АннотацииФильма = АннотацииФильма + "<p>" + Выборка.Комментарий;
	КонецЕсли;

	ШаблонДокумента = СтрЗаменить(ШаблонДокумента, "%CinemaName%", мНаименование);
	ШаблонДокумента = СтрЗаменить(ШаблонДокумента, "%Country%", СтраныФильма);
	ШаблонДокумента = СтрЗаменить(ШаблонДокумента, "%Genre%", ЖанрыФильма);
	
	Если НЕ ПустаяСтрока(ФлагиСтран) Тогда
		ШаблонДокумента = СтрЗаменить(ШаблонДокумента, "<!--CountryFlags-->", "<br>" + ФлагиСтран);
	КонецЕсли;
	
	СсылкаНаГод = СтрШаблон("year%1%2", Формат(Выборка.ДатаВыхода, "ДФ=гггг"), ".html");
	Если ЗначениеЗаполнено(Выборка.ДатаВыхода) Тогда
		Если Выборка.ДатаВыхода > ТекущаяДата() Тогда
			ШаблонДокумента = СтрЗаменить(ШаблонДокумента, "%DatePremiere%", НСтр("ru = 'Выходит: '") + ПолучитьHTMLСсылку(СсылкаНаГод, Формат(Выборка.ДатаВыхода, "ДФ=dd.MM.yyyy")));
		Иначе
			ШаблонДокумента = СтрЗаменить(ШаблонДокумента, "%DatePremiere%", НСтр("ru = 'Вышел: '") + ПолучитьHTMLСсылку(СсылкаНаГод, Формат(Выборка.ДатаВыхода, "ДФ=dd.MM.yyyy")));
		КонецЕсли;
	Иначе
		ШаблонДокумента = СтрЗаменить(ШаблонДокумента, "%DatePremiere%", "");
	КонецЕсли;
	Если ЗначениеЗаполнено(Выборка.ДатаСкачивания) Тогда
		ШаблонДокумента = СтрЗаменить(ШаблонДокумента, "%DataDownload%", НСтр("ru = 'Скачан: '") + Формат(Выборка.ДатаСкачивания, "ДФ='dd.MM.yyyy HH:mm:ss'"));
	Иначе
		ШаблонДокумента = СтрЗаменить(ШаблонДокумента, "%DataDownload%", "");
	КонецЕсли;
	Если ЗначениеЗаполнено(Выборка.Размер) Тогда
		ЧислоСтрокой	= ЧислоПрописью(Выборка.Размер, "Л=ru_RU;НП=Истина", "байт,байта,байтов,м,,,,,0");
		ДлинаСтроки		= СтрДлина(ЧислоСтрокой);
		Окончание		= Прав(ЧислоСтрокой, ДлинаСтроки - СтрНайти(ЧислоСтрокой, " ", НаправлениеПоиска.СКонца));
		ШаблонДокумента = СтрЗаменить(ШаблонДокумента, "%Size%", НСтр("ru = 'Размер: '") + Формат(Выборка.Размер, "ЧРГ=' '") + " " + Окончание);
	Иначе
		ШаблонДокумента = СтрЗаменить(ШаблонДокумента, "%Size%", "");
	КонецЕсли;
	ШаблонДокумента = СтрЗаменить(ШаблонДокумента, "%Annotation%", АннотацииФильма);
	Если ЗначениеЗаполнено(Выборка.ИмяФайла) Тогда
		ШаблонДокумента = СтрЗаменить(ШаблонДокумента, "%FileName%", НСтр("ru = 'Имя файла: '") + Выборка.ИмяФайла);
	Иначе
		ШаблонДокумента = СтрЗаменить(ШаблонДокумента, "%FileName%", "");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.ЦифровойРелиз) Тогда
		ЦифровойРелиз = "(" + Формат(Выборка.ЦифровойРелиз, "ДФ=dd.MM.yyyy") + ")";
	Иначе
		ЦифровойРелиз = "";
	КонецЕсли;

	ШаблонДокумента = СтрЗаменить(ШаблонДокумента, "%DateRelease%", ЦифровойРелиз);
	
	Афиша = Выборка.Фильм.Афиша.Получить();
	Если Афиша <> Неопределено Тогда
		Если ТипЗнч(Афиша) = Тип("Картинка") И Афиша.Вид <> ВидКартинки.Пустая Тогда
			Строка64 = Base64Строка(Афиша.ПолучитьДвоичныеДанные());
			Расширение = НРег(Афиша.Формат());
			ШаблонДокумента = СтрЗаменить(ШаблонДокумента, "img/img.jpg", СтрШаблон("data:image/%1;base64,%2", Расширение, Строка64));
		Иначе
			ШаблонДокумента = СтрЗаменить(ШаблонДокумента, "<img src=""img/img.jpg"" width=""250"" height=""350"" alt=""Афиша""/>", ПолучитьКодHTMLИзображения(БиблиотекаКартинок.Poster_none));
		КонецЕсли;
	Иначе
		ШаблонДокумента = СтрЗаменить(ШаблонДокумента, "<img src=""img/img.jpg"" width=""250"" height=""350"" alt=""Афиша""/>", ПолучитьКодHTMLИзображения(БиблиотекаКартинок.Poster_none));
	КонецЕсли;
	
	СоответствиеФайлов.Вставить(ИмяФайла, ШаблонДокумента);
	
	Возврат ИмяФайла;

КонецФункции // ДобавитьПодробноеОписаниеФильма()

&НаКлиентеНаСервереБезКонтекста
Функция ТранслироватьСтроку(мНаименование, ДатаВыхода)

	ВРегНаименование = ВРег(мНаименование);
	ДлинаСтр = СтрДлина(ВРегНаименование);
	НоваяСтрока = "";
	КоллекцияТранслитерации = ОбщийМодульКлиентСерверПовтИсп.ПолучитьКоллекциюТранслитерации();
	
	Для Индекс = 1 По ДлинаСтр Цикл
		
		НовыйСимвол = "";
		ТекСимвол	= Сред(ВРегНаименование, Индекс, 1);
		ТекКод		= КодСимвола(ТекСимвол);
		
		Если ТекКод >= 48 И ТекКод <= 57 Тогда // 0-9
			НовыйСимвол = ТекСимвол;
		ИначеЕсли ТекКод >= 65 И ТекКод <= 90 Тогда // A-Z
			НовыйСимвол = ТекСимвол;
		ИначеЕсли ТекКод >= 97 И ТекКод <= 122 Тогда // a-z
			НовыйСимвол = ТекСимвол;
		Иначе
			НовыйСимвол = КоллекцияТранслитерации.Получить(ТекСимвол);
			НовыйСимвол = ?(НовыйСимвол = Неопределено, "", НовыйСимвол);
		КонецЕсли;
		
		НоваяСтрока = НоваяСтрока + НовыйСимвол;

	КонецЦикла;
	
	НоваяСтрока = НРег(НоваяСтрока) + Формат(ДатаВыхода, "ДФ=yyyy-MM-dd");	
	
	Возврат НоваяСтрока;
	
КонецФункции // ТранслироватьСтроку()

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьHTMLСсылку(АдресДокумента, ПредставлениеДокумента)

	Возврат "<a href = """ + АдресДокумента + """>" + ПредставлениеДокумента + "</a>";

КонецФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьРасширенияВидеоНаСервере(Форма)

	РасширенияВидео = Форма.РасширенияФайловКатегорииВидео;
	
	РасширенияВидео.Добавить(".3G2");	// Файл мультимедиа 3GPP2
	РасширенияВидео.Добавить(".3GP");	// Файл мультимедиа 3GPP
	РасширенияВидео.Добавить(".ASF");	// Формат для потокового видео
	РасширенияВидео.Добавить(".AVI");	// Видео-файл AVI
	РасширенияВидео.Добавить(".MKV");	// Видео-файл Matroska
	РасширенияВидео.Добавить(".MOV");	// Видео-файл Apple QuickTime
	РасширенияВидео.Добавить(".MP4");	// Видео файл в формате MPEG-4
	РасширенияВидео.Добавить(".MPEG");	// Видео-файл MPEG
	РасширенияВидео.Добавить(".MPG");	// Видео-файл MPEG
	РасширенияВидео.Добавить(".RM");	// Файл Real Media
	РасширенияВидео.Добавить(".VOB");	// Видео файл DVD
	РасширенияВидео.Добавить(".WMV");	// Видео файл Windows Media

КонецПроцедуры

&НаКлиенте
Процедура УдалитьЛишниеЭлементыИзМассиваФайлов(МассивФайлов)

	ТекИндексФайла = МассивФайлов.ВГраница();
	
	Пока ТекИндексФайла >= 0 Цикл
		
		ТекущийФайл = МассивФайлов.Получить(ТекИндексФайла);
		УдалитьФайл = Ложь;
		Расширение  = ВРег(СокрЛП(ТекущийФайл.Расширение));
		
		Если ПустаяСтрока(Расширение) Тогда
			УдалитьФайл = Истина;
		КонецЕсли;
		
		Если РасширенияФайловКатегорииВидео.НайтиПоЗначению(Расширение) = Неопределено Тогда
			УдалитьФайл = Истина;
		КонецЕсли;
		
		Если СтрНайти(ТекущийФайл.ПолноеИмя, "\1C\") > 0 Тогда
			УдалитьФайл = Истина;
		КонецЕсли;
		
		Если УдалитьФайл Тогда
			МассивФайлов.Удалить(ТекИндексФайла);
		КонецЕсли;
		
		ТекИндексФайла = ТекИндексФайла - 1;
		
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаполнитьСейчасВКиноНаСервере(СоответствиеФайлов, ШапкаДокумента, ПодвалДокумента, СоответствиеФлагов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Фильмы.Наименование КАК КраткоеНаименование,
		|	Фильмы.Наименование + ВЫБОР
		|		КОГДА Фильмы.ОригинальноеНазвание = """"
		|			ТОГДА """"
		|		ИНАЧЕ "" ("" + Фильмы.ОригинальноеНазвание + "")""
		|	КОНЕЦ + ВЫБОР
		|		КОГДА Фильмы.Формат3D
		|			ТОГДА "" 3D""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Наименование,
		|	Фильмы.ДатаВыхода КАК ДатаВыхода,
		|	Фильмы.НужноСкачать КАК НужноСкачать,
		|	Фильмы.ОригинальноеНазвание КАК ОригинальноеНазвание,
		|	Фильмы.ЦифровойРелиз КАК ЦифровойРелиз,
		|	Фильмы.Ссылка КАК Ссылка,
		|	Фильмы.Формат3D КАК Формат3D,
		|	Фильмы.Комментарий КАК Комментарий,
		|	Фильмы.ЕстьВФильмотеке КАК ЕстьВФильмотеке
		|ПОМЕСТИТЬ Фильмы
		|ИЗ
		|	Справочник.Фильмы КАК Фильмы
		|ГДЕ
		|	Фильмы.ДатаВыхода МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И НЕ Фильмы.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Аннотации.Владелец КАК Фильм,
		|	Аннотации.Ссылка КАК Аннотация,
		|	Аннотации.СодержаниеАннотации КАК СодержаниеАннотации
		|ИЗ
		|	Справочник.Аннотации КАК Аннотации
		|ГДЕ
		|	Аннотации.Владелец В
		|			(ВЫБРАТЬ
		|				Фильмы.Ссылка КАК Ссылка
		|			ИЗ
		|				Фильмы КАК Фильмы)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Фильм
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЖанрыФильмов.Фильм КАК Фильм,
		|	ЖанрыФильмов.Жанр КАК Жанр,
		|	ЖанрыФильмов.Жанр.Представление КАК ЖанрПредставление
		|ИЗ
		|	РегистрСведений.ЖанрыФильмов КАК ЖанрыФильмов
		|ГДЕ
		|	ЖанрыФильмов.Фильм В
		|			(ВЫБРАТЬ
		|				Фильмы.Ссылка КАК Ссылка
		|			ИЗ
		|				Фильмы КАК Фильмы)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Фильм
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтраныПроизводители.Фильм КАК Фильм,
		|	СтраныПроизводители.Страна КАК Страна,
		|	СтраныПроизводители.Страна.Представление КАК СтранаПредставление
		|ИЗ
		|	РегистрСведений.СтраныПроизводители КАК СтраныПроизводители
		|ГДЕ
		|	СтраныПроизводители.Фильм В
		|			(ВЫБРАТЬ
		|				Фильмы.Ссылка КАК Ссылка
		|			ИЗ
		|				Фильмы КАК Фильмы)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Фильм
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Фильмы.Наименование КАК Наименование,
		|	Фильмы.КраткоеНаименование КАК КраткоеНаименование,
		|	Фильмы.ДатаВыхода КАК ДатаВыхода,
		|	Фильмы.НужноСкачать КАК НужноСкачать,
		|	Фильмы.ОригинальноеНазвание КАК ОригинальноеНазвание,
		|	Фильмы.ЦифровойРелиз КАК ЦифровойРелиз,
		|	Фильмы.Ссылка КАК Фильм,
		|	Фильмы.Формат3D КАК Формат3D,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаСкачивания,
		|	Фильмы.Комментарий КАК Комментарий,
		|	0 КАК Размер,
		|	"""" КАК ИмяФайла,
		|	Фильмы.ЕстьВФильмотеке КАК ЕстьВФильмотеке
		|ИЗ
		|	Фильмы КАК Фильмы
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаВыхода,
		|	Фильмы.Наименование";
	
	Текущая_Дата = ТекущаяДата();
	Запрос.УстановитьПараметр("ДатаНачала", НачалоНедели(НачалоНедели(Текущая_Дата)-1));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецНедели(КонецНедели(Текущая_Дата)+1));
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	СтруктураПоиска   = Новый Структура("Фильм");
	
	Результат = МассивРезультатов.Получить(4);
	Если Результат.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДокументHTML  = СтрЗаменить(ШапкаДокумента, "%PageTitle%", НСтр("ru = 'Сейчас в кино'"));
	ДокументHTML  = СтрЗаменить(ДокументHTML, "<td>Скачан</td>", "<td>Скачать</td>");
	ДокументHTML  = СтрЗаменить(ДокументHTML, "<!-- Индивидуальные папки -->", "<form action=""/intranet/cgi-bin/request_for_download.pl"">");
	ВыборкаСсылка = Результат.Выбрать();
	ВыборкаСтраны = МассивРезультатов.Получить(3).Выбрать();
	ВыборкаЖанры  = МассивРезультатов.Получить(2).Выбрать();
	ТипКартинка   = Тип("Картинка");
	ВыборкаАннотации  = МассивРезультатов.Получить(1).Выбрать();
	КоличествоФильмов = ВыборкаСсылка.Количество();

	Пока ВыборкаСсылка.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, ВыборкаСсылка);
		
		ЖанрыФильма		= "";
		СтраныФильма	= "";
		АннотацииФильма	= "";
		ФлагиСтран		= "";
		
		ВыборкаЖанры.Сбросить();
		ВыборкаСтраны.Сбросить();
		ВыборкаАннотации.Сбросить();
		
		Пока ВыборкаАннотации.НайтиСледующий(СтруктураПоиска) Цикл
			АннотацииФильма = АннотацииФильма + ?(ПустаяСтрока(АннотацииФильма), "", ", ") + СокрЛП(ВыборкаАннотации.СодержаниеАннотации);
		КонецЦикла;
		
		Пока ВыборкаСтраны.НайтиСледующий(СтруктураПоиска) Цикл
			СтраныФильма = СтраныФильма + ?(ПустаяСтрока(СтраныФильма), "", ", ") + СокрЛП(ВыборкаСтраны.СтранаПредставление);
			ДобавитьФлагСтраны(ВыборкаСтраны.Страна, ФлагиСтран, ТипКартинка, СоответствиеФлагов);
		КонецЦикла;
		
		Пока ВыборкаЖанры.НайтиСледующий(СтруктураПоиска) Цикл
			ЖанрыФильма = ЖанрыФильма + ?(ПустаяСтрока(ЖанрыФильма), "", ", ") + СокрЛП(ВыборкаЖанры.ЖанрПредставление);
		КонецЦикла;
		
		СсылкаНаФайл   = ДобавитьПодробноеОписаниеФильма(СоответствиеФайлов, ВыборкаСсылка, ЖанрыФильма, СтраныФильма, АннотацииФильма, ФлагиСтран, Истина);
		СсылкаНаФлажок = "<input type=""checkbox"" name=""Movie" + Формат(КоличествоФильмов, "ЧГ=0") + """ value=""" + ВыборкаСсылка.Наименование + " " + Формат(ВыборкаСсылка.ДатаВыхода, "ДФ=yyyy") + "; " + ЖанрыФильма + "; " + СтраныФильма + """>";
		
		ДокументHTML = ДокументHTML + "<tr><td>" + Формат(КоличествоФильмов, "ЧГ=0") + ".</td><td>"
					 + ПолучитьHTMLСсылку(СсылкаНаФайл, ВыборкаСсылка.Наименование) + "</td>" + "<td>"
					 + Формат(ВыборкаСсылка.ДатаВыхода, "ДФ=dd.MM.yyyy") + ?(ЗначениеЗаполнено(ВыборкаСсылка.ЦифровойРелиз), " / "
					 + Формат(ВыборкаСсылка.ЦифровойРелиз, "ДФ=dd.MM.yyyy"), "") + "</td>" + "<td>" + ЖанрыФильма + "</td>" + "<td>"
					 + СтраныФильма + "</td><td>" + СсылкаНаФлажок + "</td></tr>";
					 
		КоличествоФильмов = КоличествоФильмов - 1;
		
	КонецЦикла;
	
	ДокументHTML = ДокументHTML + СтрЗаменить(ПодвалДокумента, "<!-- На главную -->", "<p align=""center"">" + ПолучитьHTMLСсылку("index.html", 
					ПолучитьКодHTMLИзображения(БиблиотекаКартинок.СтандартнаяНастройкаКомпоновкиДанных) + НСтр("ru = ' На главную...'"))
					+ " <input type=""submit"" value=""Отправить заявку на скачивание""></p></form>");

	СоответствиеФайлов.Вставить("currently.html", ДокументHTML);
	
	Возврат Истина;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ДобавитьФлагСтраны(СтранаСсылка, ФлагиСтран, ТипКартинка, СоответствиеФлагов)

	ШаблонФлага = СоответствиеФлагов.Получить(СтранаСсылка);
	Если ШаблонФлага <> Неопределено Тогда
		ФлагиСтран = ФлагиСтран + Символы.ПС + ШаблонФлага;
		Возврат;
	КонецЕсли;
	
	КартинкаСФлагом = СтранаСсылка.Флаг.Получить();
	ТекущаяСтрана   = Строка(СтранаСсылка);
	
	Если ТипЗнч(КартинкаСФлагом) = ТипКартинка Тогда
		
		Строка64    = Base64Строка(КартинкаСФлагом.ПолучитьДвоичныеДанные());
		Расширение  = НРег(КартинкаСФлагом.Формат());
		ШаблонФлага = СтрШаблон("<img src=""data:image/%1;base64,%2"" alt=""%3""/>", Расширение, Строка64, ТекущаяСтрана);
		ФлагиСтран  = ФлагиСтран + Символы.ПС + ШаблонФлага; 
		
		СоответствиеФлагов.Вставить(СтранаСсылка, ШаблонФлага);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьКодHTMLИзображения(мКартинка)

	Строка64   = Base64Строка(мКартинка.ПолучитьДвоичныеДанные());
	Расширение = НРег(мКартинка.Формат());
	
	Возврат СтрШаблон("<img src=""data:image/%1;base64,%2""/>", Расширение, Строка64);

КонецФункции

&НаКлиенте
Процедура ВывестиСпискомВHTMLНаКлиенте(Каталог, РазделительПути)

	ДанныеФайла  = ПолучитьИзВременногоХранилища(ПолучитьСписокОднимФайломНаСервере());
	ИмяФайла     = "index.html";
	Каталог      = Каталог + ?(СтрЗаканчиваетсяНа(Каталог, РазделительПути), "", РазделительПути);
	ПолноеИмя    = Каталог + ИмяФайла;
	ДопПараметры = Новый Структура("Каталог, ИмяФайла, ПолноеИмя", Каталог, ИмяФайла, ПолноеИмя);
	
	мПотокВПамяти = Новый ПотокВПамяти();
	ЗаписьВПамяти = Новый ЗаписьДанных(мПотокВПамяти, КодировкаТекста.UTF8, , , , Ложь); // Не записывать метку порядка байтов (BOM)
	ДопПараметры.Вставить("ЗаписьВПамяти", ЗаписьВПамяти);
	ДопПараметры.Вставить("мПотокВПамяти", мПотокВПамяти);
	ЗаписьВПамяти.НачатьЗаписьСтроки(Новый ОписаниеОповещения("ПослеЗавершенияЗаписиСтроки", ЭтотОбъект, ДопПараметры), ДанныеФайла);

КонецПроцедуры

&НаСервере
Функция ПолучитьСписокОднимФайломНаСервере()
	
	ШаблонHTML = "
		|<h1><!--CinemaName--></h1>
		|<div>Страна: <!--Country--></div>
		|<div>Жанр: <!--Genre--></div>
		|<table>
		|<tr>
		|<td>Дата выхода: <!--DatePremiere--> Дата релиза: <!--DateRelease--></td>
		|<td>Скачан: <!--DateDownload--></td>
		|<td>Размер файла: <!--%Size%--></td>
		|</tr>
		|</table>
		|<table>
		|<tr>
		|<td><!--Poster--></td>
		|<td><p><!--Annotation--><p><!--Comment--><p><!--FileName--></td>
		|</tr>
		|</table>
		|<hr>";
	
	СтруктураЗамены = Новый Структура;
	СтруктураЗамены.Вставить("Наименование",	"<!--CinemaName-->");
	СтруктураЗамены.Вставить("Страна",			"<!--Country-->");
	СтруктураЗамены.Вставить("Жанр",			"<!--Genre-->");
	СтруктураЗамены.Вставить("ДатаВыхода",		"<!--DatePremiere-->");
	СтруктураЗамены.Вставить("ДатаРелиза",		"<!--DateRelease-->");
	СтруктураЗамены.Вставить("ДатаСкачивания",	"<!--DateDownload-->");
	СтруктураЗамены.Вставить("РазмерФайла",		"<!--%Size%-->");
	СтруктураЗамены.Вставить("Аннотация",		"<!--Annotation-->");
	СтруктураЗамены.Вставить("Комментарий",		"<!--Comment-->");
	СтруктураЗамены.Вставить("ИмяФайла",		"<!--FileName-->");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокФильмов", СписокФильмов.ВыгрузитьЗначения());
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Фильмы.Ссылка КАК Фильм,
		|	Фильмы.Наименование + ВЫБОР
		|		КОГДА Фильмы.ОригинальноеНазвание = """"
		|			ТОГДА """"
		|		ИНАЧЕ "" ("" + Фильмы.ОригинальноеНазвание + "")""
		|	КОНЕЦ + ВЫБОР
		|		КОГДА Фильмы.Формат3D
		|			ТОГДА "" 3D""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Наименование,
		|	Фильмы.ДатаВыхода КАК ДатаВыхода,
		|	ВЫБОР
		|		КОГДА Фильмы.ЦифровойРелиз = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ""---""
		|		ИНАЧЕ Фильмы.ЦифровойРелиз
		|	КОНЕЦ КАК ДатаРелиза,
		|	ЕСТЬNULL(ДатыСкачиванияФильмов.ДатаСкачивания, ""---"") КАК ДатаСкачивания,
		|	Фильмы.Афиша КАК Афиша,
		|	ВЫБОР
		|		КОГДА ДатыСкачиванияФильмов.ДатаСкачивания ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|					КОГДА Фильмы.ЦифровойРелиз = ДАТАВРЕМЯ(1, 1, 1)
		|						ТОГДА Фильмы.ДатаВыхода
		|					ИНАЧЕ Фильмы.ЦифровойРелиз
		|				КОНЕЦ
		|		ИНАЧЕ ДатыСкачиванияФильмов.ДатаСкачивания
		|	КОНЕЦ КАК ПравилоСортировки,
		|	Фильмы.РазмерФайла КАК РазмерФайла,
		|	Фильмы.ИмяФайла КАК ИмяФайла,
		|	Фильмы.Комментарий КАК Комментарий
		|ПОМЕСТИТЬ Фильмы
		|ИЗ
		|	Справочник.Фильмы КАК Фильмы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыСкачиванияФильмов КАК ДатыСкачиванияФильмов
		|		ПО Фильмы.Ссылка = ДатыСкачиванияФильмов.Фильм
		|ГДЕ
		|	НЕ Фильмы.ПометкаУдаления
		|	И Фильмы.Ссылка В(&СписокФильмов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Аннотации.Владелец КАК Фильм,
		|	ВЫРАЗИТЬ(Аннотации.СодержаниеАннотации КАК СТРОКА(999)) КАК Аннотация
		|ИЗ
		|	Справочник.Аннотации КАК Аннотации
		|ГДЕ
		|	Аннотации.Владелец В
		|			(ВЫБРАТЬ
		|				Фильмы.Фильм КАК Фильм
		|			ИЗ
		|				Фильмы КАК Фильмы)
		|	И НЕ Аннотации.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Фильм
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтраныПроизводители.Фильм КАК Фильм,
		|	СтраныПроизводители.Страна.Представление КАК Страна
		|ИЗ
		|	РегистрСведений.СтраныПроизводители КАК СтраныПроизводители
		|ГДЕ
		|	СтраныПроизводители.Фильм В
		|			(ВЫБРАТЬ
		|				Фильмы.Фильм КАК Фильм
		|			ИЗ
		|				Фильмы КАК Фильмы)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Фильм
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЖанрыФильмов.Фильм КАК Фильм,
		|	ЖанрыФильмов.Жанр.Представление КАК Жанр
		|ИЗ
		|	РегистрСведений.ЖанрыФильмов КАК ЖанрыФильмов
		|ГДЕ
		|	ЖанрыФильмов.Фильм В
		|			(ВЫБРАТЬ
		|				Фильмы.Фильм КАК Фильм
		|			ИЗ
		|				Фильмы КАК Фильмы)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Фильм
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Фильмы.Фильм КАК Фильм,
		|	Фильмы.Наименование КАК Наименование,
		|	Фильмы.ДатаВыхода КАК ДатаВыхода,
		|	Фильмы.ДатаРелиза КАК ДатаРелиза,
		|	Фильмы.ДатаСкачивания КАК ДатаСкачивания,
		|	Фильмы.Афиша КАК Афиша,
		|	Фильмы.ПравилоСортировки КАК ПравилоСортировки,
		|	Фильмы.РазмерФайла КАК РазмерФайла,
		|	Фильмы.ИмяФайла КАК ИмяФайла,
		|	Фильмы.Комментарий КАК Комментарий
		|ИЗ
		|	Фильмы КАК Фильмы
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПравилоСортировки УБЫВ";
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	НаибольшийИндекс  = РезультатыЗапроса.ВГраница();
	ВыборкаПоФильмам  = РезультатыЗапроса.Получить(НаибольшийИндекс).Выбрать();
	СтруктураПолей    = Новый Структура("Жанр, Страна, Аннотация", "", "", "");
	СтруктураПоиска   = Новый Структура("Фильм");
	ФайлHTML          = "";
	ТипКартинка       = Тип("Картинка");
	
	Пока ВыборкаПоФильмам.Следующий() Цикл
	
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, ВыборкаПоФильмам);
		ТекущийИндекс = НаибольшийИндекс;
	
		Для каждого КлючИЗначение Из СтруктураПолей Цикл
			
			ТекущийИндекс   = ТекущийИндекс - 1;
			Выборка         = РезультатыЗапроса.Получить(ТекущийИндекс).Выбрать();
			ТекЗначение		= "";
			
			СтруктураПолей[КлючИЗначение.Ключ] = ТекЗначение;
			Пока Выборка.НайтиСледующий(СтруктураПоиска) Цикл
				ТекЗначение = ТекЗначение + ?(ПустаяСтрока(ТекЗначение), "", ", ") + Выборка[КлючИЗначение.Ключ];
			КонецЦикла;
			СтруктураПолей[КлючИЗначение.Ключ] = ?(ПустаяСтрока(ТекЗначение), "---", ТекЗначение);
			 
		КонецЦикла;
		
		ЗаполняемыйШаблонHTML = ШаблонHTML;
		
		Для каждого КлючИЗначение Из СтруктураЗамены Цикл
			Если СтруктураПолей.Свойство(КлючИЗначение.Ключ) Тогда
				ЗаполняемыйШаблонHTML = СтрЗаменить(ЗаполняемыйШаблонHTML, КлючИЗначение.Значение, СтруктураПолей[КлючИЗначение.Ключ]);
			Иначе
				ЗаполняемыйШаблонHTML = СтрЗаменить(ЗаполняемыйШаблонHTML, КлючИЗначение.Значение, ВыборкаПоФильмам[КлючИЗначение.Ключ]);
			КонецЕсли;
		КонецЦикла;
			
		Афиша = ВыборкаПоФильмам.Афиша.Получить();
		Если ТипЗнч(Афиша) = ТипКартинка Тогда
			Строка64 = Base64Строка(Афиша.ПолучитьДвоичныеДанные());
			Расширение = НРег(Афиша.Формат());
			ЗаполняемыйШаблонHTML = СтрЗаменить(ЗаполняемыйШаблонHTML, "<!--Poster-->", СтрШаблон("<img src=""data:image/%1;base64,%2"" width=""250"" height=""350""/>", Расширение, Строка64));
		КонецЕсли;
		
		ФайлHTML = ФайлHTML + ЗаполняемыйШаблонHTML;

	КонецЦикла;
	
	ФайлHTML  = СтрЗаменить(ФайлHTML, " 0:00:00", "");
	ФайлHTML  = "<!DOCTYPE html>
				|<head>
				|<meta http-equiv=""Content-Type"" content=""text/html; charset=utf-8"">
				|<title>Список фильмов</title>
				|</head>
				|<body>" + ФайлHTML + "
				|</body>
				|</html>";
	
	Возврат ПоместитьВоВременноеХранилище(ФайлHTML, ЭтотОбъект.УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура ПослеЗавершенияЗаписиСтроки(ДопПараметры) Экспорт
	
	Перем ЗаписьВПамяти;
	
	Если ДопПараметры.Свойство("ЗаписьВПамяти", ЗаписьВПамяти) Тогда
		ЗаписьВПамяти.НачатьЗакрытие(Новый ОписаниеОповещения("ПослеЗавершенияОперацииЗакрытия", ЭтотОбъект, ДопПараметры));
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ПослеЗавершенияОперацииЗакрытия(ДопПараметры) Экспорт
	
	Перем мПотокВПамяти;
	
	Если ДопПараметры.Свойство("мПотокВПамяти", мПотокВПамяти) Тогда
		БинарныеДанные = мПотокВПамяти.ЗакрытьИПолучитьДвоичныеДанные();
		Описание = Новый ОписаниеОповещения( , , ДопПараметры.ИмяФайла, "ПриВозникновенииОшибкиЗаписиФайла", ЭтотОбъект);
		БинарныеДанные.НачатьЗапись(Описание, ДопПараметры.ПолноеИмя);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРейтингIMDbНаСервере(ШапкаДокумента, СоответствиеФайлов)

	ШаблонДокумента =
		"<!DOCTYPE html>
		|<head>
		|<meta http-equiv=""Content-Type"" content=""text/html; charset=utf-8"">
		|<style>
		| table {border-collapse: collapse;}
		| table, th, td {border: 1px solid black;}
		|</style>
		|<title>%PageTitle%</title>
		|</head>
		|<body>";
	ТелоДокумента = "
		|<h1>%PageTitle% %Picture%</h1>
		|<table>
		|<tr>
		|<td>Номер<br>П/П</td>
		|<td>Фильм</td>
		|<td>IMDb</td>
		|<td>Дата выхода</td>
		|<!-- Скачан -->
		|<td>Жанры</td>
		|<td>Страны</td>
		|</tr>
		|";
	
	НеСформировано    = Истина;
	ШаблонДокумента   = СтрЗаменить(ШаблонДокумента, "%PageTitle%", НСтр("ru = 'Рейтинг IMDb'"));
	ВыводимыеСтраницы = Новый Соответствие;
	ВыводимыеСтраницы.Вставить(НСтр("ru = 'Рейтинг IMDb (Скачанные)'"), Истина);
	ВыводимыеСтраницы.Вставить(НСтр("ru = 'Рейтинг IMDb (Не скачанные)'"), Ложь);
	
	Для каждого КлючИЗначение Из ВыводимыеСтраницы Цикл
		
		Если КлючИЗначение.Значение Тогда
			ТекТелоДокумента = СтрЗаменить(ТелоДокумента, "<!-- Скачан -->", "<td>Скачан</td>");
		Иначе
			ТекТелоДокумента = ТелоДокумента;
		КонецЕсли;
		
		ТаблицаIMDb = Отчеты.РейтингIMDb.ПолучитьТаблицуФильмовПоIMDb(КлючИЗначение.Значение);
		Если ТаблицаIMDb.Количество() = 0 Тогда
			Продолжить;
		Иначе
			Если НеСформировано Тогда
				НеСформировано = Ложь;
			КонецЕсли;
		КонецЕсли;
		
		ШаблонДокумента = ШаблонДокумента + ТекТелоДокумента;
		ШаблонДокумента = СтрЗаменить(ШаблонДокумента, "%PageTitle%", КлючИЗначение.Ключ);
		ШаблонДокумента = СтрЗаменить(ШаблонДокумента, "%Picture%",   Символы.ПС + ПолучитьКодHTMLИзображения(БиблиотекаКартинок.Оскар48));
		
		Для каждого СтрокаТаблицы Из ТаблицаIMDb Цикл
			
			ТекСтрока = "<tr>
						|<td>" + (ТаблицаIMDb.Индекс(СтрокаТаблицы) + 1) + ".</td>
						|<td><!-- Наименование --></td>
						|<td>" + СтрокаТаблицы.IMDb + "</td>
						|<td>" + Формат(СтрокаТаблицы.ДатаВыхода, "ДФ=dd.MM.yyyy") + "</td>
						|<!-- Скачан -->
						|<td>" + СтрокаТаблицы.Жанр + "</td>
						|<td>" + СтрокаТаблицы.Страна + "</td>
						|</tr>
						|";
			
			Если КлючИЗначение.Значение Тогда
				ИмяФайлаHTML = ТранслироватьСтроку(СтрокаТаблицы.Наименование, СтрокаТаблицы.ДатаВыхода) + ".html";
				ТекСтрока    = СтрЗаменить(ТекСтрока, "<!-- Скачан -->", "<td>" + Формат(СтрокаТаблицы.ДатаСкачивания, "ДФ=dd.MM.yyyy") + "</td>");
				ТекСтрока    = СтрЗаменить(ТекСтрока, "<!-- Наименование -->", ПолучитьHTMLСсылку(ИмяФайлаHTML, СтрокаТаблицы.НаименованиеФильма));
			Иначе
				ТекСтрока = СтрЗаменить(ТекСтрока, "<!-- Наименование -->", СтрокаТаблицы.НаименованиеФильма);
			КонецЕсли;

			ШаблонДокумента = ШаблонДокумента + ТекСтрока;
			
		КонецЦикла;
		
		ШаблонДокумента = ШаблонДокумента + "</table>";
		
	КонецЦикла;
	
	Если НеСформировано Тогда
		Возврат;
	КонецЕсли;
	
	ШаблонДокумента = ШаблонДокумента + "
		|<p><a href=""index.html"">%Picture% На главную</a></p>
		|</body>
		|</html>";
	
	ШаблонДокумента = СтрЗаменить(ШаблонДокумента, "%Picture%", ПолучитьКодHTMLИзображения(БиблиотекаКартинок.СтандартнаяНастройкаКомпоновкиДанных));
	ШапкаДокумента  = СтрЗаменить(ШапкаДокумента, "<!-- Рейтинг IMDb -->", ПолучитьHTMLСсылку("rating_imdb.html", ПолучитьКодHTMLИзображения(БиблиотекаКартинок.СортироватьСписокПоВозрастанию) + НСтр("ru = 'Рейтинг IMDb'")));
	
	СоответствиеФайлов.Вставить("rating_imdb.html", ШаблонДокумента);
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиВHTMLвАвтоматическомРежиме()
	
	ВыбранныеФайлы = Новый Массив;
	ВыбранныеФайлы.Добавить(Параметры.ПутьВыгрузки);
	ПослеВыбораКаталогаВыводаВHTML(ВыбранныеФайлы, Неопределено);
	
	ПодключитьОбработчикОжидания("ЗавершитьРаботуСистемыЧерезОбработчикОжидания", 0.1, Истина);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРаботуСистемыЧерезОбработчикОжидания() Экспорт
	
	Если НЕ ПустаяСтрока(ПараметрЗапуска) Тогда
		ЗавершитьРаботуСистемы(Ложь, Ложь);
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтатистикуПоФильмамЗаТриГодаНаСервере()

	СхемаКомпоновкиДанных = Новый СхемаКомпоновкиДанных;

	// 1. Добавляем Источник данных
	ИсточникДанных = СхемаКомпоновкиДанных.ИсточникиДанных.Добавить();
	ИсточникДанных.Имя = "ИсточникДанных1";
	ИсточникДанных.ТипИсточникаДанных = "Local";

	НаборДанныхЗапрос = СхемаКомпоновкиДанных.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанныхЗапрос.Имя = "НаборДанных1";
	НаборДанныхЗапрос.ИсточникДанных = "ИсточникДанных1";
	НаборДанныхЗапрос.Запрос =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДатыСкачиванияФильмов.Фильм) КАК КоличествоФильмов,
		|	НАЧАЛОПЕРИОДА(ДатыСкачиванияФильмов.ДатаСкачивания, МЕСЯЦ) КАК Месяц,
		|	ГОД(ДатыСкачиванияФильмов.ДатаСкачивания) КАК Год
		|ПОМЕСТИТЬ ВременнаяТаблица
		|ИЗ
		|	РегистрСведений.ДатыСкачиванияФильмов КАК ДатыСкачиванияФильмов
		|ГДЕ
		|	ДатыСкачиванияФильмов.ДатаСкачивания МЕЖДУ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, ГОД), ГОД, -2) И КОНЕЦПЕРИОДА(&ТекущаяДата, МЕСЯЦ)
		|	И ДатыСкачиванияФильмов.Фильм.ЕстьВФильмотеке
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(ДатыСкачиванияФильмов.ДатаСкачивания, МЕСЯЦ),
		|	ГОД(ДатыСкачиванияФильмов.ДатаСкачивания)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблица.КоличествоФильмов КАК КоличествоФильмов,
		|	ВЫБОР
		|		КОГДА ГОД(ВременнаяТаблица.Месяц) = ГОД(ДОБАВИТЬКДАТЕ(&ТекущаяДата, ГОД, -1))
		|			ТОГДА ДОБАВИТЬКДАТЕ(ВременнаяТаблица.Месяц, ГОД, 1)
		|		КОГДА ГОД(ВременнаяТаблица.Месяц) = ГОД(ДОБАВИТЬКДАТЕ(&ТекущаяДата, ГОД, -2))
		|			ТОГДА ДОБАВИТЬКДАТЕ(ВременнаяТаблица.Месяц, ГОД, 2)
		|		ИНАЧЕ ВременнаяТаблица.Месяц
		|	КОНЕЦ КАК Месяц,
		|	ВременнаяТаблица.Год КАК Год
		|{ВЫБРАТЬ
		|	КоличествоФильмов КАК КоличествоФильмов,
		|	Месяц КАК Месяц,
		|	Год КАК Год}
		|ИЗ
		|	ВременнаяТаблица КАК ВременнаяТаблица";

	// 2. Добавляем поля набора данных
	ПолеНабораКД = СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	ПолеНабораКД.Заголовок      = НСтр("ru = 'Год'");
	ПолеНабораКД.ПутьКДанным    = "Год";
	ПолеНабораКД.Поле           = "Год";
	ПолеНабораКД.ТипЗначения    = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(4, 0, ДопустимыйЗнак.Неотрицательный));
	ЗначениеПараметраНастроекКД = ПолеНабораКД.Оформление.Элементы.Найти("Формат");
	ЗначениеПараметраНастроекКД.Значение = "ЧЦ=4; ЧГ=0";
	ЗначениеПараметраНастроекКД.Использование = Истина;
	
	ПолеНабораКД = СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	ПолеНабораКД.Заголовок      = НСтр("ru = 'Месяц'");
	ПолеНабораКД.ПутьКДанным    = "Месяц";
	ПолеНабораКД.Поле           = "Месяц";
	ПолеНабораКД.ТипЗначения    = Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата));
	ЗначениеПараметраНастроекКД = ПолеНабораКД.Оформление.Элементы.Найти("Формат");
	ЗначениеПараметраНастроекКД.Значение = "ДФ=MMMM";
	ЗначениеПараметраНастроекКД.Использование = Истина;
	
	ПолеНабораКД = СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	ПолеНабораКД.Заголовок      = НСтр("ru = 'Количество фильмов'");
	ПолеНабораКД.ПутьКДанным    = "КоличествоФильмов";
	ПолеНабораКД.Поле           = "КоличествоФильмов";
	ПолеНабораКД.ТипЗначения    = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(4, 0, ДопустимыйЗнак.Неотрицательный));
	
	// 3. Добавляем ресурсы/итоги
	Ресурс = СхемаКомпоновкиДанных.ПоляИтога.Добавить();
	Ресурс.ПутьКДанным = "КоличествоФильмов";
	Ресурс.Выражение = "Сумма(КоличествоФильмов)";

	// 4. Устанавливаем параметры
	ЗначениеПараметраНастроекКД = СхемаКомпоновкиДанных.НастройкиПоУмолчанию.ПараметрыДанных.Элементы.Добавить();
	ЗначениеПараметраНастроекКД.Параметр = Новый ПараметрКомпоновкиДанных("ТекущаяДата");
	ЗначениеПараметраНастроекКД.Значение = ТекущаяДатаСеанса();
	ЗначениеПараметраНастроекКД.Использование = Истина;
	
	// 5. Добавляем выбранные поля
	ВыбранноеПолеКД = СхемаКомпоновкиДанных.ВариантыНастроек.Основной.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПолеКД.Поле = Новый ПолеКомпоновкиДанных("Год");
	
	ВыбранноеПолеКД = СхемаКомпоновкиДанных.ВариантыНастроек.Основной.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПолеКД.Поле = Новый ПолеКомпоновкиДанных("Месяц");
	
	ВыбранноеПолеКД = СхемаКомпоновкиДанных.ВариантыНастроек.Основной.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПолеКД.Поле = Новый ПолеКомпоновкиДанных("КоличествоФильмов");
	
	// 6. Добавляем структуру отчета
	мСтруктура = СхемаКомпоновкиДанных.ВариантыНастроек.Основной.Настройки.Структура.Добавить(Тип("ДиаграммаКомпоновкиДанных"));
	Серия = мСтруктура.Серии.Добавить();
	Серия.Имя = "Год";
	ПолеГруппировкиКД = Серия.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	ПолеГруппировкиКД.Поле = Новый ПолеКомпоновкиДанных("Год");
	Серия.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	
	Точка = мСтруктура.Точки.Добавить();
	Точка.Имя = "Месяц";
	ПолеГруппировкиКД = Точка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	ПолеГруппировкиКД.Поле = Новый ПолеКомпоновкиДанных("Месяц");
	Точка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));

 	мСтруктура.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));

	//7. Сортировка
	ЭлементПорядкаКД = СхемаКомпоновкиДанных.НастройкиПоУмолчанию.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	ЭлементПорядкаКД.Поле = Новый ПолеКомпоновкиДанных("Год");
	ЭлементПорядкаКД.Использование = Истина;
	
	ЭлементПорядкаКД = СхемаКомпоновкиДанных.НастройкиПоУмолчанию.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	ЭлементПорядкаКД.Поле = Новый ПолеКомпоновкиДанных("Месяц");
	ЭлементПорядкаКД.Использование = Истина;

	// 8. Добавляем другие настройки
	ЗначениеПараметраНастроекКД = СхемаКомпоновкиДанных.НастройкиПоУмолчанию.ПараметрыВывода.Элементы.Найти("ТипДиаграммы");
	ЗначениеПараметраНастроекКД.Значение = ТипДиаграммы.ГистограммаОбъемная;
	ЗначениеПараметраНастроекКД.Использование = Истина;
	ЗначениеВложенныхПараметровКД = ЗначениеПараметраНастроекКД.ЗначенияВложенныхПараметров.Найти("ТипДиаграммы.ПропускатьБазовоеЗначение");
	ЗначениеВложенныхПараметровКД.Использование = Истина;
	ЗначениеВложенныхПараметровКД = ЗначениеПараметраНастроекКД.ЗначенияВложенныхПараметров.Найти("ТипДиаграммы.ВидПодписей");
	ЗначениеВложенныхПараметровКД.Использование = Истина;
	ЗначениеВложенныхПараметровКД.Значение = ВидПодписейКДиаграмме.СерияЗначение;
	ЗначениеВложенныхПараметровКД = ЗначениеПараметраНастроекКД.ЗначенияВложенныхПараметров.Найти("ТипДиаграммы.СоединениеТочек");
	ЗначениеВложенныхПараметровКД.Использование = Истина;
	ЗначениеВложенныхПараметровКД.Значение = ТипСоединенияТочекДиаграммы.Соединять;
	
	// 9. Формируем настройки компоновки данных
	КомпоновщикНастроекДанныхОтчета = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроекДанныхОтчета.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	КомпоновщикНастроекДанныхОтчета.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	НастройкиКомпоновки = КомпоновщикНастроекДанныхОтчета.ПолучитьНастройки();

	// 10. Выполнение
	ДокументРезультат = Новый ТабличныйДокумент;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновки);

	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Для каждого ТекРис Из ДокументРезультат.Рисунки Цикл
		ТекКартинка = ТекРис.Объект.ПолучитьКартинку(900, 400, ФорматКартинки.PNG);
		Возврат ТекКартинка;
	КонецЦикла;
	
	Возврат Новый Картинка;

КонецФункции

#КонецОбласти
