
&НаКлиенте
Процедура ПолучитьПочту(Команда)
	
	ПрофильМаилРу = Новый ИнтернетПочтовыйПрофиль;
    ПрофильМаилРу.АдресСервераPOP3 = "pop.mail.ru";
    ПрофильМаилРу.Пользователь = "krikk.vv";
    ПрофильМаилРу.Пароль = "CzKMCyqxeV1ttyvqKfy4";
    ПрофильМаилРу.АутентификацияPOP3 = СпособPOP3Аутентификации.Обычная;

    Попытка
		
		Почта = Новый ИнтернетПочта;
        Почта.Подключиться(ПрофильМаилРу);
        
        МассивСообщений = Новый Массив;
        МассивСообщений = Почта.Выбрать(Ложь); // Ложь - письма с сервера не удаляются...
		
	Исключение
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка по причине: " + ОписаниеОшибки();
		Сообщение.Сообщить();
		
        Возврат;
		
	КонецПопытки;

    ПолученныеПисьма.Очистить();
	
	Для каждого ТекСообщание Из МассивСообщений Цикл
        стр = ПолученныеПисьма.Добавить();
        стр.ДатаОтправления = ТекСообщание.ДатаОтправления;
        стр.Заголовок = ТекСообщание.Заголовок;
        стр.КоличествоВложений = ТекСообщание.Вложения.Количество();
        стр.КоличествоТекстов = ТекСообщание.Тексты.Количество();
        стр.Размер = ТекСообщание.Размер;
        стр.Тема = ТекСообщание.Тема;
	КонецЦикла;

КонецПроцедуры
