
Функция ПолучитьКоллекциюТранслитерации() Экспорт
	
	КоллекцияТранслитерации = Новый Соответствие;
	КоллекцияТранслитерации.Вставить("А", "A");
	КоллекцияТранслитерации.Вставить("Б", "B");
	КоллекцияТранслитерации.Вставить("В", "V");
	КоллекцияТранслитерации.Вставить("Г", "G");
	КоллекцияТранслитерации.Вставить("Д", "D");
	КоллекцияТранслитерации.Вставить("Е", "E");
	КоллекцияТранслитерации.Вставить("Ё", "Yo");
	КоллекцияТранслитерации.Вставить("Ж", "G");
	КоллекцияТранслитерации.Вставить("З", "Z");
	КоллекцияТранслитерации.Вставить("И", "I");
	КоллекцияТранслитерации.Вставить("Й", "Y");
	КоллекцияТранслитерации.Вставить("К", "K");
	КоллекцияТранслитерации.Вставить("Л", "L");
	КоллекцияТранслитерации.Вставить("М", "M");
	КоллекцияТранслитерации.Вставить("Н", "N");
	КоллекцияТранслитерации.Вставить("О", "O");
	КоллекцияТранслитерации.Вставить("П", "P");
	КоллекцияТранслитерации.Вставить("Р", "R");
	КоллекцияТранслитерации.Вставить("С", "S");
	КоллекцияТранслитерации.Вставить("Т", "T");
	КоллекцияТранслитерации.Вставить("У", "U");
	КоллекцияТранслитерации.Вставить("Ф", "F");
	КоллекцияТранслитерации.Вставить("Х", "H");
	КоллекцияТранслитерации.Вставить("Ц", "C");
	КоллекцияТранслитерации.Вставить("Ч", "Ch");
	КоллекцияТранслитерации.Вставить("Ш", "Sh");
	КоллекцияТранслитерации.Вставить("Щ", "Csh");
	КоллекцияТранслитерации.Вставить("Ъ", "");
	КоллекцияТранслитерации.Вставить("Ы", "Y");
	КоллекцияТранслитерации.Вставить("Ь", "");
	КоллекцияТранслитерации.Вставить("Э", "A");
	КоллекцияТранслитерации.Вставить("Ю", "U");
	КоллекцияТранслитерации.Вставить("Я", "Ya");
	
	Возврат КоллекцияТранслитерации;
	
КонецФункции

Функция ВерсияПриложения() Экспорт
	
	СтруктураВерсииПриложения = Новый Структура("ОсновнаяВерсия, МладшаяВерсия, Релиз, ДополнительныйНомерРелиза", 0, 0, 0, 0);

	СисИнфо   = Новый СистемнаяИнформация;
	МнчСтрока = СтрЗаменить(СисИнфо.ВерсияПриложения, ".", Символы.ПС);
	
	Если СтрЧислоСтрок(МнчСтрока) >= 1 Тогда
		СтруктураВерсииПриложения.ОсновнаяВерсия = Число(СтрПолучитьСтроку(МнчСтрока, 1));
	КонецЕсли;
	
	Если СтрЧислоСтрок(МнчСтрока) >= 2 Тогда
		СтруктураВерсииПриложения.МладшаяВерсия = Число(СтрПолучитьСтроку(МнчСтрока, 2));
	КонецЕсли;
	
	Если СтрЧислоСтрок(МнчСтрока) >= 3 Тогда
		СтруктураВерсииПриложения.Релиз = Число(СтрПолучитьСтроку(МнчСтрока, 3));
	КонецЕсли;
	
	Если СтрЧислоСтрок(МнчСтрока) >= 4 Тогда
		СтруктураВерсииПриложения.ДополнительныйНомерРелиза = Число(СтрПолучитьСтроку(МнчСтрока, 4));
	КонецЕсли;
	
	СтруктураВерсииПриложения.Вставить("ВерсияПриложения", СисИнфо.ВерсияПриложения);
	
	Возврат СтруктураВерсииПриложения;
	
КонецФункции