
Процедура СохранитьНастройкуВХранилище(КлючОбъекта, КлючНастроек, Настройки, ОписаниеНастроек = Неопределено, ИмяПользователя = Неопределено) Экспорт
	
	ОбщийМодульСервер.СохранитьНастройкуВХранилище(КлючОбъекта, КлючНастроек, Настройки, ОписаниеНастроек, ИмяПользователя);
	
КонецПроцедуры

Функция ЗагрузитьНастройкуИзХранилища(КлючОбъекта, КлючНастроек, ОписаниеНастроек = Неопределено, ИмяПользователя = Неопределено) Экспорт
	
	Возврат ОбщийМодульСервер.ЗагрузитьНастройкуИзХранилища(КлючОбъекта, КлючНастроек, ОписаниеНастроек, ИмяПользователя);
	
КонецФункции

Процедура Пауза(Секунд) Экспорт
	
	ОбщийМодульСервер.Пауза(Секунд);
	
КонецПроцедуры

Процедура УдалитьФайлыНаСервере(ТекПуть, Маска) Экспорт
	
	ОбщийМодульСервер.УдалитьФайлыНаСервере(ТекПуть, Маска);
	
КонецПроцедуры

Функция ЗначениеРеквизитаОбъекта(СсылкаНаОбъект, ИмяРеквизита) Экспорт

	Возврат ОбщийМодульСервер.ЗначениеРеквизитаОбъекта(СсылкаНаОбъект, ИмяРеквизита);

КонецФункции

Функция ЗначениеКонстанты(ИмяКонстанты) Экспорт
	
	Возврат Константы[ИмяКонстанты].Получить();

КонецФункции