#Если Сервер Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьИОтправитьПогодуНаСервере(АдресОповещения = "") Экспорт
	
	ВременныйФайл = ПолучитьИмяВременногоФайла("html");

	Попытка
		Соединение	= Новый HTTPСоединение("yandex.ru", , , , , , Новый ЗащищенноеСоединениеOpenSSL());
		Соединение.Получить("/pogoda/volhov/details", ВременныйФайл);
	Исключение
		Возврат НСтр("ru = 'Ошибка запроса страницы с погодой; по причине:'") + " " + ОписаниеОшибки();
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(АдресОповещения) Тогда
		АдресОповещения = ПолучитьАдресОповещения();
		Если АдресОповещения = Неопределено Тогда
			Возврат НСтр("ru = 'Не определен адрес получателя!'");
		КонецЕсли;
	КонецЕсли;
	
	СтраницаHTML = Новый ТекстовыйДокумент;
	СтраницаHTML.Прочитать(ВременныйФайл, КодировкаТекста.UTF8);
	
	ТекТекущаяДата= ОбщийМодульВызовСервера.ДатаСеанса();
	ТекстИзHTML   = ИзвлечьТекстИзHTML(СтраницаHTML.ПолучитьТекст());
	СтрокаПогода  = ПарсингПолученныхДанных(ТекстИзHTML, ТекТекущаяДата);
	ФайлВложение  = Неопределено;
	ИмяВложения   = Формат(ТекТекущаяДата, "ДФ=yyyy-MM-dd") + ".zip";
	ТемаСообщения = СтрШаблон(НСтр("ru = 'Погода в Волхове на %1'"), ТекТекущаяДата);
	
	Если СтрДлина(СтрокаПогода) > 1000 Тогда
		// вложим полученный файл
		ZipФайлЗапись = Новый ЗаписьФайлаАрхива(ИмяВложения);
		ZipФайлЗапись.Добавить(ВременныйФайл);
		ФайлВложение = ZipФайлЗапись.ПолучитьДвоичныеДанные();
	КонецЕсли;
	
	УдалитьФайлы(ВременныйФайл);
	
	Если ПустаяСтрока(СтрокаПогода) Тогда
		Возврат НСтр("ru = 'Не удалось сформировать погоду...'");
	КонецЕсли;	
	
	// отправка по почте
	Профиль 			= Новый ИнтернетПочтовыйПрофиль;
	Почта				= Новый ИнтернетПочта;
	ПочтовоеСообщение	= Новый ИнтернетПочтовоеСообщение;
	СтруктураПараметров	= ОбщийМодульСервер.ПолучитьСтруктуруПараметровЭлПочты();
	
	Профиль.АдресСервераSMTP	= СтруктураПараметров.АдресСервераSMTP;
	Профиль.Пароль				= СтруктураПараметров.Пароль;
	Профиль.Пользователь		= СтруктураПараметров.Пользователь;
	Профиль.ПортSMTP			= СтруктураПараметров.ПортSMTP;
	Профиль.ИспользоватьSSLSMTP	= Истина;
	Профиль.ТолькоЗащищеннаяАутентификацияSMTP = Истина;
	Профиль.ПарольSMTP			= СтруктураПараметров.Пароль;
	Профиль.ПользовательSMTP	= СтруктураПараметров.Пользователь;
	
	ПочтовоеСообщение.Получатели.Добавить(Строка(АдресОповещения));
	ПочтовоеСообщение.Отправитель.Адрес = СтруктураПараметров.АдресОтправителя;
	ПочтовоеСообщение.Отправитель.ОтображаемоеИмя = ИмяКомпьютера();
	
	Если ФайлВложение <> Неопределено Тогда
		ПочтовоеСообщение.Вложения.Добавить(ФайлВложение, ИмяВложения);
	КонецЕсли;
	
	ПочтовоеСообщение.Тема = ТемаСообщения;
	ПочтовоеСообщение.Тексты.Добавить(СтрокаПогода, ТипТекстаПочтовогоСообщения.ПростойТекст);
	
	Попытка
		Почта.Подключиться(Профиль);
	Исключение
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Ошибка подключения к почтовому ящику; по причине: %1.'"), ОписаниеОшибки());
		Возврат ТекстСообщения;
	КонецПопытки;
	
	Попытка
		Почта.Послать(ПочтовоеСообщение);
	Исключение
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Ошибка отправки почтового сообщения; по причине: %1.'"), ОписаниеОшибки());
		Возврат ТекстСообщения;
	КонецПопытки;
	
	Попытка
		Почта.Отключиться();
		ТекстСообщения = НСтр("ru = 'Успешно отправлено.'");
	Исключение
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Ошибка отключения от почтового ящика; по причине: %1.'"), ОписаниеОшибки());
	КонецПопытки;
	
	Возврат ТекстСообщения;

КонецФункции

Функция ИзвлечьТекстИзHTML(Знач ИсходныйТекст) Экспорт
	
	Результат = "";
	Текст     = НРег(ИсходныйТекст);
	
	// отрезаем все что не body
	Позиция = СтрНайти(Текст, "<body");
	Если Позиция > 0 Тогда
		Текст = Сред(Текст, Позиция + 5);
		ИсходныйТекст = Сред(ИсходныйТекст, Позиция + 5);
		Позиция = СтрНайти(Текст, ">");
		Если Позиция > 0 Тогда
			Текст = Сред(Текст, Позиция + 1);
			ИсходныйТекст = Сред(ИсходныйТекст, Позиция + 1);
		КонецЕсли;
	КонецЕсли;
	
	Позиция = СтрНайти(Текст, "</body>");
	Если Позиция > 0 Тогда
		Текст = Лев(Текст, Позиция - 1);
		ИсходныйТекст = Лев(ИсходныйТекст, Позиция - 1);
	КонецЕсли;
	
	// вырезаем скрипты
	Позиция = СтрНайти(Текст, "<script");
	Пока Позиция > 0 Цикл
		ПозицияЗакрывающегоТега = СтрНайти(Текст, "</script>");
		Если ПозицияЗакрывающегоТега = 0 Тогда
			// Не найден закрывающий тег - вырезаем оставшийся текст.
			ПозицияЗакрывающегоТега = СтрДлина(Текст);
		КонецЕсли;
		Текст = Лев(Текст, Позиция - 1) + Сред(Текст, ПозицияЗакрывающегоТега + 9);
		ИсходныйТекст = Лев(ИсходныйТекст, Позиция - 1) + Сред(ИсходныйТекст, ПозицияЗакрывающегоТега + 9);
		Позиция = СтрНайти(Текст, "<script");
	КонецЦикла;
	
	// вырезаем стили
	Позиция = СтрНайти(Текст, "<style");
	Пока Позиция > 0 Цикл
		ПозицияЗакрывающегоТега = СтрНайти(Текст, "</style>");
		Если ПозицияЗакрывающегоТега = 0 Тогда
			// Не найден закрывающий тег - вырезаем оставшийся текст.
			ПозицияЗакрывающегоТега = СтрДлина(Текст);
		КонецЕсли;
		Текст = Лев(Текст, Позиция - 1) + Сред(Текст, ПозицияЗакрывающегоТега + 8);
		ИсходныйТекст = Лев(ИсходныйТекст, Позиция - 1) + Сред(ИсходныйТекст, ПозицияЗакрывающегоТега + 8);
		Позиция = СтрНайти(Текст, "<style");
	КонецЦикла;
	
	// вырезаем все теги	
	Позиция = СтрНайти(Текст, "<");
	Пока Позиция > 0 Цикл
		Результат = Результат + Лев(ИсходныйТекст, Позиция-1);
		Текст = Сред(Текст, Позиция + 1);
		ИсходныйТекст = Сред(ИсходныйТекст, Позиция + 1);
		Позиция = СтрНайти(Текст, ">");
		Если Позиция > 0 Тогда
			Текст = Сред(Текст, Позиция + 1);
			ИсходныйТекст = Сред(ИсходныйТекст, Позиция + 1);
		КонецЕсли;
		Позиция = СтрНайти(Текст, "<");
	КонецЦикла;
	
	Возврат СокрЛП(Результат);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПравилаЗамены()

	ПравилаЗамены = Новый Соответствие;
	ПравилаЗамены.Вставить("ОБЛАЧНО", "ОБЛ.");
	ПравилаЗамены.Вставить("МАЛООБЛАЧНО", "МАЛООБЛ.");
	ПравилаЗамены.Вставить("Ё", "Е");
	ПравилаЗамены.Вставить("°", " ");
	ПравилаЗамены.Вставить("…", "...");
	ПравилаЗамены.Вставить("НЕБОЛЬШОЙ", "НЕБ.");
	ПравилаЗамены.Вставить("ПРОЯСНЕНИЯМИ", "ПРОЯСН.");
	ПравилаЗамены.Вставить("&HELLIP;", "..");
	ПравилаЗамены.Вставить("ДОЖДЬ СО СНЕГОМ", "ДОЖ.СО СНЕГ.");
	ПравилаЗамены.Вставить(" ..", "..");

	Возврат ПравилаЗамены;

КонецФункции

Функция ПолучитьАдресОповещения()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	АдресаОповещения.Ссылка КАК АдресОповещения
		|ИЗ
		|	Справочник.АдресаОповещения КАК АдресаОповещения
		|ГДЕ
		|	АдресаОповещения.ПометкаУдаления = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.АдресОповещения;

КонецФункции

Функция ПарсингПолученныхДанных(Знач ИсходныйТекст, ТекТекущаяДата)
	
	
	ТекСтрокаВрег = ВРег(ИсходныйТекст);
	Т_РабочаяДата = НачалоДня(ТекТекущаяДата) + 777600;
	ДеньСтрокой   = ВРег(Формат(Т_РабочаяДата, "ДФ=dMMMM"));
	СимволГрадус  = Символ(176); // °
	СимволМнгтчк  = "&HELLIP;";
	
	СтруктураДня = Новый Структура;
	СтруктураДня.Вставить("Утро",  "УТРОМ");
	СтруктураДня.Вставить("День",  "ДНЁМ");
	СтруктураДня.Вставить("Вечер", "ВЕЧЕРОМ");
	СтруктураДня.Вставить("Ночь",  "НОЧЬЮ");
	
	СтрокаПогода = "";
	СписокСтрок  = Новый СписокЗначений;
	
	ВхождениеСКонца = СтрНайти(ТекСтрокаВрег, ДеньСтрокой, НаправлениеПоиска.СКонца);
	
	Пока ВхождениеСКонца > 0 Цикл
		ТекСтрока     = Сред(ТекСтрокаВрег, ВхождениеСКонца);
		ТекСтрокаВрег = СтрЗаменить(ТекСтрокаВрег, ТекСтрока, "");
		СписокСтрок.Добавить(Т_РабочаяДата, ТекСтрока);
		Т_РабочаяДата   = Т_РабочаяДата - 86400;
		ДеньСтрокой     = ВРег(Формат(Т_РабочаяДата, "ДФ=dMMMM"));
		ВхождениеСКонца = СтрНайти(ТекСтрокаВрег, ДеньСтрокой, НаправлениеПоиска.СКонца);
	КонецЦикла;

	СписокСтрок.СортироватьПоЗначению();
	Т_РабочаяДата = НачалоДня(ТекТекущаяДата);
	
	Для каждого ЭлементСписка Из СписокСтрок Цикл
		
		СтрокаПогода = СтрокаПогода + Формат(Т_РабочаяДата, "ДФ=dd/MM") + Символы.ПС;
		ТекСтрока    = ЭлементСписка.Представление;
		
		Для каждого КлючИЗначение Из СтруктураДня Цикл
		
			ВхождениеСКонца     = СтрНайти(ТекСтрока, КлючИЗначение.Значение, НаправлениеПоиска.СКонца);
			ВхождениеСНачала    = СтрНайти(ТекСтрока, КлючИЗначение.Значение, НаправлениеПоиска.СНачала);
			СтрокаПоиска        = Сред(ТекСтрока, ВхождениеСНачала, ВхождениеСКонца-ВхождениеСНачала);
			ТекСтрока           = Сред(ТекСтрока, ВхождениеСКонца);
			ТекСтрока           = СтрЗаменить(ТекСтрока, КлючИЗначение.Значение, "");
			СостояниеОблачности = "";
			
			ВхождениеСНачала = СтрНайти(ТекСтрока, СимволГрадус, НаправлениеПоиска.СНачала);
			ТолькоОднаЦифра  = СтрНайти(СтрокаПоиска, СимволМнгтчк) = 0;
			
			Если ТолькоОднаЦифра Тогда
				СостояниеОблачности = ПолучитьСтрокуОтПервойБуквы(ТекСтрока);
				СостояниеОблачности = ПолучитьСтрокуДоЧисла(СостояниеОблачности);
			ИначеЕсли ВхождениеСНачала > 0 Тогда
				ПозицияГрадуса      = ВхождениеСНачала + 1;
				СостояниеОблачности = ПолучитьСтрокуДоЧисла(Сред(ТекСтрока, ПозицияГрадуса));
				ТекСтрока           = Сред(ТекСтрока, ПозицияГрадуса);
			КонецЕсли;
			
			СтрокаПоиска = СтрокаПоиска + ?(ПустаяСтрока(СостояниеОблачности), "", " " + СостояниеОблачности);
			СтрокаПогода = СтрокаПогода + СтрокаПоиска + Символы.ПС;
		
		КонецЦикла;
	
		Т_РабочаяДата = Т_РабочаяДата + 86400;
		СтрокаПогода  = СтрокаПогода + Символы.ПС;
		
	КонецЦикла;
	
	Для каждого КлючИЗначение Из СтруктураДня Цикл
		СтрокаПогода = СтрЗаменить(СтрокаПогода, КлючИЗначение.Значение, КлючИЗначение.Значение + " ");
	КонецЦикла;
	
	ПравилаЗамены = ПолучитьПравилаЗамены();
	Для каждого КлючИЗначение Из ПравилаЗамены Цикл
		СтрокаПогода = СтрЗаменить(СтрокаПогода, КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
	Возврат СтрокаПогода;
	
КонецФункции

Функция ПолучитьСтрокуОтПервойБуквы(ОбрабатываемаяСтрока)

	ДлинаСтроки = СтрДлина(ОбрабатываемаяСтрока);
	
	Для ИндексСимвола = 1 По ДлинаСтроки Цикл
		ТекущийСимвол = Сред(ОбрабатываемаяСтрока, ИндексСимвола, 1);
		КодТекСимвола = КодСимвола(ТекущийСимвол);
		Если КодТекСимвола > 1039 Тогда
			Возврат Сред(ОбрабатываемаяСтрока, ИндексСимвола);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОбрабатываемаяСтрока;
	
КонецФункции

Функция ПолучитьСтрокуДоЧисла(ОбрабатываемаяСтрока)

	ВозвращаемаяСтрока = "";
	ДлинаСтроки = СтрДлина(ОбрабатываемаяСтрока);
	
	Для ИндексСимвола = 1 По ДлинаСтроки Цикл
		ТекущийСимвол = Сред(ОбрабатываемаяСтрока, ИндексСимвола, 1);
		КодТекСимвола = КодСимвола(ТекущийСимвол);
		Если КодТекСимвола > 47 И КодТекСимвола < 57 Тогда
			Прервать;
		КонецЕсли;
		ВозвращаемаяСтрока = ВозвращаемаяСтрока + ТекущийСимвол;
	КонецЦикла;
	
	Возврат ВозвращаемаяСтрока;
	
КонецФункции

#КонецОбласти

#КонецЕсли
