
Функция ПолучитьИОтправитьПогодуНаСервере(АдресОповещения = "") Экспорт
	
	ВременныйФайл = ПолучитьИмяВременногоФайла("html");

	Попытка
		Соединение	= Новый HTTPСоединение("yandex.ru", , , , , , Новый ЗащищенноеСоединениеOpenSSL());
		Соединение.Получить("/pogoda/volhov/details", ВременныйФайл);
	Исключение
		Возврат НСтр("ru = 'Ошибка запроса страницы с погодой; по причине: '") + ОписаниеОшибки();
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(АдресОповещения) Тогда
		АдресОповещения = ПолучитьАдресОповещения();
		Если АдресОповещения = Неопределено Тогда
			Возврат НСтр("ru = 'Не определен адрес получателя!'");
		КонецЕсли;
	КонецЕсли;
	
	СтраницаHTML = Новый ТекстовыйДокумент;
	СтраницаHTML.Прочитать(ВременныйФайл, КодировкаТекста.UTF8);
	
	мТекущаяДата  = ТекущаяДата();
	ТекстИзHTML   = ИзвлечьТекстИзHTML(СтраницаHTML.ПолучитьТекст());
	СтрокаПогода  = ПарсингПолученныхДанных(ТекстИзHTML, мТекущаяДата);
	ФайлВложение  = Неопределено;
	ИмяВложения   = Формат(мТекущаяДата, "ДФ=yyyy-MM-dd") + ".zip";
	ТемаСообщения = СтрШаблон(НСтр("ru = 'Погода в Волхове на %1'"), мТекущаяДата);
	
	Если СтрДлина(СтрокаПогода) > 1000 Тогда
		// вложим полученный файл
		ZipФайлЗапись = Новый ЗаписьZipФайла;
		ZipФайлЗапись.Добавить(ВременныйФайл);
		ФайлВложение = ZipФайлЗапись.ПолучитьДвоичныеДанные( , , МетодСжатияZIP.Сжатие, УровеньСжатияZIP.Максимальный);
	КонецЕсли;
	
	УдалитьФайлы(ВременныйФайл);
	
	Если ПустаяСтрока(СтрокаПогода) Тогда
		Возврат НСтр("ru = 'Не удалось сформировать погоду...'");
	КонецЕсли;	
	
	// отправка по почте
	Профиль 			= Новый ИнтернетПочтовыйПрофиль;
	Почта				= Новый ИнтернетПочта;
	ПочтовоеСообщение	= Новый ИнтернетПочтовоеСообщение;
#Если ТолстыйКлиентОбычноеПриложение ИЛИ ТолстыйКлиентУправляемоеПриложение Тогда
	СтруктураПараметров	= ОбщийМодульВызовСервера.ПолучитьСтруктуруПараметровЭлПочты();
#Иначе
	СтруктураПараметров	= ОбщийМодульСервер.ПолучитьСтруктуруПараметровЭлПочты();
#КонецЕсли
	
	Профиль.АдресСервераSMTP	= СтруктураПараметров.АдресСервераSMTP;
	Профиль.Пароль				= СтруктураПараметров.Пароль;
	Профиль.Пользователь		= СтруктураПараметров.Пользователь;
	Профиль.ПортSMTP			= СтруктураПараметров.ПортSMTP;
	Профиль.ИспользоватьSSLSMTP	= Истина;
	Профиль.ТолькоЗащищеннаяАутентификацияSMTP = Истина;
	Профиль.ПарольSMTP			= СтруктураПараметров.Пароль;
	Профиль.ПользовательSMTP	= СтруктураПараметров.Пользователь;
	
	ПочтовоеСообщение.Получатели.Добавить(Строка(АдресОповещения));
	ПочтовоеСообщение.Отправитель.Адрес = СтруктураПараметров.АдресОтправителя;
	ПочтовоеСообщение.Отправитель.ОтображаемоеИмя = ИмяКомпьютера();
	
	Если ФайлВложение <> Неопределено Тогда
		ПочтовоеСообщение.Вложения.Добавить(ФайлВложение, ИмяВложения);
	КонецЕсли;
	
	ПочтовоеСообщение.Тема = ТемаСообщения;
	ПочтовоеСообщение.Тексты.Добавить(СтрокаПогода, ТипТекстаПочтовогоСообщения.ПростойТекст);
	
	Попытка
		Почта.Подключиться(Профиль);
	Исключение
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Ошибка подключения к почтовому ящику; по причине: %1.'"), ОписаниеОшибки());
		Возврат ТекстСообщения;
	КонецПопытки;
	
	Попытка
		Почта.Послать(ПочтовоеСообщение);
	Исключение
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Ошибка отправки почтового сообщения; по причине: %1.'"), ОписаниеОшибки());
		Возврат ТекстСообщения;
	КонецПопытки;
	
	Попытка
		Почта.Отключиться();
		ТекстСообщения = НСтр("ru = 'Успешно отправлено.'");
	Исключение
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Ошибка отключения от почтового ящика; по причине: %1.'"), ОписаниеОшибки());
	КонецПопытки;
	
	Возврат ТекстСообщения;

КонецФункции

Функция ПолучитьПравилаЗамены()

	ПравилаЗамены = Новый Соответствие;
	ПравилаЗамены.Вставить("ОБЛАЧНО", "ОБЛ.");
	ПравилаЗамены.Вставить("МАЛООБЛАЧНО", "МАЛООБЛ.");
	ПравилаЗамены.Вставить("Ё", "Е");
	ПравилаЗамены.Вставить("°", " ");
	ПравилаЗамены.Вставить("…", "...");
	ПравилаЗамены.Вставить("НЕБОЛЬШОЙ", "НЕБ.");
	ПравилаЗамены.Вставить("ПРОЯСНЕНИЯМИ", "ПРОЯСН.");
	ПравилаЗамены.Вставить("&HELLIP;", "..");
	ПравилаЗамены.Вставить("ДОЖДЬ СО СНЕГОМ", "ДОЖ.СО СНЕГ.");
	ПравилаЗамены.Вставить(" ..", "..");

	Возврат ПравилаЗамены;

КонецФункции

Функция ПолучитьАдресОповещения()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	АдресаОповещения.Ссылка КАК АдресОповещения
		|ИЗ
		|	Справочник.АдресаОповещения КАК АдресаОповещения
		|ГДЕ
		|	АдресаОповещения.ПометкаУдаления = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.АдресОповещения;

КонецФункции

Функция ИзвлечьТекстИзHTML(Знач ИсходныйТекст) Экспорт
	
	Результат = "";
	Текст     = НРег(ИсходныйТекст);
	
	// отрезаем все что не body
	Позиция = СтрНайти(Текст, "<body");
	Если Позиция > 0 Тогда
		Текст = Сред(Текст, Позиция + 5);
		ИсходныйТекст = Сред(ИсходныйТекст, Позиция + 5);
		Позиция = СтрНайти(Текст, ">");
		Если Позиция > 0 Тогда
			Текст = Сред(Текст, Позиция + 1);
			ИсходныйТекст = Сред(ИсходныйТекст, Позиция + 1);
		КонецЕсли;
	КонецЕсли;
	
	Позиция = СтрНайти(Текст, "</body>");
	Если Позиция > 0 Тогда
		Текст = Лев(Текст, Позиция - 1);
		ИсходныйТекст = Лев(ИсходныйТекст, Позиция - 1);
	КонецЕсли;
	
	// вырезаем скрипты
	Позиция = СтрНайти(Текст, "<script");
	Пока Позиция > 0 Цикл
		ПозицияЗакрывающегоТега = СтрНайти(Текст, "</script>");
		Если ПозицияЗакрывающегоТега = 0 Тогда
			// Не найден закрывающий тег - вырезаем оставшийся текст.
			ПозицияЗакрывающегоТега = СтрДлина(Текст);
		КонецЕсли;
		Текст = Лев(Текст, Позиция - 1) + Сред(Текст, ПозицияЗакрывающегоТега + 9);
		ИсходныйТекст = Лев(ИсходныйТекст, Позиция - 1) + Сред(ИсходныйТекст, ПозицияЗакрывающегоТега + 9);
		Позиция = СтрНайти(Текст, "<script");
	КонецЦикла;
	
	// вырезаем стили
	Позиция = СтрНайти(Текст, "<style");
	Пока Позиция > 0 Цикл
		ПозицияЗакрывающегоТега = СтрНайти(Текст, "</style>");
		Если ПозицияЗакрывающегоТега = 0 Тогда
			// Не найден закрывающий тег - вырезаем оставшийся текст.
			ПозицияЗакрывающегоТега = СтрДлина(Текст);
		КонецЕсли;
		Текст = Лев(Текст, Позиция - 1) + Сред(Текст, ПозицияЗакрывающегоТега + 8);
		ИсходныйТекст = Лев(ИсходныйТекст, Позиция - 1) + Сред(ИсходныйТекст, ПозицияЗакрывающегоТега + 8);
		Позиция = СтрНайти(Текст, "<style");
	КонецЦикла;
	
	// вырезаем все теги	
	Позиция = СтрНайти(Текст, "<");
	Пока Позиция > 0 Цикл
		Результат = Результат + Лев(ИсходныйТекст, Позиция-1);
		Текст = Сред(Текст, Позиция + 1);
		ИсходныйТекст = Сред(ИсходныйТекст, Позиция + 1);
		Позиция = СтрНайти(Текст, ">");
		Если Позиция > 0 Тогда
			Текст = Сред(Текст, Позиция + 1);
			ИсходныйТекст = Сред(ИсходныйТекст, Позиция + 1);
		КонецЕсли;
		Позиция = СтрНайти(Текст, "<");
	КонецЦикла;
	
	Возврат СокрЛП(Результат);
	
КонецФункции

Функция ПарсингПолученныхДанных(Знач ИсходныйТекст, мТекущаяДата)
	
	
	ТекСтрокаВрег = ВРег(ИсходныйТекст);
	мРабочаяДата  = НачалоДня(мТекущаяДата) + 777600;
	ДеньСтрокой   = ВРег(Формат(мРабочаяДата, "ДФ=dMMMM"));
	СимволГрадус  = Символ(176); // °
	СимволМнгтчк  = "&HELLIP;";
	
	СтруктураДня       = Новый Структура("Утро, День, Вечер, Ночь", "УТРОМ", "ДНЁМ", "ВЕЧЕРОМ", "НОЧЬЮ");
	СтрокаПогода       = "";
	СписокСтрок        = Новый СписокЗначений;
	
	ВхождениеСКонца = СтрНайти(ТекСтрокаВрег, ДеньСтрокой, НаправлениеПоиска.СКонца);
	
	Пока ВхождениеСКонца > 0 Цикл
		ТекСтрока     = Сред(ТекСтрокаВрег, ВхождениеСКонца);
		ТекСтрокаВрег = СтрЗаменить(ТекСтрокаВрег, ТекСтрока, "");
		СписокСтрок.Добавить(мРабочаяДата, ТекСтрока);
		мРабочаяДата    = мРабочаяДата - 86400;
		ДеньСтрокой     = ВРег(Формат(мРабочаяДата, "ДФ=dMMMM"));
		ВхождениеСКонца = СтрНайти(ТекСтрокаВрег, ДеньСтрокой, НаправлениеПоиска.СКонца);
	КонецЦикла;

	СписокСтрок.СортироватьПоЗначению();
	мРабочаяДата = НачалоДня(мТекущаяДата);
	
	Для каждого ЭлементСписка Из СписокСтрок Цикл
		
		СтрокаПогода = СтрокаПогода + Формат(мРабочаяДата, "ДФ=dd/MM") + Символы.ПС;
		ТекСтрока    = ЭлементСписка.Представление;
		
		Для каждого КлючИЗначение Из СтруктураДня Цикл
		
			ВхождениеСКонца     = СтрНайти(ТекСтрока, КлючИЗначение.Значение, НаправлениеПоиска.СКонца);
			ВхождениеСНачала    = СтрНайти(ТекСтрока, КлючИЗначение.Значение, НаправлениеПоиска.СНачала);
			СтрокаПоиска        = Сред(ТекСтрока, ВхождениеСНачала, ВхождениеСКонца-ВхождениеСНачала);
			ТекСтрока           = Сред(ТекСтрока, ВхождениеСКонца);
			ТекСтрока           = СтрЗаменить(ТекСтрока, КлючИЗначение.Значение, "");
			СостояниеОблачности = "";
			
			ВхождениеСНачала = СтрНайти(ТекСтрока, СимволГрадус, НаправлениеПоиска.СНачала);
			ТолькоОднаЦифра  = СтрНайти(СтрокаПоиска, СимволМнгтчк) = 0;
			
			Если ТолькоОднаЦифра Тогда
				СостояниеОблачности = ПолучитьСтрокуОтПервойБуквы(ТекСтрока);
				СостояниеОблачности = ПолучитьСтрокуДоЧисла(СостояниеОблачности);
			ИначеЕсли ВхождениеСНачала > 0 Тогда
				ПозицияГрадуса      = ВхождениеСНачала + 1;
				СостояниеОблачности = ПолучитьСтрокуДоЧисла(Сред(ТекСтрока, ПозицияГрадуса));
				ТекСтрока           = Сред(ТекСтрока, ПозицияГрадуса);
			КонецЕсли;
			
			СтрокаПоиска = СтрокаПоиска + ?(ПустаяСтрока(СостояниеОблачности), "", " " + СостояниеОблачности);
			СтрокаПогода = СтрокаПогода + СтрокаПоиска + Символы.ПС;
		
		КонецЦикла;
	
		мРабочаяДата = мРабочаяДата + 86400;
		СтрокаПогода = СтрокаПогода + Символы.ПС;
		
	КонецЦикла;
	
	Для каждого КлючИЗначение Из СтруктураДня Цикл
		СтрокаПогода = СтрЗаменить(СтрокаПогода, КлючИЗначение.Значение, КлючИЗначение.Значение + " ");
	КонецЦикла;
	
	ПравилаЗамены = ПолучитьПравилаЗамены();
	Для каждого КлючИЗначение Из ПравилаЗамены Цикл
		СтрокаПогода = СтрЗаменить(СтрокаПогода, КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
	Возврат СтрокаПогода;
	
	//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\
	
	СтрокаВрег = ВРег(ИсходныйТекст);
	мТекДата   = НачалоДня(мТекущаяДата);
	СтрТекДата = ВРег(Формат(мТекДата, "ДФ=dMMMM"));
	
	СтруктураДня       = Новый Структура("Утро, День, Вечер, Ночь", "УТРОМ", "ДНЁМ", "ВЕЧЕРОМ", "НОЧЬЮ");
	СоответствиеЗамена = Новый Соответствие;
	СтрокаПогода       = "";
	
	// разбиваем на времена дня
	Для каждого КлючИЗначение Из СтруктураДня Цикл
		СтрокаВрег = СтрЗаменить(СтрокаВрег, КлючИЗначение.Значение, Символы.ПС + КлючИЗначение.Значение + " ");
	КонецЦикла;
	
	// разбиваем по дням
	ВхождениеНачало = СтрНайти(СтрокаВрег, СтрТекДата);
	НачалоОтсечено  = Ложь;
	Пока Истина Цикл
		
		Если ВхождениеНачало = 0 Тогда
			Прервать;
		КонецЕсли;
		
		СоответствиеЗамена.Вставить(СтрТекДата, Формат(мТекДата, "ДФ=dd/MM"));
		
		Если НачалоОтсечено Тогда
			СтрокаВрег = Лев(СтрокаВрег, ВхождениеНачало) + Символы.ПС + Сред(СтрокаВрег, ВхождениеНачало);
		Иначе
			СтрокаВрег = Сред(СтрокаВрег, ВхождениеНачало);
			НачалоОтсечено = Истина;
		КонецЕсли;
		
		мТекДата        = мТекДата + 86401;
		СтрТекДата      = ВРег(Формат(мТекДата, "ДФ=dMMMM"));
		ВхождениеНачало = СтрНайти(СтрокаВрег, СтрТекДата);
		
	КонецЦикла;
	
	// отсекаем лишние строки, в конце дня
	СтрокаВрег = СтрокаВрег + Символы.ПС;
	ВхождениеНачало = СтрНайти(СтрокаВрег, "%");
	Пока ВхождениеНачало > 0 Цикл
		ВхождениеКонец = СтрНайти(СтрокаВрег, Символы.ПС, НаправлениеПоиска.СНачала, ВхождениеНачало);
		Если ВхождениеКонец > 0 И ВхождениеКонец > ВхождениеНачало Тогда
			ПодстрокаПоиска = Сред(СтрокаВрег, ВхождениеНачало, ВхождениеКонец-ВхождениеНачало) + Символы.ПС;
			СтрокаВрег = СтрЗаменить(СтрокаВрег, ПодстрокаПоиска, Символы.ПС);
		КонецЕсли;
		ВхождениеНачало = СтрНайти(СтрокаВрег, "%");
	КонецЦикла;
	
	// заменяем заголовки датами
	Для каждого КлючИЗначение Из СоответствиеЗамена Цикл
		ВхождениеНачало = СтрНайти(СтрокаВрег, КлючИЗначение.Ключ);
		Если ВхождениеНачало > 0 Тогда
			ВхождениеКонец = СтрНайти(СтрокаВрег, Символы.ПС, НаправлениеПоиска.СНачала, ВхождениеНачало);
			Если ВхождениеКонец > 0 Тогда
				СтрокаВрег = СтрЗаменить(СтрокаВрег, Сред(СтрокаВрег, ВхождениеНачало, ВхождениеКонец-ВхождениеНачало), Символы.ПС + КлючИЗначение.Значение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// удаляем в конце каждого времени дня лишние символы
	ЧислоСтрок = СтрЧислоСтрок(СтрокаВрег);
	Для ИндексСтроки = 1 По ЧислоСтрок Цикл
		ТекСтрока = СтрПолучитьСтроку(СтрокаВрег, ИндексСтроки);
		Для каждого КлючИЗначение Из СтруктураДня Цикл
			Если СтрНайти(ТекСтрока, КлючИЗначение.Значение) > 0 Тогда
				ДлинаСтроки = СтрДлина(ТекСтрока);
				мКодСимвола = КодСимвола(Прав(ТекСтрока, 1));
				Пока мКодСимвола < 1040 ИЛИ мКодСимвола > 1071 Цикл
					ТекСтрока = Лев(ТекСтрока, ДлинаСтроки-1);
					ДлинаСтроки = СтрДлина(ТекСтрока);
					мКодСимвола = КодСимвола(Прав(ТекСтрока, 1));
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		СтрокаПогода = СтрокаПогода + ?(ПустаяСтрока(СтрокаПогода), "", Символы.ПС) + ТекСтрока;
	КонецЦикла;
	
	// замена по шаблону
	ПравилаЗамены = ПолучитьПравилаЗамены();
	Для каждого КлючИЗначение Из ПравилаЗамены Цикл
		СтрокаПогода = СтрЗаменить(СтрокаПогода, КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
	СтрокаПогода = ДобавитьПробелыПередПервойЦифройСКонца(СтрокаПогода);
	
	Возврат СтрокаПогода;
	
КонецФункции

Функция ПолучитьСтрокуОтПервойБуквы(ОбрабатываемаяСтрока)

	ДлинаСтроки = СтрДлина(ОбрабатываемаяСтрока);
	
	Для ИндексСимвола = 1 По ДлинаСтроки Цикл
		ТекущийСимвол = Сред(ОбрабатываемаяСтрока, ИндексСимвола, 1);
		КодТекСимвола = КодСимвола(ТекущийСимвол);
		Если КодТекСимвола > 1039 Тогда
			Возврат Сред(ОбрабатываемаяСтрока, ИндексСимвола);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОбрабатываемаяСтрока;
	
КонецФункции

Функция ПолучитьСтрокуДоЧисла(ОбрабатываемаяСтрока)

	ВозвращаемаяСтрока = "";
	ДлинаСтроки = СтрДлина(ОбрабатываемаяСтрока);
	
	Для ИндексСимвола = 1 По ДлинаСтроки Цикл
		ТекущийСимвол = Сред(ОбрабатываемаяСтрока, ИндексСимвола, 1);
		КодТекСимвола = КодСимвола(ТекущийСимвол);
		Если КодТекСимвола > 47 И КодТекСимвола < 57 Тогда
			Прервать;
		КонецЕсли;
		ВозвращаемаяСтрока = ВозвращаемаяСтрока + ТекущийСимвол;
	КонецЦикла;
	
	Возврат ВозвращаемаяСтрока;
	
КонецФункции

Функция ДобавитьПробелыПередПервойЦифройСКонца(МногострочнаяСтрока)

	ВозвращаемаяСтрока = "";
	ТекЧислоСтрок      = СтрЧислоСтрок(МногострочнаяСтрока);
	СимволПереводСтр   = Символы.ПС;
	
	Для ИндексТекСтроки = 1 По ТекЧислоСтрок Цикл
		ИзменяемаяСтрока = СтрПолучитьСтроку(МногострочнаяСтрока, ИндексТекСтроки);
		ДобавитьПробелПередПервойЦифройСКонца(ИзменяемаяСтрока);
		ВозвращаемаяСтрока = ВозвращаемаяСтрока + ?(ПустаяСтрока(ВозвращаемаяСтрока), "", СимволПереводСтр) + ИзменяемаяСтрока;
	КонецЦикла;
	
	Возврат ВозвращаемаяСтрока;

КонецФункции

Процедура ДобавитьПробелПередПервойЦифройСКонца(ИзменяемаяСтрока)

	ТекИндексСимвола  = СтрДлина(ИзменяемаяСтрока);
	ИндексПредСимвола = ТекИндексСимвола - 1;
	СимволПробел      = Символ(32);
	
	Пока ИндексПредСимвола > 0 Цикл
		
		ТекСимвол  = Сред(ИзменяемаяСтрока, ТекИндексСимвола, 1);
		ПредСимвол = Сред(ИзменяемаяСтрока, ИндексПредСимвола, 1);
		КодТекСимвола  = КодСимвола(ТекСимвол);
		КодПредСимвола = КодСимвола(ПредСимвол);
		
		Если (КодТекСимвола > 47 И КодТекСимвола < 58)  И (КодПредСимвола > 47 И КодПредСимвола < 58) Тогда
			Возврат;
		ИначеЕсли ТекСимвол <> СимволПробел И (КодПредСимвола > 47 И КодПредСимвола < 58) Тогда
			ИзменяемаяСтрока = Лев(ИзменяемаяСтрока, ИндексПредСимвола) + СимволПробел + Сред(ИзменяемаяСтрока, ТекИндексСимвола);
			Возврат;
		КонецЕсли;
		
		ТекИндексСимвола  = ТекИндексСимвола - 1;
		ИндексПредСимвола = ИндексПредСимвола - 1;
		
	КонецЦикла;

КонецПроцедуры

