
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиРеквизитовФормы

&НаКлиенте
Процедура ПутьИИмяФайлаVCFНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	НачалоВыбораФайлаVCF("ПутьИИмяФайлаVCF");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПрочитатьФайлVCF(Команда)
	
	Если НЕ ПустаяСтрока(ПутьИИмяФайлаVCF) Тогда
		
		мФайл = Новый Файл(ПутьИИмяФайлаVCF);
		ОпОповещения = Новый ОписаниеОповещения("ПослеЗавершенияПроверкиСуществования", ЭтотОбъект, мФайл.Имя);
		
		мФайл.НачатьПроверкуСуществования(ОпОповещения);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СравнитьФайлыVCF(Команда)

	ТабДокумент = СравнитьФайлыVCFНаСервере();
	ТабДокумент.Показать();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеЗавершенияПроверкиСуществования(ФайлСуществует, ИмяСуществуещегоФайла) Экспорт

	Если ФайлСуществует Тогда
		
		ФайлVCF = Новый ТекстовыйДокумент;
		ФайлVCF.ИспользуемоеИмяФайла = ИмяСуществуещегоФайла;
		
		ОпОповещения = Новый ОписаниеОповещения("ПослеЗавершенияЧтенияФайла", ЭтотОбъект, ФайлVCF);
		
		ФайлVCF.НачатьЧтение(ОпОповещения, ПутьИИмяФайлаVCF, КодировкаТекста.ANSI);
		
	Иначе
		
		ПоказатьОповещениеПользователя(НСтр("ru = 'Файл не существует!'"), , ИмяСуществуещегоФайла, БиблиотекаКартинок.УдалитьНепосредственно);
		
	КонецЕсли;

КонецПроцедуры // ПослеЗавершенияПроверкиСуществования()

&НаКлиенте
Процедура НачалоВыбораФайлаVCF(ИмяРеквизита)

	Описание = Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтотОбъект, ИмяРеквизита);
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "*.vcf|*.vcf";
	Диалог.Показать(Описание);

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФайла(ВыбранныеФайлы, ИмяРеквизита) Экспорт
	
	Если ТипЗнч(ВыбранныеФайлы) = Тип("Массив") И ВыбранныеФайлы.Количество() > 0 Тогда
		ЭтотОбъект[ИмяРеквизита] = ВыбранныеФайлы.Получить(0);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗавершенияЧтенияФайла(ЧтениеФайлаVCF) Экспорт

	Начало		= "BEGIN:VCARD";
	Окончание	= "END:VCARD";
	НомерВерсии	= "VERSION:";
	Равно		= "=";
	Пробел		= " ";
	ТочкаСЗпт	= ";";
	СтрокВФайле = ЧтениеФайлаVCF.КоличествоСтрок();
	Контакты	= Новый Массив;
	Карточка	= Новый Массив;
	
	Для ИндексСтроки = 1 По СтрокВФайле Цикл
	
		ТекСтрокаФайла = ЧтениеФайлаVCF.ПолучитьСтроку(ИндексСтроки);
		
		Если ПустаяСтрока(ТекСтрокаФайла) Тогда
			Продолжить;
		ИначеЕсли СтрНайти(ТекСтрокаФайла, НомерВерсии, НаправлениеПоиска.СНачала) = 1 Тогда
			Продолжить;
		ИначеЕсли СтрНайти(ТекСтрокаФайла, Начало, НаправлениеПоиска.СНачала) = 1 Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекСтрокаФайла = Окончание Тогда
			Контакты.Добавить(Карточка);
			Карточка = Новый Массив;
			Продолжить;
		КонецЕсли;
		
		ПервыйСимвол = Лев(ТекСтрокаФайла, 1);
		
		Если ПервыйСимвол = Равно ИЛИ ПервыйСимвол = Пробел ИЛИ ПервыйСимвол = ТочкаСЗпт Тогда
			// Это продолжение строки
			НаибольшийИндекс = Карточка.ВГраница();
			Карточка[НаибольшийИндекс] = Карточка[НаибольшийИндекс] + СокрЛП(Сред(ТекСтрокаФайла, 2));
		Иначе
			Карточка.Добавить(СокрЛП(ТекСтрокаФайла));
		КонецЕсли;
	
	КонецЦикла;
		
	УдалитьСлужебныеКонструкцииНаКлиентеНаСервереБезКонтекста(Контакты);
	
	ТабДокумент	= СформироватьТабличныйДокументНаСервере(Контакты);
	
	Если ОтображатьЗагруженныеДанные Тогда
		ТабДокумент.Показать(ЧтениеФайлаVCF.ИспользуемоеИмяФайла);
	КонецЕсли;
	
	ЗаполнитьСписокВыбора(Элементы.ИндексПервойТаблицы.СписокВыбора);
	ЗаполнитьСписокВыбора(Элементы.ИндексВторойТаблицы.СписокВыбора);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УдалитьСлужебныеКонструкцииНаКлиентеНаСервереБезКонтекста(МассивКонтактов)

	ДвойноеРавно	= "==";
	ЗнакРавно		= "=";
	ДвойнаяТочкаЗпт	= ";;";
	ТочкаСЗапятой	= ";";
	Фотография		= "PHOTO;";
	ТипКодировки1	= "CHARSET=UTF-8;ENCODING=QUOTED-PRINTABLE:";
	ТипКодировки2	= "ENCODING=QUOTED-PRINTABLE:";
	
	Для каждого ТекущийКонтакт Из МассивКонтактов Цикл
		
		НаибольшийИндекс = ТекущийКонтакт.ВГраница();
		
		Для ТекИндекс = 0 По НаибольшийИндекс Цикл
			
			ТекЗапись = ТекущийКонтакт[ТекИндекс];
			
			ЭтоФотография = СтрНайти(ТекЗапись, Фотография) = 1;
			
			Если СтрНайти(ТекЗапись, ТипКодировки1) > 0 Тогда
				ТекЗапись = СтрЗаменить(ТекЗапись, ТипКодировки1, "");
			КонецЕсли;
			
			Если СтрНайти(ТекЗапись, ТипКодировки2) > 0 Тогда
				ТекЗапись = СтрЗаменить(ТекЗапись, ТипКодировки2, "");
			КонецЕсли;
			
			Если СтрНайти(ТекЗапись, ДвойноеРавно) > 0 И НЕ ЭтоФотография Тогда
				Пока СтрНайти(ТекЗапись, ДвойноеРавно) > 0 Цикл
					ТекЗапись = СтрЗаменить(ТекЗапись, ДвойноеРавно, ЗнакРавно);
				КонецЦикла;
			КонецЕсли;			
		
			Если СтрНайти(ТекЗапись, ДвойнаяТочкаЗпт) > 0 И НЕ ЭтоФотография Тогда
				Пока СтрНайти(ТекЗапись, ДвойнаяТочкаЗпт) > 0 Цикл
					ТекЗапись = СтрЗаменить(ТекЗапись, ДвойнаяТочкаЗпт, ТочкаСЗапятой);
				КонецЦикла;
			КонецЕсли;
			
			Если Прав(ТекЗапись, 1) = ТочкаСЗапятой Тогда
				ТекЗапись = Лев(ТекЗапись, СтрДлина(ТекЗапись)-1);
			КонецЕсли;
			
			Если Прав(ТекЗапись, 1) = ЗнакРавно И НЕ ЭтоФотография Тогда
				ТекЗапись = Лев(ТекЗапись, СтрДлина(ТекЗапись)-1);
			КонецЕсли;
			
			ТекущийКонтакт[ТекИндекс] = ТекЗапись;
			
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТаблицуСимволов()

	ТаблицаСимволов = Новый Соответствие;
	
	// Заглавные
	ТаблицаСимволов.Вставить("Ё", "=D0=81");
	ТаблицаСимволов.Вставить("А", "=D0=90");
	ТаблицаСимволов.Вставить("Б", "=D0=91");
	ТаблицаСимволов.Вставить("В", "=D0=92");
	ТаблицаСимволов.Вставить("Г", "=D0=93");
	ТаблицаСимволов.Вставить("Д", "=D0=94");
	ТаблицаСимволов.Вставить("Е", "=D0=95");
	ТаблицаСимволов.Вставить("Ж", "=D0=96");
	ТаблицаСимволов.Вставить("З", "=D0=97");
	ТаблицаСимволов.Вставить("И", "=D0=98");
	ТаблицаСимволов.Вставить("Й", "=D0=99");
	ТаблицаСимволов.Вставить("К", "=D0=9A");
	ТаблицаСимволов.Вставить("Л", "=D0=9B");
	ТаблицаСимволов.Вставить("М", "=D0=9C");
	ТаблицаСимволов.Вставить("Н", "=D0=9D");
	ТаблицаСимволов.Вставить("О", "=D0=9E");
	ТаблицаСимволов.Вставить("П", "=D0=9F");
	ТаблицаСимволов.Вставить("Р", "=D0=A0");
	ТаблицаСимволов.Вставить("С", "=D0=A1");
	ТаблицаСимволов.Вставить("Т", "=D0=A2");
	ТаблицаСимволов.Вставить("У", "=D0=A3");
	ТаблицаСимволов.Вставить("Ф", "=D0=A4");
	ТаблицаСимволов.Вставить("Х", "=D0=A5");
	ТаблицаСимволов.Вставить("Ц", "=D0=A6");
	ТаблицаСимволов.Вставить("Ч", "=D0=A7");
	ТаблицаСимволов.Вставить("Ш", "=D0=A8");
	ТаблицаСимволов.Вставить("Щ", "=D0=A9");
	ТаблицаСимволов.Вставить("Ъ", "=D0=AA");
	ТаблицаСимволов.Вставить("Ы", "=D0=AB");
	ТаблицаСимволов.Вставить("Ь", "=D0=AC");
	ТаблицаСимволов.Вставить("Э", "=D0=AD");
	ТаблицаСимволов.Вставить("Ю", "=D0=AE");
	ТаблицаСимволов.Вставить("Я", "=D0=AF");
	
	// Строчные
	ТаблицаСимволов.Вставить("а", "=D0=B0");
	ТаблицаСимволов.Вставить("б", "=D0=B1");
	ТаблицаСимволов.Вставить("в", "=D0=B2");
	ТаблицаСимволов.Вставить("г", "=D0=B3");
	ТаблицаСимволов.Вставить("д", "=D0=B4");
	ТаблицаСимволов.Вставить("е", "=D0=B5");
	ТаблицаСимволов.Вставить("ж", "=D0=B6");
	ТаблицаСимволов.Вставить("з", "=D0=B7");
	ТаблицаСимволов.Вставить("и", "=D0=B8");
	ТаблицаСимволов.Вставить("й", "=D0=B9");
	ТаблицаСимволов.Вставить("к", "=D0=BA");
	ТаблицаСимволов.Вставить("л", "=D0=BB");
	ТаблицаСимволов.Вставить("м", "=D0=BC");
	ТаблицаСимволов.Вставить("н", "=D0=BD");
	ТаблицаСимволов.Вставить("о", "=D0=BE");
	ТаблицаСимволов.Вставить("п", "=D0=BF");
	ТаблицаСимволов.Вставить("р", "=D1=80");
	ТаблицаСимволов.Вставить("с", "=D1=81");
	ТаблицаСимволов.Вставить("т", "=D1=82");
	ТаблицаСимволов.Вставить("у", "=D1=83");
	ТаблицаСимволов.Вставить("ф", "=D1=84");
	ТаблицаСимволов.Вставить("х", "=D1=85");
	ТаблицаСимволов.Вставить("ц", "=D1=86");
	ТаблицаСимволов.Вставить("ч", "=D1=87");
	ТаблицаСимволов.Вставить("ш", "=D1=88");
	ТаблицаСимволов.Вставить("щ", "=D1=89");
	ТаблицаСимволов.Вставить("ъ", "=D1=8A");
	ТаблицаСимволов.Вставить("ы", "=D1=8B");
	ТаблицаСимволов.Вставить("ь", "=D1=8C");
	ТаблицаСимволов.Вставить("э", "=D1=8D");
	ТаблицаСимволов.Вставить("ю", "=D1=8E");
	ТаблицаСимволов.Вставить("я", "=D1=8F");
	ТаблицаСимволов.Вставить("ё", "=D1=91");

	// Цифры
	ТаблицаСимволов.Вставить("0", "=30");
	ТаблицаСимволов.Вставить("1", "=31");
	ТаблицаСимволов.Вставить("2", "=32");
	ТаблицаСимволов.Вставить("3", "=33");
	ТаблицаСимволов.Вставить("4", "=34");
	ТаблицаСимволов.Вставить("5", "=35");
	ТаблицаСимволов.Вставить("6", "=36");
	ТаблицаСимволов.Вставить("7", "=37");
	ТаблицаСимволов.Вставить("8", "=38");
	ТаблицаСимволов.Вставить("9", "=39");
	
	// спецсимволы
	ТаблицаСимволов.Вставить(" ", "=20");
	ТаблицаСимволов.Вставить("!", "=21");
	ТаблицаСимволов.Вставить("""", "=22");
	ТаблицаСимволов.Вставить("#", "=23");
	ТаблицаСимволов.Вставить("&", "=24");
	ТаблицаСимволов.Вставить("%", "=25");
	ТаблицаСимволов.Вставить("&", "=26");
	ТаблицаСимволов.Вставить("'", "=27");
	ТаблицаСимволов.Вставить("(", "=28");
	ТаблицаСимволов.Вставить(")", "=29");
	ТаблицаСимволов.Вставить("*", "=2A");
	ТаблицаСимволов.Вставить("+", "=2B");
	ТаблицаСимволов.Вставить(",", "=2C");
	ТаблицаСимволов.Вставить("-", "=2D");
	ТаблицаСимволов.Вставить(".", "=2E");
	ТаблицаСимволов.Вставить("/", "=2F");
	ТаблицаСимволов.Вставить(Символы.ПС, "=0A");
	
	// английские буквы
	ТаблицаСимволов.Вставить("A", "=41");
	ТаблицаСимволов.Вставить("H", "=48");
	ТаблицаСимволов.Вставить("L", "=4C");
	ТаблицаСимволов.Вставить("M", "=4D");
	ТаблицаСимволов.Вставить("O", "=4F");
	ТаблицаСимволов.Вставить("a", "=61");
	ТаблицаСимволов.Вставить("e", "=65");
	
	Возврат ТаблицаСимволов;

КонецФункции // ПолучитьТаблицуСимволов()

&НаСервереБезКонтекста
Процедура КонвертироватьТекст(ТаблицаСимволов, ТекстДляКонвертации)
	
	Для каждого КлючИЗначение Из ТаблицаСимволов Цикл
		
		ИскомаяСтрока		= КлючИЗначение.Значение;
		ЗаменяемаяСтрока	= КлючИЗначение.Ключ;
		ТекстДляКонвертации	= СтрЗаменить(ТекстДляКонвертации, ИскомаяСтрока, ЗаменяемаяСтрока);
		
	КонецЦикла;

КонецПроцедуры // КонвертироватьТекст()

&НаСервереБезКонтекста
Функция ПолучитьТаблицуКонтактныхДанныхНаСервереБезКонтекста()
	
	ТаблицаКонтактныхДанных = Новый Соответствие;
	ТаблицаКонтактныхДанных.Вставить("FN;", "ФИО: ");
	ТаблицаКонтактныхДанных.Вставить("TEL;CELL;PREF:", "Мобильный: ");
	ТаблицаКонтактныхДанных.Вставить("TEL;WORK;PREF:", "Рабочий: ");
	ТаблицаКонтактныхДанных.Вставить("TEL;WORK;FAX:", "Рабочий: ");
	ТаблицаКонтактныхДанных.Вставить("TEL;WORK:", "Рабочий: ");
	ТаблицаКонтактныхДанных.Вставить("TEL;CELL:", "Мобильный: ");
	ТаблицаКонтактныхДанных.Вставить("TEL;VOICE:", "Телефон: ");
	ТаблицаКонтактныхДанных.Вставить("TEL;HOME;FAX:", "Телефон домашний: ");
	ТаблицаКонтактныхДанных.Вставить("TEL;HOME:", "Телефон домашний: ");
	ТаблицаКонтактныхДанных.Вставить("TEL;OTHER;PREF:", "Телефон: ");
	ТаблицаКонтактныхДанных.Вставить("TEL;PREF:", "Телефон: ");
	ТаблицаКонтактныхДанных.Вставить("TEL;OTHER:", "Телефон: ");
	ТаблицаКонтактныхДанных.Вставить("TEL;:", "Телефон: ");
	ТаблицаКонтактныхДанных.Вставить("EMAIL;WORK:", "Рабочий e-mail: ");
	ТаблицаКонтактныхДанных.Вставить("EMAIL;HOME:", "Личный e-mail: ");
	ТаблицаКонтактныхДанных.Вставить("EMAIL;X-INTERNET:", "E-mail: ");
	ТаблицаКонтактныхДанных.Вставить("EMAIL:", "E-mail: ");
	ТаблицаКонтактныхДанных.Вставить("ADR;HOME;", "Домашний адрес: ");
	ТаблицаКонтактныхДанных.Вставить("ADR;WORK;", "Рабочий адрес: ");
	ТаблицаКонтактныхДанных.Вставить("NOTE;", "Примечание: ");
	ТаблицаКонтактныхДанных.Вставить("NOTE:", "Примечание: ");
	ТаблицаКонтактныхДанных.Вставить("BDAY:", "День рожденья: ");
	
	Возврат ТаблицаКонтактныхДанных;

КонецФункции

&НаСервереБезКонтекста
Функция ПроизвестиЗаменуКонтактныхДанныхНаСервереБезКонтекста(ТаблицаКонтактныхДанных, ИнфоКонтакта)
	
	ЧислоСтрок			= СтрЧислоСтрок(ИнфоКонтакта);
	НовоеИнфоКонтакта	= "";
	ПереводСтроки		= Символы.ПС;
	НомерСтроки			= 1;
	ПризнакОрганизации1	= "ORG:";
	ПризнакОрганизации2	= "ORG;";
	ОргНаименование		= "TITLE;";
	
	Пока ЧислоСтрок >= НомерСтроки Цикл
	
		ПолученнаяСтрока = СтрПолучитьСтроку(ИнфоКонтакта, НомерСтроки);
		
		Для каждого КлючИЗначение Из ТаблицаКонтактныхДанных Цикл
			
			ЗаменяемаяСтрока	= КлючИЗначение.Значение;
			ИскомаяСтрока		= КлючИЗначение.Ключ;
			
			Если СтрНайти(ПолученнаяСтрока, ИскомаяСтрока) = 1 Тогда
				ПолученнаяСтрока = СтрЗаменить(ПолученнаяСтрока, ИскомаяСтрока, ЗаменяемаяСтрока);
			КонецЕсли;
			
		КонецЦикла;
		
		Если СтрНайти(ПолученнаяСтрока, ПризнакОрганизации1) = 1 ИЛИ СтрНайти(ПолученнаяСтрока, ПризнакОрганизации2) = 1 Тогда
			
			НомерСтроки  = НомерСтроки + 1;
			
			Если ЧислоСтрок >= НомерСтроки Тогда
				
				ВтораяСтрока = СтрПолучитьСтроку(ИнфоКонтакта, НомерСтроки);
				
				Если СтрНайти(ВтораяСтрока, ОргНаименование) = 1 Тогда
					ОргЗаголовок = СокрЛП(СтрЗаменить(ПолученнаяСтрока, ПризнакОрганизации1, ""));
					ОргЗаголовок = СокрЛП(СтрЗаменить(ОргЗаголовок, ПризнакОрганизации2, ""));
					ОрганизацИмя = СокрЛП(СтрЗаменить(ВтораяСтрока, ОргНаименование, ""));
					Если ПустаяСтрока(ОрганизацИмя) ИЛИ ПустаяСтрока(ОргЗаголовок) Тогда
						Разделитель = "";
					Иначе
						Разделитель = " ";
					КонецЕсли;
					ПолученнаяСтрока = "Организация: " + ОргЗаголовок + Разделитель + ОрганизацИмя;
				Иначе
					НомерСтроки  = НомерСтроки - 1;
				КонецЕсли;
				
			Иначе
				
				НомерСтроки      = НомерСтроки - 1;
				ПолученнаяСтрока = СокрЛП(СтрЗаменить(ПолученнаяСтрока, ПризнакОрганизации1, "Организация:"));
				ПолученнаяСтрока = СокрЛП(СтрЗаменить(ПолученнаяСтрока, ПризнакОрганизации2, "Организация:"));
				
			КонецЕсли;			
		КонецЕсли;
			
		НовоеИнфоКонтакта = НовоеИнфоКонтакта + ?(ПустаяСтрока(НовоеИнфоКонтакта), "", ПереводСтроки) + ПолученнаяСтрока;
		НомерСтроки = НомерСтроки + 1;
	
	КонецЦикла;
		
	Возврат НовоеИнфоКонтакта;

КонецФункции

&НаСервере
Функция СформироватьТабличныйДокументНаСервере(МассивКонтактов)

	НачалоИмени		= "N;";
	Фотография		= "PHOTO;";
	ТаблицаСимволов	= ПолучитьТаблицуСимволов();
	ПереводСтроки	= Символы.ПС;
	ТочкаСЗапятой	= ";";
	Двоеточие		= ":";
	ПустаяКартинка	= Новый Картинка;
	ТаблицаКонтактныхДанных = ПолучитьТаблицуКонтактныхДанныхНаСервереБезКонтекста();

	ТаблицаКонтактов = Новый ТаблицаЗначений;
	ТаблицаКонтактов.Колонки.Добавить("ИмяКонтакта",  Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(200, ДопустимаяДлина.Переменная)));
	ТаблицаКонтактов.Колонки.Добавить("ИнфоКонтакта", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(0, ДопустимаяДлина.Переменная)));
	ТаблицаКонтактов.Колонки.Добавить("ФотоКонтакта", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(0, ДопустимаяДлина.Переменная)));
	ТаблицаКонтактов.Колонки.Добавить("КартинкаКонтакта");
	
	ТекущаяСтрокаТаблицыКонтактов = ЗагружаемыеКонтакты.Добавить();
	ТекущаяТаблицаКонтактов = ТекущаяСтрокаТаблицыКонтактов.Контакты;
	
	Для каждого ТекущийКонтакт Из МассивКонтактов Цикл
		
		ИмяКонтакта		= "";
		ИнфоКонтакта	= "";
		ФотоКонтакта	= "";
		
		Для каждого ТекЗапись Из ТекущийКонтакт Цикл
		
			Если СтрНайти(ТекЗапись, НачалоИмени) = 1 Тогда
				ТекЗапись = СтрЗаменить(ТекЗапись, НачалоИмени, "");
				КонвертироватьТекст(ТаблицаСимволов, ТекЗапись);
				ИмяКонтакта = СтрЗаменить(ТекЗапись, ТочкаСЗапятой, " ");
				Продолжить;
			КонецЕсли;
			
			Если СтрНайти(ТекЗапись, Фотография) > 0 Тогда
				ФотоКонтакта = ТекЗапись;
			ИначеЕсли НЕ ПустаяСтрока(ТекЗапись) Тогда
				КонвертироватьТекст(ТаблицаСимволов, ТекЗапись);
				ИнфоКонтакта = ИнфоКонтакта + ?(ПустаяСтрока(ИнфоКонтакта), "", ПереводСтроки) + ТекЗапись;
			КонецЕсли;
		
		КонецЦикла;
		
		НоваяСтрока = ТаблицаКонтактов.Добавить();
		НоваяСтрока.ИмяКонтакта  = ИмяКонтакта;
		НоваяСтрока.ИнфоКонтакта = ПроизвестиЗаменуКонтактныхДанныхНаСервереБезКонтекста(ТаблицаКонтактныхДанных, ИнфоКонтакта);
		НоваяСтрока.ФотоКонтакта = ФотоКонтакта;
		
		НоваяСтрока = ТекущаяТаблицаКонтактов.Добавить();
		НоваяСтрока.ИмяКонтакта = ИмяКонтакта;
		
	КонецЦикла;
	
	Для каждого СтрокаТаблицы Из ТаблицаКонтактов Цикл
		
		ФотоКонтакта = СтрокаТаблицы.ФотоКонтакта;
		
		Если ПустаяСтрока(ФотоКонтакта) Тогда
			Продолжить;
		КонецЕсли;
		
		ПозицияДвоеточия = СтрНайти(ФотоКонтакта, Двоеточие);
		
		Если ПозицияДвоеточия > 0 Тогда
			СтрокаBase64 = Сред(ФотоКонтакта, ПозицияДвоеточия + 1);
			ТекКартинка = Новый Картинка(Base64Значение(СтрокаBase64));
		Иначе
			ТекКартинка = ПустаяКартинка;
		КонецЕсли;
		
		СтрокаТаблицы.КартинкаКонтакта = ТекКартинка;
		
	КонецЦикла;
	
	ТаблицаКонтактов.Сортировать("ИмяКонтакта");
	
	ТабДокумент	= Новый ТабличныйДокумент;
	Макет		= РеквизитФормыВЗначение("Объект").ПолучитьМакет("ТаблицаКонтактов");
	
	Для каждого СтрокаТаблицы Из ТаблицаКонтактов Цикл
		
		ОбластьКонтакта = Макет.ПолучитьОбласть("ОбластьКонтакта");
		ОбластьКонтакта.Параметры.Заполнить(СтрокаТаблицы);
		
		Если СтрокаТаблицы.КартинкаКонтакта <> Неопределено Тогда
			ОбластьКонтакта.Рисунки.КартинкаКонтакта.Картинка = СтрокаТаблицы.КартинкаКонтакта;
		Иначе
			ОбластьКонтакта.Рисунки.Удалить(ОбластьКонтакта.Рисунки["КартинкаКонтакта"]);
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьКонтакта);
		
		Если СтрокаТаблицы.КартинкаКонтакта = Неопределено Тогда
			ТабДокумент.Область(ТабДокумент.ВысотаТаблицы, , ТабДокумент.ВысотаТаблицы).АвтоВысотаСтроки = Истина
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТабДокумент;

КонецФункции

&НаСервере
Функция СравнитьФайлыVCFНаСервере()

	ТабДокумент = Новый ТабличныйДокумент;
	КоличествоСтрок = ЗагружаемыеКонтакты.Количество()-1;
	
	Если КоличествоСтрок < 1 Тогда
		Возврат ТабДокумент;
	КонецЕсли;
	
	Если ИндексПервойТаблицы > КоличествоСтрок
		ИЛИ ИндексВторойТаблицы > КоличествоСтрок
	Тогда
		Возврат ТабДокумент;
	КонецЕсли;
	
	ТаблицаКонтактов1 = ЗагружаемыеКонтакты[ИндексПервойТаблицы].Контакты.Выгрузить();
	ТаблицаКонтактов2 = ЗагружаемыеКонтакты[ИндексВторойТаблицы].Контакты.Выгрузить();
	
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаКонтактов1.ИмяКонтакта КАК ИмяКонтакта
		|ПОМЕСТИТЬ ТК1
		|ИЗ
		|	&ТаблицаКонтактов1 КАК ТаблицаКонтактов1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаКонтактов2.ИмяКонтакта КАК ИмяКонтакта
		|ПОМЕСТИТЬ ТК2
		|ИЗ
		|	&ТаблицаКонтактов2 КАК ТаблицаКонтактов2
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(ТК1.ИмяКонтакта, """") КАК ИмяКонтакта1,
		|	ЕСТЬNULL(ТК2.ИмяКонтакта, """") КАК ИмяКонтакта2,
		|	ЕСТЬNULL(ТК2.ИмяКонтакта, ТК1.ИмяКонтакта) КАК ПолеСортировки
		|ПОМЕСТИТЬ Данные
		|ИЗ
		|	ТК1 КАК ТК1
		|		ПОЛНОЕ СОЕДИНЕНИЕ ТК2 КАК ТК2
		|		ПО ТК1.ИмяКонтакта = ТК2.ИмяКонтакта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Данные.ИмяКонтакта1 КАК ИмяКонтакта1,
		|	Данные.ИмяКонтакта2 КАК ИмяКонтакта2
		|ИЗ
		|	Данные КАК Данные
		|ГДЕ
		|	Данные.ИмяКонтакта1 <> Данные.ИмяКонтакта2
		|
		|УПОРЯДОЧИТЬ ПО
		|	Данные.ПолеСортировки";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ТаблицаКонтактов1", ТаблицаКонтактов1);
	Запрос.УстановитьПараметр("ТаблицаКонтактов2", ТаблицаКонтактов2);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат ТабДокумент;
	КонецЕсли;
	
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("СверяемыеКонтакты");
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОбластьСтрока = Макет.ПолучитьОбласть("ОбластьСтрока");
		ОбластьСтрока.Параметры.Заполнить(Выборка);
		ТабДокумент.Вывести(ОбластьСтрока);
	КонецЦикла;

	Возврат ТабДокумент;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьСписокВыбора(СписокВыбора)

	СписокВыбора.Очистить();
	
	КоличествоСтрок = ЗагружаемыеКонтакты.Количество()-1;
	
	Если КоличествоСтрок > 0 Тогда
		Элементы.ГруппаСверка.Видимость = Истина;
		ИндексВторойТаблицы = КоличествоСтрок;
	КонецЕсли;
	
	Для Сч = 0 По КоличествоСтрок Цикл
		СписокВыбора.Добавить(Сч, Сч);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
