#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
//	ФиксацияСверху       = Ложь;

	// Из схемы получаем настройки по умолчанию.
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	
	// Формируем макет с помощью компоновщика макета.
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	// Передаём в макет компоновки схему, настройки и данные расшифровки.
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);

	// Выполняем компоновку с помощью процессора компоновки. Для этого выполняем метод процессора компоновки данных Инициализировать().
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);

	// Выводим результат в табличный документ.
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	// Обозначим начало вывода
	ПроцессорВывода.НачатьВывод();
	
	// Получим следующий элемент результата компоновки
	ЭлементРезультата = ПроцессорКомпоновки.Следующий();
	
	// Основной цикл вывода отчета
	Пока ЭлементРезультата <> Неопределено Цикл
		
		//Если НЕ ФиксацияСверху И ЭлементРезультата.ЗначенияПараметров.Количество() > 0 Тогда
		//	ДокументРезультат.ФиксацияСверху = ДокументРезультат.ВысотаТаблицы;
		//	ФиксацияСверху = Истина;
		//КонецЕсли;

		// Элемент получен - выведем его при помощи процессора вывода
		ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);
			
		// Получим следующий элемент результата компоновки
		ЭлементРезультата = ПроцессорКомпоновки.Следующий();
		
	КонецЦикла;
	
	// Обозначим завершение вывода
	ПроцессорВывода.ЗакончитьВывод();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
