#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Фильмы.Ссылка КАК Фильм,
		|	Фильмы.Наименование + ВЫБОР
		|		КОГДА Фильмы.ОригинальноеНазвание = """"
		|			ТОГДА """"
		|		ИНАЧЕ "" ("" + Фильмы.ОригинальноеНазвание + "")""
		|	КОНЕЦ + ВЫБОР
		|		КОГДА Фильмы.Формат3D
		|			ТОГДА "" 3D""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Наименование,
		|	ВЫБОР
		|		КОГДА Фильмы.ЦифровойРелиз = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА Фильмы.ДатаВыхода
		|		ИНАЧЕ Фильмы.ЦифровойРелиз
		|	КОНЕЦ КАК ДатаРелиза,
		|	Фильмы.Афиша КАК Афиша,
		|	ВЫБОР
		|		КОГДА Фильмы.ЦифровойРелиз = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ПравилоСортировки
		|ПОМЕСТИТЬ Фильмы
		|ИЗ
		|	Справочник.Фильмы КАК Фильмы
		|ГДЕ
		|	Фильмы.НужноСкачать
		|	И НЕ Фильмы.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Аннотации.Владелец КАК Фильм,
		|	ВЫРАЗИТЬ(Аннотации.СодержаниеАннотации КАК СТРОКА(999)) КАК Аннотация
		|ИЗ
		|	Справочник.Аннотации КАК Аннотации
		|ГДЕ
		|	Аннотации.Владелец В
		|			(ВЫБРАТЬ
		|				Фильмы.Фильм КАК Фильм
		|			ИЗ
		|				Фильмы КАК Фильмы)
		|	И НЕ Аннотации.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Фильм
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтраныПроизводители.Фильм КАК Фильм,
		|	СтраныПроизводители.Страна.Представление КАК Страна
		|ИЗ
		|	РегистрСведений.СтраныПроизводители КАК СтраныПроизводители
		|ГДЕ
		|	СтраныПроизводители.Фильм В
		|			(ВЫБРАТЬ
		|				Фильмы.Фильм КАК Фильм
		|			ИЗ
		|				Фильмы КАК Фильмы)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Фильм
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЖанрыФильмов.Фильм КАК Фильм,
		|	ЖанрыФильмов.Жанр.Представление КАК Жанр
		|ИЗ
		|	РегистрСведений.ЖанрыФильмов КАК ЖанрыФильмов
		|ГДЕ
		|	ЖанрыФильмов.Фильм В
		|			(ВЫБРАТЬ
		|				Фильмы.Фильм КАК Фильм
		|			ИЗ
		|				Фильмы КАК Фильмы)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Фильм
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Фильмы.Фильм КАК Фильм,
		|	Фильмы.Наименование КАК Наименование,
		|	Фильмы.ДатаРелиза КАК ДатаРелиза,
		|	Фильмы.Фильм.ЦифровойРелиз КАК ЦифровойРелиз,
		|	Фильмы.Афиша КАК Афиша,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(999)) КАК Жанр,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(999)) КАК Страна,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(999)) КАК Аннотация,
		|	Фильмы.ПравилоСортировки КАК ПравилоСортировки
		|ИЗ
		|	Фильмы КАК Фильмы";
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	НаибольшийИндекс  = РезультатыЗапроса.ВГраница();
	ОснТаблицаДанных  = РезультатыЗапроса.Получить(НаибольшийИндекс).Выгрузить();
	СтруктураПолей    = Новый Структура("Жанр, Страна, Аннотация");
	СтруктураПоиска   = Новый Структура("Фильм");
	
	Для каждого СтрокаТаблицыДанных Из ОснТаблицаДанных Цикл
		
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТаблицыДанных);
		ТекущийИндекс = НаибольшийИндекс;
	
		Для каждого КлючИЗначение Из СтруктураПолей Цикл
			
			ТекущийИндекс   = ТекущийИндекс - 1;
			Выборка         = РезультатыЗапроса.Получить(ТекущийИндекс).Выбрать();
			ЗначениеКолонки = "";
			
			Пока Выборка.НайтиСледующий(СтруктураПоиска) Цикл
				ЗначениеКолонки = ЗначениеКолонки + ?(ПустаяСтрока(ЗначениеКолонки), "", ", ") + Выборка[КлючИЗначение.Ключ];
			КонецЦикла;
			 
			СтрокаТаблицыДанных[КлючИЗначение.Ключ] = ЗначениеКолонки;
			
		КонецЦикла;
	
	КонецЦикла;
	
	ВнешниеНаборыДанных = Новый Структура("НужноСкачать", ОснТаблицаДанных);
	КомпоновщикМакета   = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки     = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, СхемаКомпоновкиДанных.НастройкиПоУмолчанию, ДанныеРасшифровки);

	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
