
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)

	мНастройки = Отчет.КомпоновщикНастроек.Настройки;
	мНастройки.ДополнительныеСвойства.Вставить("КлючТекущегоВарианта", КлючТекущегоВарианта);
	мНастройки.ДополнительныеСвойства.Вставить("ПредставлениеТекущегоВарианта", ПредставлениеТекущегоВарианта);
	
	МеньшеЧем = Константы.МинимальныйРазмерИзображения.Получить() / 1024;
	ПараметрДанных = мНастройки.ПараметрыДанных.Элементы.Найти("МеньшеЧем");
	Если ПараметрДанных <> Неопределено Тогда
		ПараметрДанных.Значение = МеньшеЧем;
		ПользПараметр = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрДанных.ИдентификаторПользовательскойНастройки);
		Если ТипЗнч(ПользПараметр) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			ПользПараметр.Значение = МеньшеЧем;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
