
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВнешниеНаборыДанных = Новый Структура("ТаблицаIMDb", Отчеты.РейтингIMDb.ПолучитьТаблицуФильмовПоIMDb());
	КомпоновщикМакета   = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки     = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, СхемаКомпоновкиДанных.НастройкиПоУмолчанию, ДанныеРасшифровки);

	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	СоответствиеЗамены = Новый Соответствие;
	СоответствиеЗамены.Вставить("@Нет@", БиблиотекаКартинок.Остановить);
	СоответствиеЗамены.Вставить("@Да@", БиблиотекаКартинок.СоздатьЭлементСписка);
	
	Для каждого КлючИЗначение Из СоответствиеЗамены Цикл
		ОбластьЯчеек = ДокументРезультат.НайтиТекст(КлючИЗначение.Ключ);
		Пока ОбластьЯчеек <> Неопределено Цикл
			ОбластьЯчеек.Текст = "";
			ОбластьЯчеек.Картинка = КлючИЗначение.Значение;
			ОбластьЯчеек.РазмерКартинки = РазмерКартинки.АвтоРазмер;
			ОбластьЯчеек = ДокументРезультат.НайтиТекст(КлючИЗначение.Ключ);
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

