//Макет = Новый ТабличныйДокумент;
//Область = Макет.Область(1, 1);  // Получили ячейку
//Область.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Параметр; // Обозначили, что в ячейке находится параметр
//Область.Параметр = "Параметр1";  // Установили ячейке параметр
//Макет.Параметры.Параметр1 = 100;  // Установили значение параметра
//ЭлементыФормы.ПолеТабличногоДокумента1.Вывести(Макет); // Вывели макет со значением параметра в результирующий документ
//---
//БанковскийСчет = Новый(Тип("СправочникСсылка.БанковскиеСчета")); 
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ
&НаКлиенте
Перем ШаблоныТекста;
&НаКлиенте
Перем КартинкаВнимание32;
&НаКлиенте
Перем КартинкаОшибка32;
&НаКлиенте
Перем КартинкаИнформация32;
&НаКлиенте
Перем КартинкаВыполненоУспешно32;
&НаКлиенте
Перем ЗакрытиеРазрешено;
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заголовок
	УстановитьЗаголовокФормы();
	
	мКоманднаяПанель = Элементы.ФормаКоманднаяПанель;
	
	// Команды формы
	КомандаВыполнитьФрагментКода	= ДобавитьКомандуФормы("КомандаВыполнитьФрагментКода", "ВыполнитьФрагментКодаНаКлиенте", "Выполнить фрагмент кода");
	КомандаДобавитьКомментарий		= ДобавитьКомандуФормы("КомандаДобавитьКомментарий", "ДобавитьКомментарийНаКлиенте", "Добавить комментарий");
	КомандаУдалитьКомментарий		= ДобавитьКомандуФормы("КомандаУдалитьКомментарий", "УдалитьКомментарийНаКлиенте", "Удалить комментарий");
	КомандаКонструкторЗапроса		= ДобавитьКомандуФормы("КомандаКонструкторЗапроса", "КонструкторЗапросаНаКлиенте", "Конструктор запроса");
	КомандаЗакрытьФорму				= ДобавитьКомандуФормы("КомандаЗакрытьФорму", "ЗакрытьФормуНаКлиенте", "Закрыть");
	КомандаДобавитьПереносСтроки	= ДобавитьКомандуФормы("КомандаДобавитьПереносСтроки", "ДобавитьПереносСтрокиНаКлиенте", "Добавить перенос строки");
	КомандаУдалитьПереносСтроки		= ДобавитьКомандуФормы("КомандаУдалитьПереносСтроки", "УдалитьПереносСтрокиНаКлиенте", "Удалить перенос строки");
	КомандаДобавитьШаблонТекста		= ДобавитьКомандуФормы("КомандаДобавитьШаблонТекста", "ДобавитьШаблонТекстаНаКлиенте", "Добавить шаблон текста");
	
	// Первая кнопка формы
	КнопкаВыполнитьФрагментКода = ДобавитьКнопкуНаФорму(мКоманднаяПанель, "КнопкаВыполнитьФрагментКода", "КомандаВыполнитьФрагментКода",
														"Выполнить фрагмент кода", БиблиотекаКартинок.СформироватьОтчет);
	// Группы кнопок
	ГруппаКнопокКомментарий				= Элементы.Добавить("ГруппаКнопокКомментарий", Тип("ГруппаФормы"), мКоманднаяПанель);
	ГруппаКнопокКомментарий.Вид			= ВидГруппыФормы.Подменю;	
	ГруппаКнопокКомментарий.Заголовок	= "Комментарий";
	
	ГруппаКнопокПереносСтроки			= Элементы.Добавить("ГруппаКнопокПереносСтроки", Тип("ГруппаФормы"), мКоманднаяПанель);
	ГруппаКнопокПереносСтроки.Вид		= ВидГруппыФормы.Подменю;	
	ГруппаКнопокПереносСтроки.Заголовок	= "Перенос строки";

	// Кнопки формы
	КнопкаДобавитьКомментарий	= ДобавитьКнопкуНаФорму(ГруппаКнопокКомментарий, "КнопкаДобавитьКомментарий", "КомандаДобавитьКомментарий", "Добавить комментарий");
	КнопкаУдалитьКомментарий	= ДобавитьКнопкуНаФорму(ГруппаКнопокКомментарий, "КнопкаУдалитьКомментарий", "КомандаУдалитьКомментарий", "Удалить комментарий");
	КнопкаДобавитьПереносСтроки	= ДобавитьКнопкуНаФорму(ГруппаКнопокПереносСтроки, "КнопкаДобавитьПереносСтроки", "КомандаДобавитьПереносСтроки", "Добавить перенос строки");
	КнопкаУдалитьПереносСтроки	= ДобавитьКнопкуНаФорму(ГруппаКнопокПереносСтроки, "КнопкаУдалитьПереносСтроки", "КомандаУдалитьПереносСтроки", "Удалить перенос строки");
	КнопкаКонструкторЗапроса	= ДобавитьКнопкуНаФорму(мКоманднаяПанель, "КнопкаКонструкторЗапроса", "КомандаКонструкторЗапроса", "Конструктор запроса", БиблиотекаКартинок.КонструкторЗапроса);
	КнопкаКомандаДобавитьШаблонТекста = ДобавитьКнопкуНаФорму(мКоманднаяПанель, "КнопкаКомандаДобавитьШаблонТекста", "КомандаДобавитьШаблонТекста", "Шаблоны текста");
	КнопкаЗакрытьФорму			= ДобавитьКнопкуНаФорму(мКоманднаяПанель, "КнопкаЗакрытьФорму", "КомандаЗакрытьФорму", "Закрыть", БиблиотекаКартинок.Закрыть);
	
	// Реквизиты формы
    ДобавляемыеРеквизиты = Новый Массив;
    РеквизитФрагментКода = ДобавитьРеквизитФормы("ФрагментКода", Новый ОписаниеТипов("Строка"));
    ДобавляемыеРеквизиты.Добавить(РеквизитФрагментКода);
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ВыполнитьНаКлиенте", Новый ОписаниеТипов("Булево"), , НСтр("ru = 'Выполнить на клиенте'")));
    ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	// Элементы формы
    ЭлементФрагментКода = ДобавитьПолеВводаНаФорму(ЭтотОбъект, "ПолеВводаФрагментКода", Тип("ПолеФормы"),
													ВидПоляФормы.ПолеТекстовогоДокумента, "ФрагментКода", ПоложениеЗаголовкаЭлементаФормы.Нет);
	ЭлементФрагментКода.УстановитьДействие("ПриИзменении", "ПриИзмененииФрагментаКода");
	
	ВыполнитьНаКлиентеНаСервере = ДобавитьПолеВводаНаФорму(ЭтотОбъект, "ВыполнитьНаКлиенте", Тип("ПолеФормы"),
													ВидПоляФормы.ПолеФлажка, "ВыполнитьНаКлиенте", ПоложениеЗаголовкаЭлементаФормы.Право);
	
	// События формы
	УстановитьДействие("ПередЗакрытием", "ПередЗакрытием");
	УстановитьДействие("ПриОткрытии", "ПриОткрытии");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииФрагментаКода()

	ЭтотОбъект.Модифицированность = Истина;

КонецПроцедуры // ПриИзмененииФрагментаКода()

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ТекстВопроса = НСтр("ru = 'Код в окне был изменен. Продолжить?'");
	
	Если ЗавершениеРаботы = Неопределено И ТекстПредупреждения = Неопределено Тогда
		
		// Версия ниже 8.3.8
		Если ЗакрытиеРазрешено = Неопределено И ЭтотОбъект.Модифицированность Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
			Отказ = Истина;
		КонецЕсли;

	Иначе
	
		Если ЗавершениеРаботы И ЭтотОбъект.Модифицированность Тогда
			ТекстПредупреждения = ТекстВопроса;
			Отказ = Истина;
		ИначеЕсли ЗакрытиеРазрешено = Неопределено И ЭтотОбъект.Модифицированность Тогда
			ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
    Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗакрытиеРазрешено = Истина;
		Закрыть();			
    КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПроинициализироватьПеременные();

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ УПРАВЛЕНИЯ ВНЕШНИМ ВИДОМ ФОРМЫ

&НаСервере
Процедура УстановитьЗаголовокФормы()
	
	ЭтотОбъект.АвтоЗаголовок = Ложь;
	ЭтотОбъект.Заголовок = РеквизитФормыВЗначение("Объект").Метаданные().Синоним;
	
КонецПроцедуры // ПолучитьЗаголовокФормы()

&НаСервере
Функция ПолучитьКартинкуИзМакетаНаСервере(ИмяМакета)

	ДвоичныеДанные = РеквизитФормыВЗначение("Объект").ПолучитьМакет(ИмяМакета);
	
	Картинка = Новый Картинка(ДвоичныеДанные);
	
	Возврат Картинка;

КонецФункции // ПолучитьКартинкуИзМакетаНаСервере()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ ФОРМЫ

&НаКлиенте
Процедура ЗакрытьФормуНаКлиенте()

	ЭтотОбъект.Закрыть();

КонецПроцедуры // ЗакрытьФормуНаКлиенте()

&НаКлиенте
Процедура КонструкторЗапросаНаКлиенте()

	#Если ТолстыйКлиентУправляемоеПриложение Тогда
		мКонструкторЗапроса = Новый КонструкторЗапроса;
		Если мКонструкторЗапроса.ОткрытьМодально() Тогда
			ТекстЗапроса = мКонструкторЗапроса.Текст;
			Если НЕ ПустаяСтрока(ТекстЗапроса) Тогда
				ДобавитьЗапросВНачалоНаКлиенте(ТекстЗапроса);
			КонецЕсли;
		КонецЕсли;
	#Иначе
		ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ПослеЗакрытияДиалогаКонструктораЗапроса", ЭтотОбъект);
		мКонструкторЗапроса = Новый КонструкторЗапроса;
		мКонструкторЗапроса.Показать(ОписаниеОповещенияОЗакрытии);
	#КонецЕсли

КонецПроцедуры // КонструкторЗапросаНаКлиенте()

&НаКлиенте
Процедура ПослеЗакрытияДиалогаКонструктораЗапроса(ТекстЗапроса, ДополнительныеПараметры) Экспорт

	Если ТекстЗапроса <> Неопределено И НЕ ПустаяСтрока(ТекстЗапроса) Тогда
		ДобавитьЗапросВНачалоНаКлиенте(ТекстЗапроса);
	КонецЕсли;

КонецПроцедуры // ПослеЗакрытияДиалогаКонструктораЗапроса()

&НаКлиенте
Процедура УдалитьСимволНаКлиенте(мСимвол = "")
	
	Если ПустаяСтрока(мСимвол) Тогда
		Возврат;
	КонецЕсли;

	ВыделенныйТекст = Элементы.ПолеВводаФрагментКода.ВыделенныйТекст;
	ВесьТекст		= ЭтотОбъект.ФрагментКода;

	Если ПустаяСтрока(ВыделенныйТекст) Тогда
		ЭтотОбъект.ФрагментКода = СтрЗаменить(ВесьТекст, мСимвол, "");
	Иначе
		ЭтотОбъект.ФрагментКода = СтрЗаменить(ВесьТекст, ВыделенныйТекст, СтрЗаменить(ВыделенныйТекст, мСимвол, ""));
	КонецЕсли;

КонецПроцедуры // УдалитьСимволНаКлиенте()

&НаКлиенте
Процедура ДобавитьСимволНаКлиенте(мСимвол)

	ВыделенныйТекст = Элементы.ПолеВводаФрагментКода.ВыделенныйТекст;
	ВесьТекст		= ЭтотОбъект.ФрагментКода;
	
	Если ПустаяСтрока(ВыделенныйТекст) Тогда
		КомментируемыйТекст = ВесьТекст;
	Иначе
		КомментируемыйТекст = ВыделенныйТекст;
	КонецЕсли;
	
	КоличествоСтрокТекста	= СтрЧислоСтрок(КомментируемыйТекст);
	ТекстСКомментариями		= "";
	Для Сч = 1 По КоличествоСтрокТекста Цикл
		ТекстСКомментариями = ТекстСКомментариями + мСимвол + СтрПолучитьСтроку(КомментируемыйТекст, Сч) + Символы.ПС;
	КонецЦикла;
	
	Если ПустаяСтрока(ВыделенныйТекст) Тогда
		ЭтотОбъект.ФрагментКода = ТекстСКомментариями;
	Иначе
		ЭтотОбъект.ФрагментКода = СтрЗаменить(ЭтотОбъект.ФрагментКода, ВыделенныйТекст, ТекстСКомментариями);
	КонецЕсли;

КонецПроцедуры // ДобавитьСимволНаКлиенте()

&НаКлиенте
Процедура УдалитьКомментарийНаКлиенте()
	
	УдалитьСимволНаКлиенте("//");
	
КонецПроцедуры // УдалитьКомментарийНаКлиенте()

&НаКлиенте
Процедура ДобавитьКомментарийНаКлиенте()
	
	ДобавитьСимволНаКлиенте("//");
	
КонецПроцедуры // ДобавитьКомментарийНаКлиенте()

&НаКлиенте
Процедура ДобавитьПереносСтрокиНаКлиенте()

	ДобавитьСимволНаКлиенте("|");

КонецПроцедуры // ДобавитьПереносСтрокиНаКлиенте()

&НаКлиенте
Процедура УдалитьПереносСтрокиНаКлиенте()

	УдалитьСимволНаКлиенте("|");

КонецПроцедуры // УдалитьПереносСтрокиНаКлиенте()

&НаКлиенте
Процедура ВыполнитьФрагментКодаНаКлиенте()

	мФрагментКода = ЭтотОбъект.ФрагментКода;
	
	Если ПустаяСтрока(мФрагментКода) Тогда
		ПоказатьОповещениеПользователя("Отсутствует выполняемый код", , "В поле ввода отсутствует код!", КартинкаВнимание32);
	КонецЕсли;
	
	Отказ = Ложь;
	
	Если ЭтотОбъект.ВыполнитьНаКлиенте Тогда
		Попытка
		    Выполнить(мФрагментКода);
		Исключение
			Отказ = Истина;
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	Иначе
		ВыполнитьФрагментКодаНаСервере(мФрагментКода, Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		ПоказатьОповещениеПользователя("Результат:", , "Ошибка выполнения кода!", КартинкаОшибка32);
	Иначе
		ПоказатьОповещениеПользователя("Результат:", , "Код выполнен успешно!", КартинкаВыполненоУспешно32);
	КонецЕсли;

КонецПроцедуры // ВыполнитьФрагментКодаНаСервере()

&НаСервереБезКонтекста
Процедура ВыполнитьФрагментКодаНаСервере(ФрагментКода, Отказ)

	Попытка
	    Выполнить(ФрагментКода);
	Исключение
		Отказ = Истина;
		Сообщить(ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры // ВыполнитьФрагментКодаНаСервере()

&НаКлиенте
Процедура ДобавитьЗапросВНачалоНаКлиенте(мТекстЗапроса)

	ПараметрыЗапроса	= "";
	мТекстЗапроса		= СтрЗаменить(мТекстЗапроса, """", """""");
	
	ФрагментКогда = "Запрос = Новый Запрос(" + Символы.ПС + Символы.Таб + """";
	
	ЧислоСтрок = СтрЧислоСтрок(мТекстЗапроса);
	
	Для Сч = 1 По ЧислоСтрок Цикл
		
		Если Сч > 1 Тогда
			ФрагментКогда = ФрагментКогда + Символы.Таб + "|";
		КонецЕсли;
		
		текСтрока = СтрПолучитьСтроку(мТекстЗапроса, Сч);
		
		ФрагментКогда = ФрагментКогда + текСтрока;
		
		Если НЕ Найти(текСтрока, "&") = 0 Тогда
			ДобавитьПараметрыЗапроса(текСтрока, ПараметрыЗапроса);
		КонецЕсли;		
		
		Если НЕ Сч = ЧислоСтрок Тогда
			ФрагментКогда = ФрагментКогда + Символы.ПС;
		КонецЕсли;
	
	КонецЦикла;
	
	ФрагментКогда = ФрагментКогда + """);";
	
	Если Не ПустаяСтрока(ПараметрыЗапроса) Тогда
		ФрагментКогда = ФрагментКогда + Символы.ПС + Символы.ПС + ПараметрыЗапроса;
	КонецЕсли;
	
	ФрагментКогда = ФрагментКогда + Символы.ПС + "Выборка = Запрос.Выполнить().Выбрать();" + Символы.ПС
					+ "Пока Выборка.Следующий() Цикл" + Символы.ПС + "КонецЦикла;";
	
	ВесьТекст = ЭтотОбъект.ФрагментКода;
	Если ПустаяСтрока(ВесьТекст) Тогда
		ЭтотОбъект.ФрагментКода = ФрагментКогда;
	Иначе
		ТекстВопроса = "Поле ""Фрагмент кода"" не пустое." + Символы.ПС + "Заменить текстом запроса?";
		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеЗакрытияОкнаВводаЗначения", ЭтотОбъект, Новый Структура("ФрагментКогда, ВесьТекст", ФрагментКогда, ВесьТекст)), ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Нет, , КодВозвратаДиалога.Нет);
	КонецЕсли;
	
КонецПроцедуры // ДобавитьЗапросВНачалоНаКлиенте()

&НаКлиенте
Процедура ПослеЗакрытияОкнаВводаЗначения(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЭтотОбъект.ФрагментКода = ДополнительныеПараметры.ФрагментКогда;
	Иначе
		ЭтотОбъект.ФрагментКода = ДополнительныеПараметры.ФрагментКогда + Символы.ПС + "//////////////////////" + Символы.ПС + ДополнительныеПараметры.ВесьТекст;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПараметрыЗапроса(текСтрока, ПараметрыЗапроса)
	
	Амперсенд = Найти(текСтрока, "&");
	
	тПараметр = Сред(текСтрока, Амперсенд + 1);
	
	ПараметрыЗапроса = ПараметрыЗапроса + "Запрос.УстановитьПараметр(""" + тПараметр + """, " + тПараметр + ");" + Символы.ПС;

КонецПроцедуры // ДобавитьПараметрыЗапроса()

&НаКлиенте
Процедура ПослеЗакрытияОкнаВводаСтроки(ВведенноеЗначение, ДополнительныеПараметры) Экспорт

	Если ВведенноеЗначение <> Неопределено Тогда
		
		ВыбранныйШаблон			= ДополнительныеПараметры.ВыбранныйШаблон;
		мВыражениеПоУмолчанию	= "<" + ДополнительныеПараметры.ВыражениеПоУмолчанию + ">";
		ДобавляемаяСтрока		= "";
	
		Если ПустаяСтрока(ВведенноеЗначение) Тогда
			мВведенноеЗначение = мВыражениеПоУмолчанию;
		Иначе
			мВведенноеЗначение = ВведенноеЗначение;
		КонецЕсли;
		
		Если ВыбранныйШаблон = "Если" Тогда
			ДобавляемаяСтрока = "Если " + мВведенноеЗначение + " Тогда" + Символы.ПС + "КонецЕсли;" + Символы.ПС;
		ИначеЕсли ВыбранныйШаблон = "ЕслиИначе" Тогда
			ДобавляемаяСтрока = "Если " + мВведенноеЗначение + " Тогда" + Символы.ПС + "Иначе" + Символы.ПС + "КонецЕсли;" + Символы.ПС;
		ИначеЕсли ВыбранныйШаблон = "Пока" Тогда
			ДобавляемаяСтрока = "Пока " + мВведенноеЗначение + " Цикл" + Символы.ПС + "КонецЦикла;" + Символы.ПС;
		ИначеЕсли ВыбранныйШаблон = "Для" Тогда
			ДобавляемаяСтрока = "Для Сч = 1 По " + мВведенноеЗначение + " Цикл" + Символы.ПС + "КонецЦикла;" + Символы.ПС;
		ИначеЕсли ВыбранныйШаблон = "ДляКаждого" Тогда
			ПервоеВведенноеЗначение = "";
			Если ДополнительныеПараметры.Свойство("ПервоеВведенноеЗначение", ПервоеВведенноеЗначение) Тогда
				ДобавляемаяСтрока = "Для каждого " + ПервоеВведенноеЗначение + " Из " + мВведенноеЗначение + " Цикл" + Символы.ПС + "КонецЦикла;" + Символы.ПС;
			Иначе
				ДополнительныеПараметры.Вставить("ПервоеВведенноеЗначение", мВведенноеЗначение);
				ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ПослеЗакрытияОкнаВводаСтроки", ЭтотОбъект, ДополнительныеПараметры);
				ПоказатьВводСтроки(ОписаниеОповещенияОЗавершении, "Коллекция", "Коллекция", , Ложь);
				Возврат;
			КонецЕсли;
		КонецЕсли;			
	
		ЭтотОбъект.ФрагментКода = ДополнительныеПараметры.ФрагментКогда + ДобавляемаяСтрока;
		Если НЕ ЭтотОбъект.Модифицированность Тогда
			ЭтотОбъект.Модифицированность = Истина;
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры // ПолучитьВыражениеПользователя()

&НаКлиенте
Процедура ДобавитьШаблонТекстаНаКлиенте(Команда)
	
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ПослеЗакрытияДиалогаВыбораЭлемента", ЭтотОбъект);
	ШаблоныТекста.ПоказатьВыборЭлемента(ОписаниеОповещенияОЗакрытии, , ШаблоныТекста[0]);
	
КонецПроцедуры // ДобавитьШаблонТекстаНаКлиенте()

&НаКлиенте
Процедура ПослеЗакрытияДиалогаВыбораЭлемента(ВыбранныйЭлемент, ДополнительныйПараметр) Экспорт

	Если НЕ ВыбранныйЭлемент = Неопределено Тогда
		
		ВыбранныйШаблон = ВыбранныйЭлемент.Значение;
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ДобавляемаяСтрока", "");
		ДополнительныеПараметры.Вставить("ФрагментКогда", ЭтотОбъект.ФрагментКода);
		ДополнительныеПараметры.Вставить("ВыбранныйШаблон", ВыбранныйШаблон);
		
		Подсказка = "Условие";
		ВыражениеПоУмолчанию = "Выражение";
		
		Если ВыбранныйШаблон = "Для" Тогда
			Подсказка = "Ограничение";
			ВыражениеПоУмолчанию = "Ограничение";
		ИначеЕсли ВыбранныйШаблон = "ДляКаждого" Тогда
			Подсказка = "Переменная";
			ВыражениеПоУмолчанию = "Переменная";
		КонецЕсли;
		
		ДополнительныеПараметры.Вставить("ВыражениеПоУмолчанию", ВыражениеПоУмолчанию);
		
		ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ПослеЗакрытияОкнаВводаСтроки", ЭтотОбъект, ДополнительныеПараметры);
		
		ПоказатьВводСтроки(ОписаниеОповещенияОЗавершении, ВыражениеПоУмолчанию, Подсказка, , Ложь);
		
	КонецЕсли;

КонецПроцедуры // ПослеЗакрытияДиалогаВыбораЭлемента()

&НаКлиенте
Процедура ПроинициализироватьПеременные()

	КартинкаВнимание32			= ПолучитьКартинкуИзМакетаНаСервере("Внимание32");
	КартинкаОшибка32			= ПолучитьКартинкуИзМакетаНаСервере("Ошибка32");
	КартинкаИнформация32		= ПолучитьКартинкуИзМакетаНаСервере("Информация32");
	КартинкаВыполненоУспешно32	= ПолучитьКартинкуИзМакетаНаСервере("ВыполненоУспешно32");

	ШаблоныТекста = Новый СписокЗначений;
	ШаблоныТекста.Добавить("Если", "Если (Если)");
	ШаблоныТекста.Добавить("ЕслиИначе", "ЕслиИначе (Если)");
	ШаблоныТекста.Добавить("Пока", "Пока (Пока)");
	ШаблоныТекста.Добавить("Для", "Для (Для)");
	ШаблоныТекста.Добавить("ДляКаждого", "Для каждого (Для[ Каждого])");

КонецПроцедуры // ПроинициализироватьПеременные()

//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\
//\\//\\//\\//\\//\\//\\   УНИВЕРСАЛЬНЫЕ ПРОЦЕДУРЫ ДОБАВЛЕНИЯ ЭЛЕМЕНТОВ И РЕКВИЗИТОВ НА ФОРМУ   //\\//\\//\\//\\//\\//\\
//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\

&НаСервере
Функция ДобавитьКнопкуНаФорму(Родитель, ИмяКнопкиФормы, ИмяКоманды, мЗаголовок = "Кнопка", Картинка = Неопределено)

	мКнопкаФормы = Элементы.Добавить(ИмяКнопкиФормы, Тип("КнопкаФормы"), Родитель);
	мКнопкаФормы.Заголовок	= мЗаголовок;
	мКнопкаФормы.ИмяКоманды	= ИмяКоманды;
	Если ТипЗнч(Картинка) = Тип("Картинка") Тогда
		мКнопкаФормы.Отображение = ОтображениеКнопки.КартинкаИТекст;
		мКнопкаФормы.Картинка	= Картинка;
	КонецЕсли;
	
	Возврат мКнопкаФормы;

КонецФункции // ДобавитьКнопкуНаФорму()

&НаСервере
Функция ДобавитьКомандуФормы(ИмяКоманды, ИмяПроцедурыОбработчика, мЗаголовок = "Команда")

	мКомандаФормы = Команды.Добавить(ИмяКоманды);
	мКомандаФормы.Действие	= ИмяПроцедурыОбработчика;
	мКомандаФормы.Заголовок	= мЗаголовок;
	
	Возврат мКомандаФормы;

КонецФункции // ДобавитьКомандуФормы()

&НаСервере
Функция ДобавитьРеквизитФормы(ИмяРеквизита, ТипРеквизита)

    мРеквизитФормы = Новый РеквизитФормы(ИмяРеквизита, ТипРеквизита);
	
	Возврат мРеквизитФормы;

КонецФункции // ДобавитьРеквизитФормы()

&НаСервере
Функция ДобавитьПолеВводаНаФорму(Родитель, ИмяЭлемента, ТипЭлемента, ВидПоля, ПутьКДанным, ПоложениеЗаголовка)

    мПолеВвода = Элементы.Добавить(ИмяЭлемента, ТипЭлемента, Родитель);
    мПолеВвода.Вид = ВидПоля;
	мПолеВвода.ПутьКДанным = ПутьКДанным;
	мПолеВвода.ПоложениеЗаголовка = ПоложениеЗаголовка;
	
	Возврат мПолеВвода;

КонецФункции // ДобавитьПолеВводаНаФорму()
