
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФайлVCFНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "Документ (*.vcf)|*.vcf";
	Диалог.Показать(Новый ОписаниеОповещения("ПослеЗакрытияДиалогаВыбора", ЭтотОбъект));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеЗакрытияДиалогаВыбора(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт

	Если ТипЗнч(ВыбранныеФайлы) = Тип("Массив") И ВыбранныеФайлы.Количество() > 0 Тогда
		
		ТекущийФайл  = Новый Файл(ВыбранныеФайлы.Получить(0));
		ДокТекст     = Новый ТекстовыйДокумент;
		ДопПараметры = Новый Структура("ТекущийФайл, ИмяФайла, ДокТекст", ТекущийФайл, ТекущийФайл.Имя, ДокТекст);
		Описание     = Новый ОписаниеОповещения("ПослеЗавершенияЧтенияФайла", ЭтотОбъект, ДопПараметры, "ПриВозникновенииОшибкиФайла", ЭтотОбъект);
		ДокТекст.НачатьЧтение(Описание, ТекущийФайл.ПолноеИмя, КодировкаТекста.UTF8);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриВозникновенииОшибкиФайла(ИнфоОбОшибке, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Причина = ?(ИнфоОбОшибке.Причина <> Неопределено, ИнфоОбОшибке.Причина.Описание, ИнфоОбОшибке.Описание);
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = СтрШаблон(НСтр("ru = 'Ошибка при работе с файлом <%1>; по причине: <%2>.'"), ДополнительныеПараметры.ИмяФайла, Причина);;
	Сообщение.Сообщить();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗавершенияЧтенияФайла(ДополнительныеПараметры) Экспорт
	
	ДокТекст		= ДополнительныеПараметры.ДокТекст;
	НовыйТекстДок   = Новый ТекстовыйДокумент;
	МассивСтрок		= Новый Массив;
	ИндексСтрок		= ДокТекст.КоличествоСтрок();
	
	Пока ИндексСтрок > 0 Цикл
		ТекСтрока = ДокТекст.ПолучитьСтроку(ИндексСтрок);
		Если Лев(ТекСтрока, 1) = "=" Тогда
			МассивСтрок.Очистить();
			МассивСтрок.Вставить(0, ТекСтрока);
			Пока СтрНайти(ТекСтрока, "QUOTED-PRINTABLE") = 0 Цикл
				ИндексСтрок = ИндексСтрок - 1;
				ТекСтрока = ДокТекст.ПолучитьСтроку(ИндексСтрок);
				МассивСтрок.Вставить(0, ТекСтрока);
			КонецЦикла;
			ТекСтрока = СтрСоединить(МассивСтрок);
			ТекСтрока = СтрЗаменить(ТекСтрока, "==", "=");
		КонецЕсли;
		НовыйТекстДок.ВставитьСтроку(1, ТекСтрока);
		ИндексСтрок = ИндексСтрок - 1;
	КонецЦикла;

	СоответствиеСимволов = ПолучитьСоответствиеСимволов();
	НоваяСтрокаСТекстом  = НовыйТекстДок.ПолучитьТекст();
	Для каждого КлючИЗначение Из СоответствиеСимволов Цикл
		НоваяСтрокаСТекстом = СтрЗаменить(НоваяСтрокаСТекстом, КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	НовыйТекстДок.УстановитьТекст(НоваяСтрокаСТекстом);
	
	ЧислоСтрок  = НовыйТекстДок.КоличествоСтрок();
	ИндексСтрок = 1;
	Пока ЧислоСтрок > ИндексСтрок Цикл
		ТекСтрока = НовыйТекстДок.ПолучитьСтроку(ИндексСтрок);
		Если СтрНайти(ТекСтрока, "QUOTED-PRINTABLE") > 0 Тогда
			Если Прав(ТекСтрока, 1) = "=" Тогда
				ТекСтрока = Лев(ТекСтрока, СтрДлина(ТекСтрока)-1);
				НовыйТекстДок.ЗаменитьСтроку(ИндексСтрок, ТекСтрока);
				Если ПустаяСтрока(НовыйТекстДок.ПолучитьСтроку(ИндексСтрок + 1)) Тогда
					НовыйТекстДок.УдалитьСтроку(ИндексСтрок + 1);
					ЧислоСтрок = ЧислоСтрок - 1;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		ИндексСтрок = ИндексСтрок + 1;
	КонецЦикла;
	
	СтрокаСТекстом = НовыйТекстДок.ПолучитьТекст();
	СтрокаСТекстом = СтрЗаменить(СтрокаСТекстом, ";ENCODING=QUOTED-PRINTABLE", "");
	
	ТекущийФайл  = ДополнительныеПараметры.ТекущийФайл;
	ИмяФайла     = ТекущийФайл.ИмяБезРасширения + "-2" + ТекущийФайл.Расширение;
	ПолноеИмя    = ТекущийФайл.Путь + ИмяФайла;
	ДопПараметры = Новый Структура("ИмяФайла", ИмяФайла);
	Описание     = Новый ОписаниеОповещения(Неопределено, Неопределено, ДопПараметры, "ПриВозникновенииОшибкиФайла", ЭтотОбъект);
	
	НовыйТекстДок.Очистить();
	НовыйТекстДок.УстановитьТекст(СтрокаСТекстом);
	НовыйТекстДок.НачатьЗапись(Описание, ПолноеИмя, КодировкаТекста.UTF8);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьСоответствиеСимволов()

	СоответствиеСимволов = Новый Соответствие;
	
	СоответствиеСимволов.Вставить("=D0=90", "А");
	СоответствиеСимволов.Вставить("=D0=91", "Б");
	СоответствиеСимволов.Вставить("=D0=92", "В");
	СоответствиеСимволов.Вставить("=D0=93", "Г");
	СоответствиеСимволов.Вставить("=D0=94", "Д");
	СоответствиеСимволов.Вставить("=D0=95", "Е");
	СоответствиеСимволов.Вставить("=D0=96", "Ж");
	СоответствиеСимволов.Вставить("=D0=97", "З");
	СоответствиеСимволов.Вставить("=D0=98", "И");
	СоответствиеСимволов.Вставить("=D0=99", "Й");
	СоответствиеСимволов.Вставить("=D0=9A", "К");
	СоответствиеСимволов.Вставить("=D0=9B", "Л");
	СоответствиеСимволов.Вставить("=D0=9C", "М");
	СоответствиеСимволов.Вставить("=D0=9D", "Н");
	СоответствиеСимволов.Вставить("=D0=9E", "О");
	СоответствиеСимволов.Вставить("=D0=9F", "П");
	СоответствиеСимволов.Вставить("=D0=A0", "Р");
	СоответствиеСимволов.Вставить("=D0=A1", "С");
	СоответствиеСимволов.Вставить("=D0=A2", "Т");
	СоответствиеСимволов.Вставить("=D0=A3", "У");
	СоответствиеСимволов.Вставить("=D0=A4", "Ф");
	СоответствиеСимволов.Вставить("=D0=A5", "Х");
	СоответствиеСимволов.Вставить("=D0=A6", "Ц");
	СоответствиеСимволов.Вставить("=D0=A7", "Ч");
	СоответствиеСимволов.Вставить("=D0=A8", "Ш");
	СоответствиеСимволов.Вставить("=D0=A9", "Щ");
	СоответствиеСимволов.Вставить("=D0=AA", "Ъ");
	СоответствиеСимволов.Вставить("=D0=AB", "Ы");
	СоответствиеСимволов.Вставить("=D0=AC", "Ь");
	СоответствиеСимволов.Вставить("=D0=AD", "Э");
	СоответствиеСимволов.Вставить("=D0=AE", "Ю");
	СоответствиеСимволов.Вставить("=D0=AF", "Я");
	СоответствиеСимволов.Вставить("=D0=B0", "а");
	СоответствиеСимволов.Вставить("=D0=B1", "б");
	СоответствиеСимволов.Вставить("=D0=B2", "в");
	СоответствиеСимволов.Вставить("=D0=B3", "г");
	СоответствиеСимволов.Вставить("=D0=B4", "д");
	СоответствиеСимволов.Вставить("=D0=B5", "е");
	СоответствиеСимволов.Вставить("=D0=B6", "ж");
	СоответствиеСимволов.Вставить("=D0=B7", "з");
	СоответствиеСимволов.Вставить("=D0=B8", "и");
	СоответствиеСимволов.Вставить("=D0=B9", "й");
	СоответствиеСимволов.Вставить("=D0=BA", "к");
	СоответствиеСимволов.Вставить("=D0=BB", "л");
	СоответствиеСимволов.Вставить("=D0=BC", "м");
	СоответствиеСимволов.Вставить("=D0=BD", "н");
	СоответствиеСимволов.Вставить("=D0=BE", "о");
	СоответствиеСимволов.Вставить("=D0=BF", "п");
	СоответствиеСимволов.Вставить("=D1=80", "р");
	СоответствиеСимволов.Вставить("=D1=81", "с");
	СоответствиеСимволов.Вставить("=D1=82", "т");
	СоответствиеСимволов.Вставить("=D1=83", "у");
	СоответствиеСимволов.Вставить("=D1=84", "ф");
	СоответствиеСимволов.Вставить("=D1=85", "х");
	СоответствиеСимволов.Вставить("=D1=86", "ц");
	СоответствиеСимволов.Вставить("=D1=87", "ч");
	СоответствиеСимволов.Вставить("=D1=88", "ш");
	СоответствиеСимволов.Вставить("=D1=89", "щ");
	СоответствиеСимволов.Вставить("=D1=8A", "ъ");
	СоответствиеСимволов.Вставить("=D1=8B", "ы");
	СоответствиеСимволов.Вставить("=D1=8C", "ь");
	СоответствиеСимволов.Вставить("=D1=8D", "э");
	СоответствиеСимволов.Вставить("=D1=8E", "ю");
	СоответствиеСимволов.Вставить("=D1=8F", "я");
	
	СоответствиеСимволов.Вставить("=0A", Символы.ПС);
	СоответствиеСимволов.Вставить("=20", " ");
	СоответствиеСимволов.Вставить("=2A", "*");
	СоответствиеСимволов.Вставить("=2B", "+");
	СоответствиеСимволов.Вставить("=2C", ",");
	СоответствиеСимволов.Вставить("=2D", "-");
	СоответствиеСимволов.Вставить("=2E", ".");
	СоответствиеСимволов.Вставить("=2F", "/");
	СоответствиеСимволов.Вставить("=30", "0");
	СоответствиеСимволов.Вставить("=31", "1");
	СоответствиеСимволов.Вставить("=32", "2");
	СоответствиеСимволов.Вставить("=33", "3");
	СоответствиеСимволов.Вставить("=34", "4");
	СоответствиеСимволов.Вставить("=35", "5");
	СоответствиеСимволов.Вставить("=36", "6");
	СоответствиеСимволов.Вставить("=37", "7");
	СоответствиеСимволов.Вставить("=38", "8");
	СоответствиеСимволов.Вставить("=39", "9");
	СоответствиеСимволов.Вставить("=3A", ":");
	СоответствиеСимволов.Вставить("=3B", ";");
	СоответствиеСимволов.Вставить("=3C", "<");
	СоответствиеСимволов.Вставить("=3D", "=");
	СоответствиеСимволов.Вставить("=3E", ">");
	СоответствиеСимволов.Вставить("=3F", "?");
	СоответствиеСимволов.Вставить("=40", "@");
	
	СоответствиеСимволов.Вставить("=41", "A");
	СоответствиеСимволов.Вставить("=42", "B");
	СоответствиеСимволов.Вставить("=43", "C");
	СоответствиеСимволов.Вставить("=44", "D");
	СоответствиеСимволов.Вставить("=45", "E");
	СоответствиеСимволов.Вставить("=46", "F");
	СоответствиеСимволов.Вставить("=47", "G");
	СоответствиеСимволов.Вставить("=48", "H");
	СоответствиеСимволов.Вставить("=49", "I");
	СоответствиеСимволов.Вставить("=4A", "J");
	СоответствиеСимволов.Вставить("=4B", "K");
	СоответствиеСимволов.Вставить("=4C", "L");
	СоответствиеСимволов.Вставить("=4D", "M");
	СоответствиеСимволов.Вставить("=4E", "N");
	СоответствиеСимволов.Вставить("=4F", "O");
	СоответствиеСимволов.Вставить("=50", "P");
	СоответствиеСимволов.Вставить("=51", "Q");
	СоответствиеСимволов.Вставить("=52", "R");
	СоответствиеСимволов.Вставить("=53", "S");
	СоответствиеСимволов.Вставить("=54", "T");
	СоответствиеСимволов.Вставить("=55", "U");
	СоответствиеСимволов.Вставить("=56", "V");
	СоответствиеСимволов.Вставить("=57", "W");
	СоответствиеСимволов.Вставить("=58", "X");
	СоответствиеСимволов.Вставить("=59", "Y");
	СоответствиеСимволов.Вставить("=5A", "Z");
	СоответствиеСимволов.Вставить("=61", "a");
	СоответствиеСимволов.Вставить("=62", "b");
	СоответствиеСимволов.Вставить("=63", "c");
	СоответствиеСимволов.Вставить("=64", "d");
	СоответствиеСимволов.Вставить("=65", "e");
	СоответствиеСимволов.Вставить("=66", "f");
	СоответствиеСимволов.Вставить("=67", "g");
	СоответствиеСимволов.Вставить("=68", "h");
	СоответствиеСимволов.Вставить("=69", "i");
	СоответствиеСимволов.Вставить("=6A", "j");
	СоответствиеСимволов.Вставить("=6B", "k");
	СоответствиеСимволов.Вставить("=6C", "k");
	СоответствиеСимволов.Вставить("=6D", "m");
	СоответствиеСимволов.Вставить("=6E", "n");
	СоответствиеСимволов.Вставить("=6F", "o");
	СоответствиеСимволов.Вставить("=70", "p");
	СоответствиеСимволов.Вставить("=71", "q");
	СоответствиеСимволов.Вставить("=72", "r");
	СоответствиеСимволов.Вставить("=73", "s");
	СоответствиеСимволов.Вставить("=74", "t");
	СоответствиеСимволов.Вставить("=75", "u");
	СоответствиеСимволов.Вставить("=76", "v");
	СоответствиеСимволов.Вставить("=77", "w");
	СоответствиеСимволов.Вставить("=78", "x");
	СоответствиеСимволов.Вставить("=79", "y");
	СоответствиеСимволов.Вставить("=7A", "z");

	СоответствиеСимволов.Вставить("=7B", "{");
	СоответствиеСимволов.Вставить("=7C", "|");
	СоответствиеСимволов.Вставить("=7D", "}");
	
	Возврат СоответствиеСимволов;

КонецФункции

#КонецОбласти
