#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("Период") Тогда
		Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("Период", Параметры.Период);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)

	СтруктураОтбора = ПолучитьЗначенияПолейВСтрокеНаСервере(Расшифровка);
	
	Если СтруктураОтбора.Свойство("Фильм") Тогда
		
		ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(Отчет));

		СтруктураОтбора.Вставить("Расшифровка", Расшифровка);
		
		ДоступныеДействия = Новый Массив;
		ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение);
		
		ДополнительныеПунктыМеню = Новый СписокЗначений;
		ДополнительныеПунктыМеню.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Расшифровать);
		
		Описание = Новый ОписаниеОповещения("ПослеВыбораДействия", ЭтаФорма, СтруктураОтбора);

		ОбработкаРасшифровки.ПоказатьВыборДействия(Описание, Расшифровка, ДоступныеДействия, ДополнительныеПунктыМеню);
		
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьЗначенияПолейВСтрокеНаСервере(Расшифровка)
	
	СтруктураОтбора    = Новый Структура;
	ДанныеОтчета       = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	ЭлементРасшифровки = ДанныеОтчета.Элементы.Получить(Расшифровка);
	
	Если ТипЗнч(ЭлементРасшифровки) = Тип("ЭлементРасшифровкиКомпоновкиДанныхГруппировка") Тогда
		Возврат СтруктураОтбора;
	КонецЕсли;
	
	ПолучитьЗначениеПоляРасшифровки(ЭлементРасшифровки, СтруктураОтбора);
	
	ПараметрПериод = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	Если ПараметрПериод <> Неопределено Тогда
		Для каждого ТекущаяНастройка Из Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
			Если ПараметрПериод.ИдентификаторПользовательскойНастройки = ТекущаяНастройка.ИдентификаторПользовательскойНастройки Тогда
				СтруктураОтбора.Вставить("Период", ТекущаяНастройка.Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат СтруктураОтбора;   
	
КонецФункции

&НаСервере
Процедура ПолучитьЗначениеПоляРасшифровки(ЭлементРасшифровки, СтруктураОтборов)
	
	Если ТипЗнч(ЭлементРасшифровки) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
		Для каждого ЗначениеПоляРасшифровки Из ЭлементРасшифровки.ПолучитьПоля() Цикл
			Если Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляГруппировок.НайтиПоле(Новый ПолеКомпоновкиДанных(ЗначениеПоляРасшифровки.Поле)) <> Неопределено Тогда
				СтруктураОтборов.Вставить(ЗначениеПоляРасшифровки.Поле, ЗначениеПоляРасшифровки.Значение);
			КонецЕсли;
			Для Каждого ЗначениеПоляРасшифровки Из ЭлементРасшифровки.ПолучитьРодителей() Цикл
				ПолучитьЗначениеПоляРасшифровки(ЗначениеПоляРасшифровки, СтруктураОтборов);
			КонецЦикла;
		КонецЦикла;
	ИначеЕсли ТипЗнч(ЭлементРасшифровки) = Тип("ЭлементРасшифровкиКомпоновкиДанныхГруппировка") Тогда
		Для Каждого ЗначениеПоляРасшифровки Из ЭлементРасшифровки.ПолучитьРодителей() Цикл
			ПолучитьЗначениеПоляРасшифровки(ЗначениеПоляРасшифровки, СтруктураОтборов);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораДействия(ВыполненноеДействие, ПараметрВыполненногоДействия, СтруктураОтбора) Экспорт
	
	Перем мПериод;

	Если ВыполненноеДействие <> ДействиеОбработкиРасшифровкиКомпоновкиДанных.Нет Тогда
	
		Если ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение Тогда
			
			ПоказатьЗначение( , СтруктураОтбора.Фильм);
			
		ИначеЕсли ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Расшифровать Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("СформироватьПриОткрытии",   Истина);
			ПараметрыФормы.Вставить("Отбор", Новый Структура("Фильм", СтруктураОтбора.Фильм));
			
			Если СтруктураОтбора.Свойство("Период", мПериод) Тогда
				ПараметрыФормы.Вставить("Период", мПериод);
			КонецЕсли;
		                             
		    ОткрытьФорму("Отчет.ИсторияДанных.Форма", ПараметрыФормы, , Новый УникальныйИдентификатор);
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
