
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	СтандартнаяОбработка     = Ложь;
	ТаблицаЖурналРегистрации = Новый ТаблицаЗначений;
	
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	Период          = НастройкиОтчета.ПараметрыДанных.Элементы.Найти("Период").Значение;
	
	Отбор           = Новый Структура;
	Отбор.Вставить("ДатаНачала", Период.ДатаНачала);
	Отбор.Вставить("ДатаОкончания", Период.ДатаОкончания);
	
	ЗаголовокНастроек = НастройкиОтчета.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Title"));
	ЗаголовокНастроек.Использование = Истина;
	ЗаголовокНастроек.Значение = СтрШаблон(НСтр("ru = 'Журнал регистрации с %1 по %2.'"), Формат(Отбор.ДатаНачала, "ДФ=dd.MM.yyyy"), Формат(Отбор.ДатаОкончания, "ДФ=dd.MM.yyyy"));
	
	Для каждого ЭлементОтбора Из НастройкиОтчета.Отбор.Элементы Цикл
		Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Данные") Тогда
			ИскомыйЭлемент = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ЭлементОтбора.ИдентификаторПользовательскойНастройки);
			Если ТипЗнч(ИскомыйЭлемент) = Тип("ЭлементОтбораКомпоновкиДанных") И ИскомыйЭлемент.Использование Тогда
				Отбор.Вставить("Данные", ИскомыйЭлемент.ПравоеЗначение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ВыгрузитьЖурналРегистрации(ТаблицаЖурналРегистрации, Отбор, "Дата, Компьютер, ПредставлениеПриложения, Данные, ПредставлениеСобытия");
	
	Для каждого СтрокаЖурнала Из ТаблицаЖурналРегистрации Цикл
		Если ТипЗнч(СтрокаЖурнала.Данные) = Тип("Структура") Тогда
			ТекЗначение = "";
			Для каждого КлючИЗначение Из СтрокаЖурнала.Данные Цикл
				Если ЗначениеЗаполнено(КлючИЗначение.Значение) Тогда
					ТекЗначение = ТекЗначение + ?(ПустаяСтрока(ТекЗначение), "", ", ") + СтрШаблон("%1 = %2", КлючИЗначение.Ключ, КлючИЗначение.Значение);
				КонецЕсли;
			КонецЦикла;
			СтрокаЖурнала.Данные = ТекЗначение;
		КонецЕсли;
	КонецЦикла;
	
	ВнешниеНаборыДанных = Новый Структура("ТаблицаЖурналРегистрации", ТаблицаЖурналРегистрации);
	КомпоновщикМакета   = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки     = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);

	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

КонецПроцедуры
