#Область ПрограммныйИнтерфейс

Функция КонвертироватьФайлНаСервере(АдресВХранилище, Форма) Экспорт

	Перем КодВозврата;
	
	УтилитаКонвертацииИзображений = Константы.УтилитаКонвертацииИзображений.Получить();
	УтилитаОбработкиИзображений   = Константы.УтилитаСжатияИзображений.Получить();
	
	Если ПустаяСтрока(УтилитаОбработкиИзображений)
		ИЛИ ПустаяСтрока(УтилитаКонвертацииИзображений)
	Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТекущаяКартинка = ПолучитьИзВременногоХранилища(АдресВХранилище);
	Если ТипЗнч(ТекущаяКартинка) <> Тип("Картинка") Тогда
		Возврат Неопределено;
	ИначеЕсли ТекущаяКартинка.Вид = ВидКартинки.Пустая Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИмяВременногоWebp = ПолучитьИмяВременногоФайла("webp");
	ИмяВременногоPNG  = ПолучитьИмяВременногоФайла("png");
	
	Попытка
		ТекущаяКартинка.Записать(ИмяВременногоWebp);
	Исключение
		Возврат Неопределено;
	КонецПопытки;

	СтрокаКоманды = СтрШаблон("%1 %2 -o %3", УтилитаКонвертацииИзображений, ИмяВременногоWebp, ИмяВременногоPNG);
	ЗапуститьПриложение(СтрокаКоманды, , Истина, КодВозврата); // webp -> png
	Если ТипЗнч(КодВозврата) <> Тип("Число") ИЛИ КодВозврата <> 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтрокаКоманды = СтрШаблон("%1 -out jpeg -overwrite -no_auto_ext %2", УтилитаОбработкиИзображений, ИмяВременногоPNG);
	ЗапуститьПриложение(СтрокаКоманды, , Истина, КодВозврата); // png -> jpeg
	
	НоваяКартинка = Новый Картинка(ИмяВременногоPNG);
	УдалитьФайлы(ИмяВременногоWebp);
	УдалитьФайлы(ИмяВременногоPNG);

	Если ТипЗнч(НоваяКартинка) = Тип("Картинка")
		И НоваяКартинка.Вид <> ВидКартинки.Пустая
			И НоваяКартинка.Формат() = ФорматКартинки.JPEG
	Тогда
		Возврат ПоместитьВоВременноеХранилище(НоваяКартинка, Форма.УникальныйИдентификатор);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти
